{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-02T16:36:38.000Z\", \"description\": \"<p>Blucora has a bold aspiration: we are committed to giving all people the tools needed to lead healthy financial lives - tools often reserved for the wealthy.</p><p><br></p><p>We now turn to the next leg, developing the technological tools that make our vision of financial health for all a reality. Atypical for the financial services industry, we take a contemporary approach to strategy and product development that is founded in user insights, rapid testing, and a singular focus on driving end-user value.&nbsp;</p><p><br></p><p>Since charting new territory on a daily basis is part of everyone's job at Blucora, we've attracted team members who thrive on the challenge, encourage each other, and are passionately committed to the goal. If you agree that problem-solving is a team sport, and feel energized by a good debate, deep-dive research, or a fun night out with colleagues, we might be the right firm for you!</p><p><br></p><p><strong><u>Position Summary</u></strong></p><p>&nbsp;</p><p>TaxAct, a subsidiary of Blucora and sister company to Avantax Wealth Management &amp; Avantax Planning Partners is seeking a <strong>Software Engineer I - Front End</strong>&nbsp;that will serve as a technical&nbsp;contributor&nbsp;toward&nbsp;the implementation&nbsp;and management&nbsp;of&nbsp;the website and&nbsp;digital marketing&nbsp;strategies&nbsp;for TaxAct.&nbsp;This role&nbsp;will support a data-driven&nbsp;MarTech&nbsp;team,&nbsp;leveraging best-in-class tools and techniques to audit,&nbsp;develop&nbsp;and enhance&nbsp;the technology&nbsp;that drives&nbsp;digital experiences in mobile, app, and web.&nbsp;This includes core contribution to&nbsp;the&nbsp;creation&nbsp;of the TaxAct&nbsp;website,&nbsp;landing page, and other content&nbsp;experiences. The role requires a combination of strong analytical,&nbsp;technical,&nbsp;and problem-solving skills.&nbsp;&nbsp;</p><p><br></p><p><strong><u>Essential Duties &amp; Responsibilities</u></strong></p><p><br></p><p>Seeking&nbsp;a&nbsp;passionate and creative&nbsp;individual&nbsp;who&nbsp;can successfully execute the following duties and responsibilities:&nbsp;</p><p><br></p><ul><li>Lead the&nbsp;implementation&nbsp;and development of core functionality that will be used across TaxAct&nbsp;online&nbsp;shopping&nbsp;experiences.</li><li>Manage&nbsp;CMS&nbsp;content&nbsp;development&nbsp;for&nbsp;marketing-oriented&nbsp;site content including home page,&nbsp;landing page, and in product&nbsp;content;&nbsp;maintenance of the content model and other&nbsp;related&nbsp;responsibilities.&nbsp;</li><li>Manage&nbsp;the&nbsp;implementation of&nbsp;website A/B testing program including but not limited to the&nbsp;translation of a test plan into a fully configured,&nbsp;QAed&nbsp;deployment with&nbsp;measurement of&nbsp;final&nbsp;results.&nbsp;</li><li>Work closely with internal media team to define,&nbsp;develop&nbsp;and deploy measurement techniques for digital marketing and paid media campaigns within the Tag Management System.&nbsp;</li><li>Partner with the Marketing&nbsp;Brand&nbsp;team to drive implementation of on-site strategies.&nbsp;</li><li>Work closely with the Advanced Analytics team for the support of diagnostic, QC review of tracking associated with Data Science and Data Visualization projects.&nbsp;</li><li>Partner with front-end website development team on annual website rollover and maintenance duties.&nbsp;</li><li>Conduct thorough and rigorous testing and validation of data within marketing technology platforms.&nbsp;</li><li>Be&nbsp;customer-obsessed&nbsp;(both&nbsp;internal&nbsp;customers&nbsp;and&nbsp;the TaxAct&nbsp;customers)&nbsp;to&nbsp;create an&nbsp;environment&nbsp;focused on&nbsp;overarching marketing goals, delivering&nbsp;innovative&nbsp;products and services&nbsp;to support&nbsp;the initial onsite&nbsp;and&nbsp;tax filing&nbsp;experiences.&nbsp;</li><li>Strong collaborator&nbsp;who&nbsp;partners with internal team and coordinates&nbsp;across&nbsp;teams of engineering,&nbsp;QA, architecture,&nbsp;and other stakeholders.&nbsp;</li><li>Partner with the engineering and&nbsp;architecture&nbsp;teams to collaborate on future design&nbsp;and ensure&nbsp;the&nbsp;team is delivering against that future state.</li><li>Other job duties as designed.</li></ul><p><br></p><p><strong><u>Education &amp; Experience</u></strong></p><p><br></p><ul><li>Bachelors&nbsp;degree in Engineering, Computer Science or&nbsp;certification from a&nbsp;professional programming course/school (relevant professional level experience considered in lieu of a degree).</li><li>Recent college graduate candidates will be considered given&nbsp;alignment with&nbsp;related internships and coursework.&nbsp;&nbsp;</li><li>Experience with modern web development - focus on frontend capabilities (Javascript, React, CSS, HTML).</li><li>The ideal candidate has exposure to Tag Management (ex: Google Tag Manager, Tealium, or Adobe Dynamic Tag Management).&nbsp;</li><li>Proficiency with source control including Git.&nbsp;</li><li>Strong analytical skills, attention to detail.</li><li>Knowledge of Salesforce Cloud or other enterprise platforms is a plus.&nbsp;</li><li>Experience with PHP programming on WordPress websites&nbsp;is a plus.</li><li>Prior experience working with CMS, A/B testing, and/or Heat Map testing tools&nbsp;is a plus.</li><li>Knowledge of Design Thinking methodologies&nbsp;is a plus.</li><li>Prior experience working with AWS technologies is a plus.</li><li>Background knowledge of ADA/SEO is a plus.</li></ul><p><br></p><p><strong><u>Physical Demand &amp; Work Effort</u></strong></p><p><br></p><ul><li>Keying/typing, standing, walking.</li><li>Sitting for an extended period.</li><li>Constant mental and/or visual attention; the work is either repetitive or diversified requiring constant alertness in an office environment.</li><li>The job is typically performed under comfortable working conditions; any disagreeable elements are generally absent during the normal performance of the job.</li><li>Compliance with company attendance standards.</li></ul><p><br></p><p><strong><u>Comprehensive Benefits</u></strong></p><p>&nbsp;</p><p>We offer a competitive salary, outstanding benefits package that includes medical, dental, vision, life insurance, paid vacation and sick days, paid holidays, tuition reimbursement, and 401(k) with company match.</p><p>&nbsp;</p><p>#TaxAct</p><p><br></p><p><em>At Blucora, we believe our work benefits from the diverse perspectives of our employees. As such, Blucora welcomes and celebrates diversity and inclusion and is committed to equal opportunity employment. At Blucora, you can expect a supportive, open, and inclusive atmosphere and a team that values your contributions.</em></p><p><br></p><p><em>Blucora, Inc. and its subsidiaries, Avantax Wealth Management, Avantax Planning Partners (formerly HK Financial Services), and TaxAct are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants without regard to race, color, religion, sex, national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, veteran status, and any other status protected under federal or state law. Blucora considers information gathered in the hiring process, including information on this application, confidential, and only shares it on a need-to-know basis or as required by law. </em></p><p><br></p><p><em>If you need assistance or accommodation due to a disability, you may contact us at HR@Blucora.com or by calling 972-870-6000 to speak with a member of the HR Talent Acquisition team.</em></p>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"TaxAct\", \"sameAs\": \"https://www.linkedin.com/company/taxact\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQH_859H1fPYuA/company-logo_200_200/0/1578056161002?e=1635984000&v=beta&t=Ik4WF0Ju_7QEOwCzqGEiWEUqUO5T2c54H0IAZjR90To\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"TaxAct\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQH_859H1fPYuA/company-logo_100_100/0/1578056161002?e=1635984000&v=beta&t=sWPcb4ghNiwoeycUG1cdiHRJA-r_-mTaBZ26CayPiDs\", \"industry\": \"Computer Software,Information Technology and Services,Marketing and Advertising\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Dallas\", \"addressRegion\": \"TX\", \"postalCode\": \"75342\", \"streetAddress\": null}, \"latitude\": 32.777977, \"longitude\": -96.79621}, \"skills\": \"\", \"title\": \"Software Engineer I - Front End\", \"validThrough\": \"2021-09-01T16:36:37.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}