{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-10-05T17:39:33.000Z\", \"description\": \"<p><strong>At Weston Solutions, Inc. you will do meaningful work and make valuable contributions. </strong></p><p>Employee-ownership at Weston is a path to professional growth and access to diverse opportunities in a highly connected community that works together across key service areas to make a difference in the environment. Weston continues to evolve and adapt to our changing world as a premier provider of environmental and infrastructure services for over sixty years. In both the public and private sectors our teams help identify, solve, mitigate, and manage critical environmental issues to help clients achieve a more sustainable future.</p><p><br></p><p>Weston is seeking a Mid-Level Air Scientist for scheduled, and time-critical responses to site-related environmental issues, including disaster/emergency response, environmental investigations, and remedial alternative analysis. The Scientist is expected to be proficient in the calibration, maintenance, deployment, use and data collection for handheld, portable and transportable air sampling, and monitoring devices.&nbsp;With limited senior level oversight, he/she will develop and implement sampling/monitoring and data collection plan; Proficient in and knowledge of the implementation of multi-media, multi-matrix sampling techniques and associated analytical methods.</p><p><br></p><p><strong>Location: </strong>Las Vegas, NV</p><p><br></p><p><strong>Knowledge, Skills &amp; Abilities:</strong></p><p><br></p><ul><li>This position requires a minimum of a B.S. Degree and 6 years of recent and relevant experience with air sampling/monitoring protocols.</li><li>Proficient in the calibration, maintenance, deployment, use and data collection for handheld, portable and transportable air sampling, and monitoring devices. With limited senior level oversight, develop and implement sampling/monitoring and data collection plans. Proficient in and knowledge of the implementation of multi-media, multi-matrix sampling techniques and associated analytical methods.</li><li>Work collaboratively with and under the supervision of a senior scientist or project manager.</li><li>Responsible for developing and implementing site-specific work plans and scopes of work.</li><li>Provide technical assistance during field investigations (soil, groundwater, surface water, and sediment sampling).</li><li>Provide technical support during geophysical surveys.</li><li>Responds to releases of oil and hazardous materials and provides site assessment and contractor oversight services.</li><li>Provide oversight during the installation of soil borings and monitoring wells.</li><li>Overseeing site related remedial activities.</li><li>Analyze and interpret geological, geochemical, and geophysical information from sources such as survey data, well logs, boreholes, and aerial photos.</li><li>Assess groundwater and surface water movement to provide advice regarding issues such as waste management, route and site selection, and the restoration of contaminated sites.</li><li>Prepare technical specifications for contractor bid packages.</li><li>Able to plan and lead a site-wide environmental investigation.</li><li>Prepare technical reports based on field activities and findings.</li><li>Apply industry-wide software for the analysis and interpretation of geological data.</li><li>Perform desktop reviews of historical site data.</li><li>Participate in field visits to document environmental conditions at sites.</li></ul><p><br></p><p><strong>Preferred Skills:</strong></p><p><br></p><ul><li>Field instrumentation.&nbsp;&nbsp;Proficient in the use of&nbsp;various&nbsp;air monitoring and&nbsp;multi-media&nbsp;sampling&nbsp;instruments.&nbsp;Abilities include calibration&nbsp;of field instruments, implementation in field, and interpretation of results.</li><li>Experience with&nbsp;Geoprobe&nbsp;sampling; various drilling methods including HSA, ARCH, mud rotary&nbsp;and multimedia sampling.</li><li>Familiarity with the Incident Command System (ICS) 100-800.&nbsp;Completion of ICS courses a plus.</li><li>40-Hour HAZWOPER</li><li>Able to work in Levels C/B</li></ul><p><br></p><p><strong>Expected Outcomes:</strong></p><p><br></p><ul><li>Duties will include being readily available to respond at a moment\\u2019s notice, and periodic field assignments nationwide.</li><li>Calibration and maintenance of a variety of multi-media monitoring and sampling equipment.&nbsp;</li><li>Document field activities and prepared daily and final reports.</li><li>In-field multimedia sampling.</li><li>Proficient in the writing of technical documents and plans.</li><li>Use level D-A PPE to make entries into potentially hazardous areas.</li></ul><p>&nbsp;</p><p><strong>Technical and Operational Scope:&nbsp;</strong></p><p><br></p><ul><li>Exercises judgment on applicability of methods and approaches in use and determines best approaches to problem solving when standard procedures are inadequate.</li><li>Determines best method of data gathering, data base management, and analysis of data to achieve goals.</li><li>Consults with outside specialists to obtain most accurate and timely data possible while meeting project specifications and timetables.</li><li>Prepares reports on methods and procedures as part of overall project.</li><li>Maintain preparedness for immediate mobilization.</li><li>Produces quality samples and sampling techniques from which sound scientific data can be drawn into relevant and pertinent evaluation reports to the client's satisfaction.</li><li>Provides completed projects including draft and final reports within the established budget and schedule.</li><li>Provides accurate identification of specimens and/or sound ecological assessment and evaluations.</li></ul><p><br></p><p><strong>We fully invest in our people: </strong>Weston provides a generous<strong>,</strong> comprehensive benefits package program that offers employees high value options with solid financial protection, meeting the personal needs of its people and their families.</p><ul><li>Medical, Dental, Vision, 401K with base and matching employer stock contributions.</li><li>Paid time off to include vacation, sick, holiday and parental leave.</li><li>Life and disability plans.</li><li>Critical illness and accident plans.</li><li>Work/Life flexibility.</li><li>Professional development opportunities.</li></ul>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Weston Solutions, Inc.\", \"sameAs\": \"https://www.linkedin.com/company/weston-solutions-inc-\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQHe9bKAPT7rVw/company-logo_200_200/0/1519856036045?e=1641427200&v=beta&t=v-MMFnKmWvNze3CuvVJiR2ti3hpUhYwuYwxNl-h82qM\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Weston Solutions, Inc.\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQHe9bKAPT7rVw/company-logo_100_100/0/1519856036045?e=1641427200&v=beta&t=88pM4oan4qRj8I3NtcrGVrjTbTI7HYPJjjQbIGTbH0g\", \"industry\": \"Environmental Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Las Vegas\", \"addressRegion\": \"NV\", \"postalCode\": \"89159\", \"streetAddress\": null}, \"latitude\": 36.16909, \"longitude\": -115.14058}, \"skills\": \"\", \"title\": \"Environmental Scientist\", \"validThrough\": \"2021-11-04T17:39:32.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 72}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}