{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-18T20:07:08.000Z\", \"description\": \"<p>Leads and directs in large-scale, complex, cross-functional projects by reviewing project requirements, translating requirements into technical solutions. Directs root cause analysis of critical business and production issues by reviewing and analyzing information (for example, issue, impact, criticality, possible root cause); directing actions as designated in the plan. Promotes and supports company policies, procedures, mission, values, and standards of ethics and integrity by training and providing direction to others in their use and application; ensuring compliance with them; and utilizing and supporting the Open-Door Policy.</p><p><br></p><p><strong>About the team:</strong></p><p>Walmart Health (WMH) is on a mission to make Healthcare Affordable, Convenient and Accessible. We are the technology arm of WMH focused on building technology platform that will enable value-based care and deliver better outcomes at lower cost for our customers.&nbsp;</p><p>As an Engineer and Leader on the Walmart Health Technology team, you will be working with cutting-edge technology to build a Point of Care platform that will be integrated with one of the leading EMR systems.&nbsp;The platform will empower our customers to access their personal and family health information and provide tools to live healthier. At the same time, this platform will help improve productivity of our healthcare providers so they can focus on delivering safe and high-quality care at affordable prices.&nbsp;</p><p>We are looking for passionate engineers with the desire to disrupt the healthcare industry.&nbsp;A qualified applicant will be someone who likes to win as a team, a problem solver, continuous learner, and who is not afraid to take on new challenges.</p><p><br></p><p><strong>You\\u2019ll sweep us off our feet if you\\u2026</strong></p><p><br></p><ul><li>Have experience in integrating and implementing Healthcare technology solutions.</li><li>Have experience managing and securing highly sensitive data.</li><li>Have developed and deployed Cloud native applications with a microservices architecture.</li><li>Excel working in a fast-paced collaborative environment to solve complex problems.</li><li>Display great communication/collaboration skills and a team-focused approach towards software development.</li><li>Are passionate about teaching and mentoring other engineers.</li><li>Have excellent attention to detail and can articulate the specifics of quality design while enforcing engineering principles.</li><li>Are organized, disciplined, and can manage large projects simultaneously</li><li>Have high standards for code quality and can drive accountability to those standards across the team.</li></ul><p><br></p><p><strong>You\\u2019ll make an impact by:&nbsp;</strong></p><p>As a Staff Software Engineer you will lead the work of small groups of six to ten engineers in software development and design, identifying short- and long-term solutions, reviewing and approving proposed solutions, implementing new architectural patterns, and performing design and code reviews.&nbsp;You will partner closely with Design, Product, and Business partners to develop roadmaps, explore technical feasibility, research and identify solutions, and evaluate 3rd party software solutions.&nbsp;You will be responsible for driving a strong culture of engineering on the team through a devops, CI/CD, automation, and quality first mindset.</p><p><br></p><p><strong><u>What you\\u2019ll bring:</u></strong></p><p><br></p><ul><li>In-depth knowledge of industry best practices, technologies, architectures, and emerging technologies specifically in healthcare systems landscape</li><li>Experienced in Java, React, Node, CI/CD flows, DevOps, Scrum, Kanban, Spring Framework, SQL/NoSQL DB</li><li>Experience delivering solutions for applications at scale leveraging public cloud.</li><li>Experience in architecting, designing, and developing large scale data solutions utilizing a mixture of Big Data and Relational database.</li><li>Experience driving engineering design using Agile process to drive innovation, accelerate decisions and outcomes while minimizing risk.</li><li>Experience in making successful trade-offs that balance the short- and long-term goals and initiatives.</li><li>Ability to work with cross-org stakeholders to plan and deliver critical services.&nbsp;</li><li>Contribute to the development lifecycle in all phases\\u2014from initial ideation, to development, implementation, and testing.</li><li>A strong commitment to mentorship and making your fellow engineers better.&nbsp;</li><li>Strong experience in RESTful Microservices</li><li>Experience in container technologies such as Docker on Kubernetes and CI/CD</li><li>Strong experience in API design, development, and management.</li><li>Clear Communication, including the ability to create functional charts</li><li>Ability to multitask between several different requirements and features concurrently.</li><li>Experience with third-party libraries and APIs.</li><li>Superior analytical skills with a good problem-solving attitude.</li><li>Have a passion for Technology.</li></ul><p><br></p><p><strong>Benefits &amp; Perks:&nbsp;</strong></p><p>Beyond competitive pay, you can receive incentive awards for your performance. Other great perks include 401(k) match, stock purchase plan, paid maternity and parental leave, PTO, multiple health plans, and much more.&nbsp;</p><p><br></p><p><strong>About Global Tech:</strong></p><p>Imagine working in an environment where one line of code can make life easier for hundreds of millions of people and put a smile on their face. That\\u2019s what we do at Walmart Global Tech. We\\u2019re a team of 15,000+ software engineers, data scientists and service professionals within Walmart, the world\\u2019s largest retailer, delivering innovations that improve how our customers shop and empower our 2.2 million associates. To others, innovation looks like an app, service or some code, but Walmart has always been about people. People are why we innovate, and people power our innovations. Being human led is our true disruption.&nbsp;</p><p><br></p><p><strong>We\\u2019re virtual:</strong></p><p>Working virtually this year has helped us make quicker decisions, remove location barriers across our global team, be more flexible in our personal lives and spend less time commuting.&nbsp;Today, we are reimagining the tech workplace of the future by making a permanent transition to virtual work for most of our team. Of course, being together in person is an important part of our culture and shared success. We\\u2019ll collaborate in person at a regular cadence and with purpose.</p>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Walmart\", \"sameAs\": \"https://www.linkedin.com/company/walmart\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQHXJ3GqjqY2yg/company-logo_200_200/0/1625156541828?e=1637193600&v=beta&t=YUw00CD7v-nQL41An02L81vRAXM4FFx7iLr-Ds3CYhs\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Walmart\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQHXJ3GqjqY2yg/company-logo_100_100/0/1625156541828?e=1637193600&v=beta&t=Qz5oHUvmhvbNvc57xodU8w_dg3QXZqbTsr2zvqjfK1I\", \"industry\": \"Retail,Health, Wellness and Fitness,Information Technology and Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Seattle\", \"addressRegion\": \"WA\", \"postalCode\": \"98133\", \"streetAddress\": null}, \"latitude\": 47.60323, \"longitude\": -122.33028}, \"skills\": \"\", \"title\": \"Staff Software Engineer - Devops\", \"validThrough\": \"2021-09-17T20:07:07.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"jobLocationType\": \"TELECOMMUTE\", \"applicantLocationRequirements\": {\"@type\": \"Country\", \"name\": \"United States\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}