{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-09-08T03:29:52.000Z\", \"description\": \"<strong><u>Who You\\u2019ll Work With<br><br></u></strong>At Slalom Build we co-create custom software, data and cloud products with clients who are ready to accelerate their digital transformation. We're passionate about technology, compelled by its potential as we help create the digital products, experiences, and technology-driven organizations that drive true change. We\\u2019re thrilled by the opportunity to build the future we want to see, with anyone willing to join us.<br><br>The Software Engineering capability at Slalom Build brings our clients\\u2019 vision to life! We use modern tools and techniques to build secure, highly scalable software products that handle our clients' most innovative and strategic work. We follow Agile practices when building software components and applications that utilize modern frameworks and cloud scale in order to accelerate our clients' business. Our software engineers are committed to the craft of collaboratively building high-quality and sustainable software products that delight our clients and their customers by taking advantage of emerging tools in an ever-changing technological landscape.<br><br><strong><u>We Build Full-stack Solutions Across a Range Of Established And Emerging Technologies And Techniques According To The Needs Of Our Clients Including<br></u></strong><ul><li>Front end applications targeting native mobile and modern web platforms. Examples include React, Angular and Vue.</li><li>APIs and back end services built using emerging frameworks and architectural patterns. Examples include Node, Typescript, Java and .Net.</li><li>Hosting and application services provided by industry leading cloud providers. Examples include AWS, Azure and GCP.</li><li>Operational efficiencies leveraging modern ecosystems and automated build and deployment pipelines.</li><li>Collaborative build practices that allow our teams to be agile and responsive to our clients\\u2019 needs.<br></li></ul><strong><u>What You\\u2019ll Do<br><br></u></strong>You will focus on building high-quality software as part of a collaborative product engineering team, using your skills to own the development of larger components. By regularly reviewing and contributing to the refinement of your team's work, you\\u2019ll align to project teams working alongside other talented software engineers and architects. You will lend creativity to solving software problems using core development tools and techniques. You will contribute to the entire software stack of the components that you own\\u2014aligning data, API, and UI components to the norms of the rest of the software product. All while experimenting with new technologies and developing skills across the stack and contributing to the positive flow of your team. Specifically, you will:<br><ul><li>Write high-quality application code using emerging technologies and frameworks primarily targeting cloud-based ecosystems.</li><li>Collaborate with other software development capabilities to iteratively develop, validate, and operate software at scale using agile techniques.</li><li>Verify components at the unit and integration level using proven validation techniques.</li><li>Develop supporting scripts and routines that automate procedures and help maintain components in production environments.<br></li></ul><strong><u>What You\\u2019ll Bring<br><br></u></strong>Your primary responsibility will be to deliver functioning, validated code leaning on your experience building production software. You will bring your ability to organize your ideas into design, code, and supporting tests that others on your team can use. Collaboration will be key as you ensure that your components align with the overall technical direction of the product team. Humble expertise will serve you well as you listen and observe the needs of your client in order to best apply your understanding. Curiosity will drive you to understand why your check-in broke the build as well as to lend a hand in maintaining the pipeline. A desire to learn and grow will always be fed by those around you. You take pride in your work and take time to appreciate the little details about the software that you are building.<br><br><strong><u>About Us<br><br></u></strong>Slalom Build is a highly scalable, high-velocity Build as a Service firm. We work with clients in a flexible, collaborative, and repeatable methodology to create custom technology solutions for their most impactful initiatives and to accelerate their digital transformation journey. Over 1400 Builders strong, distributed across dynamic cities, our innovation hubs attract the type of people who contribute to thriving teams. By placing Builders in close proximity to clients\\u2014as well as their cultural and technology cohorts\\u2014we can assure the quality, versatility, and speed that product delivery demands, along with the elasticity and scale to tailor to individual client needs.<br><br>Slalom Build leverages a foundation of innovation inherited from Slalom, a Seattle-based firm that set out in 2001 to disrupt and redefine management consulting. Now 10,000+ professionals strong around the globe, Slalom is deeply engaged with some of the world\\u2019s most influential, change-making enterprises. Learn more at slalom.com<br><br>Slalom prides itself on helping team members thrive in their work and life. As a result, Slalom is proud to invest in benefits that include meaningful time off and paid holidays, parental leave, 401(k) with a match, a range of choices for highly subsidized health, dental, &amp; vision coverage, adoption and fertility assistance, and short/long-term disability. We also offer additional benefits such as a yearly $350 reimbursement account for any well-being related expenses as well as discounted home, auto, and pet insurance.<br><br><em>Slalom is an equal opportunity employer that is committed to diversity and inclusion in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veterans\\u2019 status, or any other characteristic protected by federal, state, or local laws.\\u202f</em>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Slalom Build\", \"sameAs\": \"https://www.linkedin.com/company/slalom-build\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQFL2IGZEbNQtA/company-logo_200_200/0/1625695365684?e=1639008000&v=beta&t=7aUyQjGrw9TW2eg6zzZ8dj4ZnSrB6d8iL0ZCCyNApn0\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Slalom Build\", \"value\": \"JO-1701-760\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQFL2IGZEbNQtA/company-logo_100_100/0/1625695365684?e=1639008000&v=beta&t=7miTn_Q5EFZq9hAnalSRbZwsGkMylz4NIphveGTNUbs\", \"industry\": \"Information Technology and Services,Computer Software,Management Consulting\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Seattle\", \"addressRegion\": \"WA\", \"postalCode\": \"98133\", \"streetAddress\": null}, \"latitude\": 47.60323, \"longitude\": -122.33028}, \"skills\": \"\", \"title\": \"Senior Engineer - Software Development\", \"validThrough\": \"2021-10-08T03:29:52.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}