{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-03T03:39:51.000Z\", \"description\": \"<strong><u>Overview<br><br></u></strong><strong> Who is Virgin Pulse? <br><br></strong>Virgin Pulse, founded as part of Sir Richard Branson\\u2019s famed Virgin Group, helps organizations build employee health and wellbeing into the DNA of their corporate cultures. As the only company to deliver a powerful, mobile-first digital platform infused with live services, including coaching and biometric screenings, Virgin Pulse\\u2019s takes a high-tech-meets-high-touch-approach to engage employees in improving across all aspects of their health and wellbeing, every day \\u2013 from prevention and building a healthy lifestyle to condition and disease management;all while engaging users daily in building and sustaining healthy habits and behaviors. A global leader in health and wellbeing, Virgin Pulse is committed to helping change lives and businesses around the world for good so that people and organizations can thrive, together. Today, more than 3100 organizations across the globe are using Virgin Pulse\\u2019s solutions to improve health, employee wellbeing and engagement, reduce costs and create strong workplace cultures.<br><br><strong>Who are our employees? <br><br></strong>At Virgin Pulse we\\u2019re passionate about changing lives for good. We want to make a difference in the world by helping people be healthy so they can perform at their best, every day, at work and home. Our award-winning solutions support leading employers in improving and simplifying the employee health and wellbeing journey and engaging people in all aspects of their health. But our world-class products and programs are nothing without our people \\u2013 the employees who design, build, promote, sell, test and perfect the latest innovations in workplace health and wellbeing. Our people are our top priority and we invest in their health and happiness. At Virgin Pulse, we have so much more than a strong, supportive company culture \\u2013 have a shared vision for a healthier, happier world.<br><br>Virgin Pulse values and celebrates diversity and is committed to creating an inclusive environment for all employees. We believe in creating teams made up of individuals with various backgrounds, experiences, and perspectives. Why? Because diversity inspires innovation, collaboration, and challenges us to produce better solutions. But more than this, diversity is our strength, and a catalyst in our ability to #changelivesforgood.<br><br><strong><u>What We Are Building<br><br></u></strong>As a Senior Software Engineer at Virgin Pulse, you will work on a scrum team. You bring to the table a base understanding of many modern open-source web technologies and are dedicated to learning more. Each day you will be collaborating with Tech Leads, Product Managers, UX Designers, and other talented Engineers to deliver great solutions on an exponentially growing application.<br><br><strong><u>You'll Be Working On a Platform That Serves<br></u></strong><ul><li> Several million engaged users </li><li> 4.000 Clients across 190 countries, including 25% of Fortune 500 companies </li><li> 50 billion+ consumer-generated API calls a year <br></li></ul><strong><u>Our Technology<br><br></u></strong>Our next generation SAAS platform is using an exciting mixture of technologies: Large scale,\\u202fhighly available, public-facing applications built in Angular for web and native Android/iOS for mobile. Our backend is composed of many different micro-services built using Spring Boot Rest APIs and Apache Storm, backed by a combination of technologies to fit our scaling needs like PostgreSQL, Cassandra/ScyllaDB, Kafka, Redis, and Elasticsearch allowing us to process billions of events using an event-based architecture. All of this is hosted on AWS utilizing tools like Terraform and Ansible to manage our infrastructure.<br><br>At Virgin Pulse we are a big believer in teams owning their features and we have instilled a motto of \\u201cbuild, deploy, run\\u201d. This means teams don\\u2019t just develop features, but they are also responsible for deploying and supporting their features in Production. To support this, we practice CI/CD, allowing each team to deliver value to our customers in as short amount of time as possible, while also giving our teams a continuous feedback loop by using tools like New Relic, ELK, and CloudWatch to monitor application health and performance. The times of weekly, bi-weekly, or even quarterly releases are a thing of the past.<br><br><strong><u>Who You Are<br><br></u></strong><strong> Responsibilities <br></strong><ul><li> You are an experienced Senior Engineer that is looking for an opportunity to join a fast-growing company that will challenge you. </li><li> You are an experienced Software Engineer that is looking to take the next step in your career. </li><li> You are looking to work on an engineering team that takes ownership and supports what they develop. </li><li> You are technical, versatile, and data driven. </li><li> You are not afraid to embrace new technologies. </li><li> You want to work on a team that shares and celebrates victories, learns from losses, operates with a high degree of autonomy, and consistently delivers on what it promises. </li><li> You are comfortable with the idea of CI/CD, \\u201cBuild it, Deploy it, Run It\\u201d, and Agile software development. </li><li> You are an excellent communicator, not only within your team but within Engineering as a whole. </li><li> You want to work for a company that provides ample opportunities for personal and professional growth. </li><li> You embrace our company values of being Hungry, Humble, and Smart. <br></li></ul><strong><u>What Your Typical Day Looks Like<br></u></strong><ul><li> Design, code, and test new platform components, features, and enhancements for our platform </li><li> Working with your team, establish best practices on the development, monitoring, and maintenance of technologies. </li><li> Collaborate with agile cross-functional teams to define, design, and ship new features </li><li> Triage, analyze and improve app performance in production </li><li> Participate in sprint ceremonies to design solutions, estimate effort, and collaborate with the team to effectively plan work </li><li> Unit-test code for robustness, including edge cases, usability, and general reliability </li><li> Document procedures for troubleshooting <br></li></ul><strong><u>Qualifications<br><br></u></strong><strong> What you bring to the team <br></strong><ul><li> 4+ years of mobile development experience </li><li> An in-depth understanding of best practices for software development including testing, monitoring, and design </li><li> Consistently build maintainable and well-tested code </li><li> Excellent problem-solving skills and an in-depth understanding of object-oriented programming </li><li> In-depth understanding of the full mobile software development life cycle </li><li> Excellent communication skills, openness to collaborate, and enthusiasm to deliver as a part of a team </li><li> A passion and drive for learning technologies and applying them pragmatically </li><li> Intrinsic passion for learning and self-development </li><li> Experience in solving problems and tasks of different complexity </li><li> The ability to mentor more junior members of the team </li><li> Can distill complex problems through the application of design patterns </li><li> Regularly perform code reviews, giving detailed feedback/suggestions <br></li></ul><strong><u>You Should At Least Be Familiar With<br></u></strong><ul><li> IOS: </li><ul><li> Experience with Swift </li><li> Experience with RESTful APIs </li><li> Experience writing Unit Tests </li><li> Agile Scrum or Kanban methodologies </li><li> Understanding of Apple\\u2019s design principles and interface guidelines </li><li> Familiarity with continuous integration </li><li> Experience with iOS frameworks such as Core Data, Core Animation, etc. </li></ul><li> Android: </li><ul><li> Experience with Kotlin </li><li> Experience working with remote data via REST and JSON </li><li> Experience with Android SDK </li><li> Experience with third-party libraries and APIs </li><li> Experience writing Unit Tests </li><li> Agile Scrum or Kanban methodologies </li><li> Understanding of Android design principles and interface guidelines </li><li> Familiarity with continuous integration </li><li> Experience with Android frameworks </li><li> Understanding of design patterns <br></li></ul></ul><strong><u>What Makes You Stand Out<br></u></strong><ul><li> iOS: </li><ul><li> Experience with a reactive framework (RxSwift, ReactiveCocoa) </li><li> Experience with offline storage, multithreading, and performance tuning </li><li> Familiarity with continuous integration </li><li> Experience with most common iOS architectures (MVC, MVVM, VIPER) </li><li> Experience with a dependency manager (Cocoapods, Carthage) </li><li> Familiar with Bluetooth, NFC or other short distance wireless communication technologies </li></ul><li> Android: </li><ul><li> Experience with reactive programming (RxJava, RxKotlin) </li><li> Experience with offline storage, database management systems (Room), multithreading, </li><li> and performance tuning </li><li> Familiarity with continuous integration </li><li> Experience with most common Android architectures (MVVM)</li><li> Familiar with Bluetooth, NFC, or other short-distance wireless communication </li><li> technologies </li><li> Experience with building accessible apps </li><li> Experience with publishing apps </li><li> Experience in monitoring app health through various tools (firebase, new relic, etc) <br></li></ul></ul>No candidate will meet every single desired qualification. If you may be a good fit, we encourage you to apply. Virgin Pulse is an equal opportunity organization and is committed to principles of social justice, equity, diversity and inclusion. As we are committed to diversifying our company, we make a particular effort to recruit and encourage candidates that are historically from underrepresented communities to apply for open positions.<br><br><strong><u>Security Competencies<br><br></u></strong>Work to maintain system and data security at a high standard, ensuring the confidentiality, integrity and availability of the Virgin Pulse application is not compromised. Adhere to industry best practice coding standards and verify all code developed at Virgin Pulse is free from bugs and security vulnerabilities such as those defined and published by OWASP.<br><br><strong> Why work here? <br></strong><ul><li>We believe a career should provide competitive pay and benefits, a collaborative and supportive work environment, strong employee culture and cutting-edge technology and services \\u2014 so many reasons to love it here.</li><li>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to any protected class status.</li><li> Please note that Virgin Pulse representatives will only communicate with you via our own corporate communication tools with virginpulse.com email addresses and through partnership with our Applicant Tracking System, iCIMS, which will clearly reference Virgin Pulse. We do not use third part apps like WIRE or WhatsApp to communicate.</li><li>At no time during the interview process will we ask you for secure PII data unless you are offered a job with Virgin Pulse. Should you be offered a job, and accept, you will be proivded with secure links through our partnership with ADP.</li></ul>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Virgin Pulse\", \"sameAs\": \"https://www.linkedin.com/company/virgin-pulse\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQFWga-jSjuEow/company-logo_200_200/0/1561054812958?e=1635984000&v=beta&t=gbNZ4bXGk-VyD_7KONHLodr5wp4V7YBUgxvTqrrX9uI\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Virgin Pulse\", \"value\": \"1858\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQFWga-jSjuEow/company-logo_100_100/0/1561054812958?e=1635984000&v=beta&t=ziyevjoPo8pXp0TaVC72Z5BExVsUdW7TpcaGcDdK-6s\", \"industry\": \"Computer Software,Health, Wellness and Fitness,Hospital & Health Care\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Providence\", \"addressRegion\": \"RI\", \"postalCode\": \"02903\", \"streetAddress\": null}, \"latitude\": 41.824463, \"longitude\": -71.41275}, \"skills\": \"\", \"title\": \"Senior Software Engineer - Mobile\", \"validThrough\": \"2021-09-02T03:39:51.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 48}, \"estimatedSalary\": {\"@type\": \"MonetaryAmount\", \"currency\": \"USD\", \"value\": {\"@type\": \"QuantitativeValue\", \"minValue\": 100000, \"maxValue\": 147000, \"unitText\": \"YEAR\"}}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}