{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-25T05:18:12.000Z\", \"description\": \"<strong>Our Purpose<br><br></strong>We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team \\u2013 one that makes better decisions, drives innovation and delivers better business results.<br><br><strong>Job Title<br><br></strong>Software Development Engineer I<br><br>Mastercard works to connect and power a sustainable and inclusive global economy. Software engineers at Mastercard build the systems that process transactions, analyze data and detect fraud to gain insight into the direction of the economy on behalf of our customers. We are focused on building simple, safe and smart solutions that instill trust in every interaction. Our industry expertise is enhanced by our commitment to being a force for good in the world and to doing well by doing good.<br><br>Mastercard relies on our global workforce to help us achieve our goal of building a sustainable, inclusive global economy. We cultivate an environment for all employees that respects their strengths, views, and experiences through a global and collaborative culture of inclusion and a sense of belonging.<br><br>Mastercard software engineering teams are obsessed with security, reliability, and performance and driven to deliver solutions that delight our customers. We are looking for talented software engineers to develop advanced technologies and applications that are revolutionizing payments.<br><ul><li> Are you passionate about software engineering?</li><li> Do you enjoy seeing your code have real-world impact on a wide range of<br></li></ul>customers and important problems?<br><ul><li> Do you want to join a company that offers a competitive benefits program<br></li></ul>that attracts and retains the most talented engineers around the world?<br><ul><li> Do you want to work for a company that offers additional benefits that<br></li></ul>match our values such as flexible work hours, paid volunteer days,<br><br>charitable matching, and tuition assistance?<br><ul><li> Do you thrive in a place where you are continuously learning more while<br></li></ul>growing your skills and career?<br><ul><li> Do you want to join an inclusive culture where employees, in all their<br></li></ul>diversity, feel valued, respected, and who can bring their authentic selves to<br><br>work? Learn more at Mastercard\\u2019s Corporate Sustainability Report.<br><br>The Software Development Engineer I is a full time role within Mastercard Launch, a cohort based, graduate development program designed to build the skills you\\u2019ll leverage most as an innovator in the payments space. Eligibility requires that you currently be a graduating senior, pursuing a relevant degree.<br><br><strong><u>Role<br></u></strong><ul><li> A hands-on engineer who writes high-quality code with a focus on security,<br></li></ul>design, and maintainability.<br><ul><li> Contribute to all phases of software development from design through<br></li></ul>rollout.<br><ul><li> Have strong ownership of your team\\u2019s software including monitoring,<br></li></ul>dependencies, build, and deployments.<br><ul><li> Communicate, collaborate and work effectively in a global environment.<br></li></ul><strong><u>About You<br></u></strong><ul><li> Currently enrolled in a bachelor\\u2019s or accelerated master\\u2019s program,<br></li></ul>completing degree in December of 2021 or May 2022.<br><ul><li> Must be a current US Citizen or permanent resident and will not require<br></li></ul>future sponsorship to work in the US.<br><ul><li> Strong foundation in algorithms, data structures, and core computer<br></li></ul>science concepts.<br><ul><li> Proficiency in one or more general-purpose programming languages such<br></li></ul>as Java, JavaScript, C#, Python, etc.<br><ul><li> Strong written and verbal English communication skills.</li><li> Strong analytical and excellent problem-solving skills.<br></li></ul>Due to COVID-19, most of our employees are working from home. We\\u2019ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we\\u2019re all in this together.<br><br><em>Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. <br><br></em><em>If you require accommodations or assistance to complete the online application process, please contact </em><em>reasonable.accommodation@mastercard.com</em><em> and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.<br><br></em><strong>Corporate Security Responsibility<br><br></strong><strong><u>All Activities Involving Access To Mastercard Assets, Information, And Networks Comes With An Inherent Risk To The Organization And Therefore, It Is Expected That The Successful Candidate For This Position Must<br><br></u></strong>Every person working for, or on behalf of, Mastercard is responsible for information security.<br><ul><li> Abide by Mastercard\\u2019s security policies and practices;</li><li> Ensure the confidentiality and integrity of the information being accessed;</li><li> Report any suspected information security violation or breach, and</li><li> Complete all periodic mandatory security trainings in accordance with Mastercard\\u2019s guidelines.</li></ul>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Mastercard\", \"sameAs\": \"https://www.linkedin.com/company/mastercard\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQGOW4NIyYRRqQ/company-logo_200_200/0/1519856263087?e=1638403200&v=beta&t=XecV6KmIzkaNvC3SIaCYOvn4nvblj-pqPfBNKqTxCSc\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Mastercard\", \"value\": \"R-134929\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQGOW4NIyYRRqQ/company-logo_100_100/0/1519856263087?e=1638403200&v=beta&t=NJX1BSW65UDf98QoZxLK8r9aca0q_4y20DCBFGPGlrg\", \"industry\": \"Financial Services,Information Technology and Services,Internet\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Boston\", \"addressRegion\": \"MA\", \"postalCode\": \"02118\", \"streetAddress\": null}, \"latitude\": 42.358994, \"longitude\": -71.05863}, \"skills\": \"\", \"title\": \"Software Development Engineer I\", \"validThrough\": \"2021-09-25T05:18:17.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}