{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-17T07:12:39.000Z\", \"description\": \"Not Applicable<br><br><strong><u>Qualification<br><br></u></strong>Graduate<br><ul><li> * Clearly undestrand community career lattice and be able to explain the same to team members.</li><li> * Demostrate appreciation of diversity and inclusion in professional interactions.</li><li> * Highlight any observable deviations in areas of diversity and inclusion.</li><li> * Refer new talent for hiring.</li><li> * Conduct hiring discussions.</li><li> * Identify potential retention risks.</li><li> * Facilitate mentorship process in a small community of members.</li><li> * Inculcate community brand positioning professional iteractions.</li><li> * Report any deviations from people practices that do not reflect organizational values.</li><li> * Conduct people management processes with fairness, transparency and diligent.<br></li></ul><strong><u>Kra-2<br><br></u></strong>Delivering superior engineering outcomes:<br><ul><li> * Understand the competencyproficiency role mapping for self.</li><li> * Solicit performance feedback and use it to identify proficiency gaps in the remit of the role.</li><li> * Update the home manager of any concerns with regards to the responsibilities undertaken in an engagement.</li><li> * Help team members articulate project expectations, provide guidance and supervision to deliver the defined tasks.</li><li> * Participate actively in responding to requests for help/assistance.</li><li> * Proactively engage with members to understand their challenges and direct them to knowledge centers within the community.</li><li> * Make judicious and practical commitments while undertaking engineering responsibilities.</li><li> * Highlight any dependencies, risks and bottnecks which can influence your commitments.</li><li> * Make every effort to ensure your commitments are honoured and delivered.</li><li> * Proactively reach out for feedback from peers and managers.</li><li> * Provide reviews and feedback when requested by peers.</li><li> * Work out an improvement plan with the managers when applicable.</li><li> * Understand the metrics that are relevant for benchmarking different activities.</li><li> * Understand the impact of the metrics to the business outcomes of the customer.</li><li> * Understand how the metrics are mapped and tracked in Cognizant system.<br></li></ul><strong><u>Kra-3<br><br></u></strong>Fostering strong competency:<br><ul><li> * Clearly understand enablement goals and be able to explain the same to team members.</li><li> * Identify the enablement needs of the team.</li><li> * Set up strategy and processes for driving competency gap identification and closures at a community level.</li><li> * Drive bestpractices for eliciting competencyproficiency gaps.</li><li> * Set up a plan for closing individual rolecompetency gaps and work towards the same.</li><li> * Facilitate participation of team members in various experience building forums.<br></li></ul><strong><u>Kra-4<br><br></u></strong>Operating efficiently:<br><ul><li> * Ensure the skill profile and resume are kept current.</li><li> * Manage a roster of interview panelists from your team and ensure nominations are load balanced and respect individual constraints.</li><li> * Prepare knowledge base for providing engagement related induction to new joiners from engineering community.</li><li> * Extend support for helping new community members settle into their new role, including logistical help if required.</li><li> * Trigger a conversation with HCM supervisor for rotation as per the policy.</li><li> * Upskill oneself with new skills while on the job to make oneself eligible for rotation* Be accountable for resolving any conflicts transparently and fairly during the performance management process.</li><li> * Drive community specific performance management operational processes.</li><li> * Keep a tab on the Rewards and Recognition process, rewards granted and works with operations team for required changes.</li><li> * Motivate leads and Managers to reward associates in an appropriate and timely manner.</li><li> * Update Resume in HCM and ensure skill profile in MyCareerApp are current.</li><li> * Mentor your teams to keep record the skill profile promptly and bring newly acquired skills and proficiencies to the notice of their home manager.</li><li> * Contributes to the talent profiling framework and the benchmark associated with the various role &amp; responsibility.</li><li> * Discussion with the associate on the competency gaps and remedial steps required to overcome the gaps.<br></li></ul><strong><u>Kra-5<br><br></u></strong>Building Engineering Mindshare:<br><ul><li> * Identify ideas that can be converted into reusable assets.</li><li> * Contribute towards creating reusable assets.</li><li> * Contribute to white papers under guidance.</li><li> * Contribute to experince papers under guidance.</li><li> * Contribute to case studies under guidance.<br></li></ul>Employee Status : Full Time Employee<br><br>Shift : Day Job<br><br>Travel : No<br><br>Job Posting : Aug 16 2021<br><br><strong><u>About Cognizant<br><br></u></strong>Cognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 185 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @USJobsCognizant.<br><br>Applicants may be required to attend interviews in person or by video conference. In addition, candidates may be required to present their current state or government issued ID during each interview.<br><br>Cognizant is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.<br><br>If you have a disability that requires a reasonable accommodation to search for a job opening or submit an application, please email CareersNA2@cognizant.com with your request and contact information.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Cognizant\", \"sameAs\": \"https://www.linkedin.com/company/cognizant\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQEoboJe0-DUPg/company-logo_200_200/0/1625144835174?e=1637193600&v=beta&t=3SIj-ajVnN7XDHJzr40lkcTzQGr6ZKpRWIIhGGfx-aE\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Cognizant\", \"value\": \"71588ac0b7b2dd963628e2dedc35c429\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQEoboJe0-DUPg/company-logo_100_100/0/1625144835174?e=1637193600&v=beta&t=qcE5uXx1qTq4AIn14_itzK97D1NayboJ-1SxFY3Eid4\", \"industry\": \"Information Technology and Services,Management Consulting\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Mountlake Terrace\", \"addressRegion\": \"WA\", \"postalCode\": \"98043\", \"streetAddress\": null}, \"latitude\": 47.784832, \"longitude\": -122.3111}, \"skills\": \"\", \"title\": \"Sr. Software Engineer B2\", \"validThrough\": \"2021-09-16T07:12:38.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}