{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-24T01:44:26.000Z\", \"description\": \"L3Harris is dedicated to recruiting and developing diverse, high-performing talent who are passionate about what they do. Our employees are unified in a shared dedication to our customers\\u2019 mission and quest for professional growth. L3Harris provides an inclusive, engaging environment designed to empower employees and promote work-life success. Fundamental to our culture is an unwavering focus on values, dedication to our communities, and commitment to excellence in everything we do.<br><br>L3Harris Technologies is an agile global aerospace and defense technology innovator, delivering end-to-end solutions that meet customers\\u2019 mission-critical needs. The company provides advanced defense and commercial technologies across air, land, sea, space and cyber domains. L3Harris has approximately $18 billion in annual revenue and 48,000 employees, with customers in more than 100 countries.<br><br><strong><u>Description<br><br></u></strong><strong>Job Title: Sr Software Integration and Test Engineer (TS)<br><br>Job Code: SAS20211908-67881<br><br>Job Location: Palm Bay, FL<br><br></strong><strong><u>Job Description<br><br></u></strong>L3Harris Technologies is looking for Software Integration &amp; Test Engineer responsible for development of automated tests, build automation, build deployment. In this role you will design, develop, and integrate software automation for a large data processing system for our Strategic Missions Division. You will support all phases of the software lifecycle, including refining requirements, software automation implementation, integration, debugging, and full documentation. This opportunity also includes DevOps development tasks within Windows and Linux environments as part of a larger team dedicated to the customer mission.<br><br>L3Harris is an agile global aerospace and defense technology innovator, delivering end-to-end solutions that meet customers\\u2019 mission-critical needs. We provide advanced defense and commercial technologies across air, land, sea, space and cyber domains. We bring speed, innovation and flawless execution together with our commitment to make the world more secure.<br><br>In today's complex world, illegal and threatening activities around borders, high-profile events and critical infrastructure put lives, resources and regional stability at risk. The Space &amp; Airborne Systems (SAS) segment focuses on delivering mission solutions for space and airborne domains with defense, intelligence, and commercial applications. Our Intelligence, Surveillance, and Reconnaissance (ISR) solutions serve a broad array of government, civil and commercial customers by enhancing information superiority, contributing to our national security and providing actionable data for the protection of property and human life. We specialize in high-reliability airborne and space-based remote sensing payloads that offer active and motion imaging and data processing, exploitation and dissemination.<br><br><strong><u>Essential Functions<br></u></strong><ul><li>Ability to develop test plans, automated procedures, and reports</li><li>Define test automation strategies for application under test</li><li>Ability to identify and implement automation tools</li><li>Ability to troubleshoot problems and perform root cause analysis</li><li>Collaborate with Systems and Software Engineering disciplines as needed to resolved problems and identify root cause of product defects</li><li>Experience in scripting languages (e.g., Python).<br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>Bachelor\\u2019s degree (in Computer Engineering, Computer Science, Electrical Engineering, or a related engineering field) and a minimum of six years of applicable experience or Master\\u2019s and four years of experience; or equivalent combination</li><li>Two(2) years of experience developing/creating automated tests</li><li>Two(2) years of experience using industry standard tools and agile development processes</li><li>Two(2) years of experience using automation tools.</li><li>Experience with variety of software languages (i.e., C++, C#, Java, Python, among others).</li><li>Experience with Embedded Software Engineering and real time operating systems.</li><li>Active Top Secret security clearance.<br></li></ul><strong><u>Preferred Additional Skills<br></u></strong><ul><li>DevOps or CI/CD experience.</li><li>Experience with team leadership in an automated integration and test environment.</li><li>Active TS/SCI security clearance.<br></li></ul>Please be aware many of our positions require the ability to obtain a security clearance. Security clearances may only be granted to U.S. citizens. In addition, applicants who accept a conditional offer of employment may be subject to government security investigation(s) and must meet eligibility requirements for access to classified information.<br><br>By submitting your r\\u00e9sum\\u00e9 for this position, you understand and agree that L3Harris Technologies may share your r\\u00e9sum\\u00e9, as well as any other related personal information or documentation you provide, with its subsidiaries and affiliated companies for the purpose of considering you for other available positions.<br><br>L3Harris Technologies is proud to be an Affirmative Action/Equal Opportunity Employer. L3Harris is committed to treating all employees and applicants for employment with respect and dignity and maintaining a workplace that is free from unlawful discrimination. All applicants will be considered for employment without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender (including pregnancy, childbirth, breastfeeding or other related medical conditions), gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, characteristic or membership in any other group protected by federal, state or local laws. L3Harris maintains a drug-free workplace and performs pre-employment substance abuse testing and background checks, where permitted by law.<br><br>L3Harris Technologies is an E-Verify Employer. Please click here for the E-Verify Poster in English or Spanish. For information regarding your Right To Work, please click here for English or Spanish.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"L3Harris Technologies\", \"sameAs\": \"https://www.linkedin.com/company/l3harris-technologies\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQEB2mPDbj_TDA/company-logo_200_200/0/1625156630923?e=1637798400&v=beta&t=vEyXpz_Psf4svKR4vGJy4zMYGGD75cjHUdlkeFAIa4w\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"L3Harris Technologies\", \"value\": \"13096312032\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQEB2mPDbj_TDA/company-logo_100_100/0/1625156630923?e=1637798400&v=beta&t=59O5dCYw0LGQd3nrElEP_owKJI8WJsqPS4_WXRwDINw\", \"industry\": \"Information Technology and Services,Defense & Space,Computer Software\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Palm Bay\", \"addressRegion\": \"FL\", \"postalCode\": \"32908\", \"streetAddress\": null}, \"latitude\": 27.999016, \"longitude\": -80.67266}, \"skills\": \"\", \"title\": \"Sr Software Integration and Test Engineer (TS)\", \"validThrough\": \"2021-09-23T01:44:25.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 72}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}