{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-15T13:59:42.000Z\", \"description\": \"<strong><u>Company Description<br><br></u></strong>ISO, a Verisk business, has been a leading source of information about property/casualty insurance risk since 1971. For a broad spectrum of commercial and personal lines of insurance, ISO provides statistical, actuarial, underwriting, and claims information and analytics; compliance and fraud identification tools; policy language; information about specific locations; and technical services. ISO serves insurers, reinsurers, agents and brokers, insurance regulators, risk managers, and other participants in the property/casualty insurance marketplace. To learn more about ISO please visit us at: \\u202fwww.verisk.com/iso. We are proud to be a part of the Verisk family of companies!<br><br>At the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions.<br><br>Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.<br><br>But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.<br><br>It\\u2019s the reason Verisk is part of the UN Global Compact sustainability initiative. It\\u2019s why we made a commitment to balancing 100 percent of our carbon emissions. It\\u2019s the aim of our \\u201creturnship\\u201d program for experienced professionals rejoining the workforce after time away. And, it\\u2019s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers\\u2019 problems.<br><br>At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.<br><br>At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work\\u00ae Certification for the fifth consecutive year. We\\u2019ve been recognized by <em>Forbes</em> as a World\\u2019s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk\\u2019s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.<br><br><strong><u>Job Description<br></u></strong><ul><li>Under supervision, executes project plans for timely project completion. </li><li>Provides technical advice to junior team members </li><li>Utilizes statistical and machine learning techniques to create high-performing models that comply with regulatory and privacy requirements and address business objectives and client needs. </li><li>Performs analyses of structured and unstructured data to solve multiple and complex business problems. utilizing advanced statistical, mathematical and machine learning technique. </li><li>Ability to research and develop new approaches, keeping up to date. <br></li></ul>Tests new statistical analysis methods, software and data sources for continual improvement of quantitative solutions. Implements as needed.<br><ul><li>Creates clear and easy to understand documents for product support (technical). </li><li>Presents analysis ideas, progress reports and results to internal managers, project managers. </li><li>Collaborates with Lead or Principal Data Scientist to develop technical/business approaches and new or enhanced technical tools. Participates in collaborations for implementation. </li></ul><ul><li>Completes all responsibilities as outlined on annual Performance Plan. </li></ul><ul><li>Completes all special projects and other duties as assigned. </li></ul><ul><li>Must be able to perform duties with or without reasonable accommodation. <br><br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>Graduate-level degree preferred with concentration in a quantitative discipline such as statistics, mathematics, economics, operations research, computer science or aligned discipline. </li><li>Skilled with feature engineering, model selection and assessment methodologies, and familiarity with all stages of the data science pipeline. </li><li>Knowledge in and applied experience with statistical and machine learning. </li><li>Applied, practical experience using statistical and machine learning computer languages (e.g. R, Python, SLQ). </li><li>Working familiarity with cloud computing environments. </li><li>Logical, evidence-based problem solving and critical thinking skills. </li><li>The team focused and evidence of supporting project team members. <br><br></li></ul><strong><u>Preferred<br></u></strong><ul><li>Insurance experience, focusing on the personal lines or related business content. <br><br></li></ul><strong><u>Additional Information<br><br></u></strong>Verisk Analytics is an equal opportunity employer.<br><br>All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran&apos;s status, age or disability.<br><br>http://www.verisk.com/careers.html<br><br>Unsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.<br><br><strong>Consumer Privacy Notice<br><br></strong>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"ISO\", \"sameAs\": \"https://www.linkedin.com/company/iso\", \"logo\": \"https://media-exp3.licdn.com/dms/image/C4D0BAQH5INimxY1-XA/company-logo_200_200/0/1519856517672?e=1634169600&v=beta&t=ZveezfMHuBvhdRZlO9_w5JrDVi4i0-qeTruIq260how\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"ISO\", \"value\": \"743999758777569\"}, \"image\": \"https://media-exp3.licdn.com/dms/image/C4D0BAQH5INimxY1-XA/company-logo_100_100/0/1519856517672?e=1634169600&v=beta&t=lhmqeqPfk2EQswzjPbJmWzrPqizbhIsJwOCkvQRHQEk\", \"industry\": \"Information Technology and Services,Insurance,Financial Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Buffalo Grove\", \"addressRegion\": \"IL\", \"postalCode\": \"61709\", \"streetAddress\": null}, \"latitude\": 42.151943, \"longitude\": -87.966774}, \"skills\": \"\", \"title\": \"Data Scientist\", \"validThrough\": \"2021-08-14T13:59:41.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}