{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-22T01:35:40.000Z\", \"description\": \"<strong>Franchise Areas: Application Modernization<br><br></strong><strong>Category:</strong> Services and Consulting<br><br><strong>Subcategory:</strong> Sr. Consultant<br><br><strong>Profile</strong>: CSPSSI_P4<br><br><strong>Full Time/ Part Time</strong>: Full Time<br><br><strong><u>Overview<br><br></u></strong>The Worldwide Consulting Centers (WWCC), which are part of the global VMware Professional Services Organization, are committed to the success of the customer and their digital strategy. The WWCC streamlines the journey for customers to become digital businesses that deliver better experiences to their customers and employees. Under the new VMware Success360 offering, the WWCC delivers high volume, short duration accelerator engagements, which include the onboarding, adoption, consumption, and optimization of the VMware product franchises (multi-cloud, virtual cloud networking, digital workspace, security, and modern applications), that ensure customers rapidly reach their goals by providing expert help every step of the way.<br><br><strong>Role<br><br></strong>The Senior Consultant is an advanced level technology specialist and subject matter expert, providing customer guidance by facilitating technical workshops, creation of low-level designs, and implementation of use cases into high-quality solutions. In addition to customer-facing responsibilities, Senior Consultants also provide technical input to service offering evaluation, customer success initiative, pre-sales and drive best practices in the form of white paper creation.<br><br>VMware Professional Services is committed to offering a collaborative and supportive working environment with a full enablement plan and the opportunity to develop in the latest VMware product franchise technologies and solutions. We promote an inclusive atmosphere where your voice will be heard, and where you will be part of a dynamic team working in partnership with each other.<br><br>We are looking for conscientious and responsible individuals who can build on our successful track record and come with us on the next stage of our journey. We will sponsor your enablement and certification up to and including <strong>VCDX</strong> certification.<br><br>Work for VMware, a global leader in cloud infrastructure &amp; digital workspace technology, accelerates digital transformation for evolving IT environments.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Collaborate with cross-functional VMware project teams which could consist of VMware pre-sales architects, engineers, product management, consulting, and support staff.</li><li>Work as part of a wider project team or independently act as technical lead on Success360 engagements</li><li>Confidently gather use case requirements and creation of low-level designs while functioning as an advisory resource for \\u201cBest Practices\\u201d and driving adoption of VMware solutions.</li><li>Develop use cases into high-quality solutions in your specialist area</li><li>Actively demonstrate commercial awareness and stay within the scope of the contracted work.</li><li>Take ownership and accountability for individual deliverables.</li><li>Define project requirements/issues/constraints with PMs.</li><li>Make accurate impact assessments, and raise, implement, close down, and roll-back plans when required</li><li>Maintain current, high-level technical knowledge of the entire VMware product portfolio and future product direction and expert-level knowledge of the Application Modernization product lines, which include Pivotal</li><li>Have deep expertise with a modern application stack, with experience and familiarity building modern Spring applications with Spring Boot; you are proficient with Spring and related projects</li><li>Are Experienced in building distributed, service-oriented, cloud-based systems</li><li>Have implemented cloud native applications or can demonstrate a thorough understanding of cloud native architecture</li><li>Experience modernizing legacy applications/systems in modern languages</li><li>Experience with Domain-Driven Design</li><li>Experience with Java, Spring, .NET Framework, and/or .NET Core</li><li>Experience with Kubernetes, Chef, Ansible, BOSH, or related automation/orchestration tools</li><li>Some experience working with NTP, SAML, OAuth 2, Active Directory</li><li>Experience using VMware vSphere / ESXi / NSX-T</li><li>Experience in networking and related technologies (e.g. load balancing / DNS / SSL / firewalls / NAT / SDN)</li><li>Assist in the development of our service offerings as well as developing accelerator content, best practices, and white papers.</li><li>Must enjoy working with leading-edge technology and being an intrinsic part of a fantastic team<br></li></ul><strong><u>Requirements<br></u></strong><ul><li>Kubernetes experience a must, Tanzu experience is preferred.</li><li>8+ years of professional services experience.</li><li>3-5 years of experience in customer-facing positions as a consultant, preferably within a system integrator, consulting organization, or IT provider.</li><li>An adaptable and progressive learner wit 2021-05-26T06:21:29.007+00:00 &lt;![CDATA[Senior Consultant, Application Modernization (WWCC) - Opportunity for Working Remotely Franchise Areas: Application Modernization<br></li></ul><strong>Category:</strong> Services and Consulting<br><br><strong>Subcategory:</strong> Sr. Consultant<br><br><strong>Profile</strong>: CSPSSI_P4<br><br><strong>Full Time/ Part Time</strong>: Full Time<br><br><strong><u>Requirements<br></u></strong><ul><li>Kubernetes experience a must, Tanzu experience is preferred.</li><li>8+ years of professional services experience.</li><li>3-5 years of experience in customer-facing positions as a consultant, preferably within a system integrator, consulting organization, or IT provider.</li><li>An adaptable and progressive learner with the ability to explain complex technical concepts to a variety of audiences.</li><li>Ability to work independently and work collaboratively in a team environment.</li><li>An active listener with excellent and confident communications and interpersonal skills with an ability to read complex customer situations and adapt as needed. <br></li></ul><strong>Certification and Education <br></strong><ul><li>Preferably Bachelor\\u2019s degree or equivalent experience.</li><li>Recommended VCAP, VSP, MCSA certification. <br></li></ul><strong><u>Desirable Skills And Experience<br></u></strong><ul><li>Willingness to obtain a federal security clearance</li><li>Experience in delivering engagements under PRINCE2, PMP, or TOGAF frameworks</li><li>Understanding of ITIL framework</li><li>Experience of presenting at a user group, trade show, or similar is highly desirable<br></li></ul><strong>Why Choose VMware? <br></strong><ul><li>Make an impact on your career path; grow professionally and personally by accessing our in-house learning &amp; development opportunities &amp; education assistance program.</li><li>Voice your creative solutions to new and existing problems and watch them become initiatives.</li><li>Thrive in a unique work environment where the emphasis reflects our values of Execution, Passion, Integrity, Customers, and Community.</li><li>Earn a competitive compensation package with performance-based bonuses and increases, a generous benefits package that really takes care of your needs, and unexpected perks that make working here fun!</li><li>This job requisition is not eligible for employment-based immigration sponsored by VMware.<br></li></ul><strong>Apply Now - Let\\u2019s shape the future of what\\u2019s next together.<br><br></strong><strong>Category : </strong>Services and Consulting<br><br><strong>Subcategory: </strong>Consultant<br><br><strong>Experience: </strong>Manager and Professional<br><br><strong>Full Time/ Part Time: </strong>Full Time<br><br><strong>Posted Date:</strong> 2021-05-26<br><br>VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what\\u2019s possible today at http://careers.vmware.com.<br><br>Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"VMware\", \"sameAs\": \"https://www.linkedin.com/company/vmware\", \"logo\": \"https://media-exp3.licdn.com/dms/image/C560BAQGRwuYZeI6aaA/company-logo_200_200/0/1588094413060?e=1634774400&v=beta&t=RHtbVJuSysS3aYM0v9MU3LtNxcDDb-wx3LNnryr9HSs\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"VMware\", \"value\": \"R2107741-en-us-8R2107741-en-us-9\"}, \"image\": \"https://media-exp3.licdn.com/dms/image/C560BAQGRwuYZeI6aaA/company-logo_100_100/0/1588094413060?e=1634774400&v=beta&t=sPJNlJNkPfGZtvSW4qPYDclWNq9zH6G9fm1gC2QjaRs\", \"industry\": \"Information Technology and Services,Computer Software,Financial Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Boston\", \"addressRegion\": \"MA\", \"postalCode\": \"02118\", \"streetAddress\": null}, \"latitude\": 42.358994, \"longitude\": -71.05863}, \"skills\": \"\", \"title\": \"Senior Consultant, Application Modernization (WWCC) - Opportunity for Working Remotely\", \"validThrough\": \"2021-08-21T01:35:39.000Z\", \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 96}, \"jobLocationType\": \"TELECOMMUTE\", \"applicantLocationRequirements\": {\"@type\": \"Country\", \"name\": \"United States\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}