{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-29T00:00:00.000Z\", \"description\": \"<strong>Introduction<br><br></strong>As a Data Scientist at IBM, you will help transform our clients\\u2019 data into tangible business value by analyzing information, communicating outcomes and collaborating on product development. Work with Best in Class open source and visual tools, along with the most flexible and scalable deployment options. Whether it\\u2019s investigating patient trends or weather patterns, you will work to solve real world problems for the industries transforming how we live.<br><br><strong>Your Role and Responsibilities<br><br></strong>We live in a moment of remarkable change and opportunity. The convergence of data and technology is transforming industries and society. IBM Digital Workplace Engineering plays a key role in developing and supporting IBM\\u2019s technology to be digital ready.<br><br>The current opportunity is a role with the Global HR IT team who promote a fresh and energetic approach to innovation, creativity and solution architecture within the CIO. We heavily use advanced technology such as AI and ML (machine learning) and keep on pushing the boundaries. An approach that is borne out by many active projects within our team that have yielded several success stories to date. The principles of collaboration, knowledge sharing, and leadership are promoted within our team and are the foundations that enable motivated individuals with diverse skills to function as part of a highly productive and innovative team.<br><br><strong>Key Responsibilities<br><br></strong>IBM is innovating rapidly in the HR space and our group is helping IBM achieve that goal by doing creative and innovative work. We are currently looking for a suitable candidate to be part of an innovative and ambitious team with<br><br><strong>Responsibilities Including<br><br></strong><ul><li>Identify and propose new use cases</li><li>Break those use cases down into discrete MVPs (minimal viable product)</li><li>Work in code notebooks</li><li>Build &amp; validate models</li><li>Deploy models via APIs into applications or workflows</li><li>Monitor &amp; retrain models</li><li>Use code repositories to version and share code/notebooks</li><li>Visualize the output of their data story in a way that is consumable by all<br><br></li></ul><u><strong>LOCATION: Must be within 50 miles of Southbury, CT </strong></u>(This is NOT a remote position)<br><br><strong>Required Technical and Professional Expertise<br><br></strong><ul><li>Bachelor's Degree in statistics, math, computer science, or data science</li><li>Solid experience with Watson Studio and IBM Cloud (Cloud Pak for Data)</li><li>Solid experience in using Python numerical and scientific libraries like numPy and sciPy.</li><li>Outstanding expertise and hands-on experience on machine learning algorithms</li><li>Experience of incorporating ML &amp; AI concepts into product/service solutions with a focus on deep learning.</li><li>1+ year of experience working with Machine Learning pipeline - data ingestion, feature engineering, modeling including ensemble methods, predicting, explaining, deploying and diagnosing ML models.</li><li>Experience working with offering managers and product teams</li><li>Experience in sharing data science/machine learning experiment results with both technical and business-oriented people.</li><li>Innovative mindset and an ability to take calculated risks with a fall back plan in the back pocket.<br><br></li></ul><strong>Preferred Technical And Professional Expertise<br><br></strong><ul><li>none<br><br></li></ul><strong>About Business Unit<br><br></strong>IBM\\u2019s Digital Workplace Engineering team is focused on engineering tools and applications IBMers need to be effective. Through a family of apps and services, we\\u2019re building an environment which is constantly iterating, solving problems, and working together to push the limits on productivity and collaboration. We are well-positioned to deliver the next chapter of the digital workplace, leveraging expertise in cloud, security, and scale.<br><br><strong>Your Life @ IBM<br><br></strong>Are you craving to learn more? Prepared to solve some of the world's most unique challenges? And ready to shape the future for millions of people? If so, then it's time to join us, express your individuality, unleash your curiosity and discover new possibilities.<br><br>Every IBMer, and potential ones like yourself, has a voice, carves their own path, and uses their expertise to help co-create and add to our story. Together, we have the power to make meaningful change \\u2013 to alter the fabric of our clients, of society and IBM itself, to create a truly positive impact and make the world work better for everyone.<br><br>It's time to define your career.<br><br><strong>About IBM<br><br></strong>IBM's greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries. IBM's greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.<br><br>Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we're also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.<br><br>At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it's time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.<br><br><strong>Location Statement<br><br></strong><strong>Benefits<br><br></strong>In addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access to<br><br>IBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work.<br><br><ul><li>12 weeks of paid parental bonding leave. Family care options are also available to support eligible employees during COVID-19.</li><li>World-class training and educational resources on our personalized, AI-driven learning platform. IBM's learning culture supports your restless attitude to grow your skills and build the depth and scale of knowledge needed to achieve your career goals.</li><li>Well-being programs to support mental and physical health.</li><li>Financial programs that empower you to plan, save, and manage your money (including expert financial counseling, 401(k), IBM stock discount, etc.).</li><li>Select educational reimbursement opportunities.</li><li>Diverse and inclusive employee resource groups where you can network and connect with IBMers across the globe.</li><li>Giving and volunteer programs to benefit charitable organizations and local communities.</li><li>Discounts on retail products, services, and experiences.<br><br></li></ul>This position is eligible for participation in an IBM sales incentive plan. Actual incentive opportunity will be based on performance and the eligible Target Incentive, as addressed in the applicable plan, all of which is subject to change.<br><br>We consider qualified applicants with criminal histories, consistent with applicable law.<br><br>IBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.<br><br><strong>Being You @ IBM<br><br></strong>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"IBM\", \"sameAs\": \"https://www.linkedin.com/company/ibm\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQGjwPKNaVZ7jQ/company-logo_200_200/0/1625578658814?e=1636588800&v=beta&t=CdEjiAB0eaaKuD5U7QE30aICwXMKH7p_0Ldr8JvWcJY\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"IBM\", \"value\": \"1f36c4196bd7ea73a300ed66f4c52a34\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQGjwPKNaVZ7jQ/company-logo_100_100/0/1625578658814?e=1636588800&v=beta&t=2ulauuXHdPLtqP5eRJP9db_cHunioBdpudNSMmv3NdI\", \"industry\": \"Computer Hardware\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Southbury\", \"addressRegion\": \"CT\", \"postalCode\": \"06488\", \"streetAddress\": null}, \"latitude\": 41.46659, \"longitude\": -73.2035}, \"skills\": \"\", \"title\": \"Data Scientist\", \"validThrough\": \"2021-08-29T00:40:39.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 12}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}