{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-31T00:13:50.000Z\", \"description\": \"Join the Spark Team<br><br>We were born of innovation, springing from the curiosity, imagination and dedication of remarkable scientists and healthcare visionaries. Our shared mission is to challenge the inevitability of genetic disease by discovering, developing, and delivering treatments in ways unimaginable \\u2013 until now.<br><br>We don\\u2019t follow footsteps. We create the path.<br><br>The Liver Translational R&amp;D team designs and engineers breakthrough therapies that harness the power of the liver as a platform for production and systemic distribution of therapeutics. The Senior Research Scientist on the Liver R&amp;D Team leads a pre-clinical pipeline from identification lead candidates through proof of concept and IND-enabling studies. She/he will lead efforts in assay development, perform data analysis independently, and communicate scientific findings to executive leadership. In addition, the Senior Scientist serves as a subject matter expert to support cross-functional research efforts across the Translational R&amp;D Department.<br><br><strong><u>He/she Will Be Responsible For<br></u></strong><ul><li> Developing strategies to optimize potency and efficacy of gene therapy vectors.</li><li> Creating novel approaches to enhance specificity, regulatability, and durability of gene therapy vectors.</li><li> Design and support in vivo studies to assess the efficacy and safety of lead candidate therapeutics.</li><li> Analyze and summarize experimental findings in the form of study reports, peer-reviewed manuscripts, and oral/poster presentations at scientific meetings.</li><li> Initiate and manage external research collaborations with contract research organizations and academic investigators in a diverse array of scientific disciplines.</li><li> Mentor and train Research Scientists and Research Associates on the Liver Team.</li><li> Leverage orthogonal datasets to synthesize new insights into biomarkers and signaling dynamics relevant to measuring therapeutic efficacy or providing new treatment modalities for target diseases.<br></li></ul><strong><u>Responsibilities<br><br></u></strong>70%<br><br>Identify and validate new indication targets and optimize gene expression cassettes to support both existing and new programs in the pipeline. This includes executing experiments on the bench, extensive literature review, championing product candidate development from proof of concept to IND submission, etc.<br><br>15%<br><br>Design experiments, organize, discuss, and record experimental data<br><br>10%<br><br>Generate technical reports, prepare presentation slides, generate novel concepts.<br><br>5%<br><br>Trainings, lab meetings and administration work<br><br><strong><u>Requirements<br></u></strong><ul><li> A degree in the life sciences in a relevant field such as molecular biology, cell biology, biochemistry, or genetics/genomics w/ 3-5 years of related experience required. </li><li> 3 to 5 years of post-degree research experience. Post-doctoral or industry experience preferred. </li><li> Subject matter expert in the fields of gene and protein engineering, gene therapy, synthetic or systems biology, biotechnology, structural biology, or immunology. </li><li> An ability to innovate, learn new technologies, and develop assays from scratch. </li><li> Familiarity with target lead identification/optimization using a combination of molecular, cellular and in vitro/in vivo techniques. </li><li> Strong analytical skills and problem-solving capabilities. </li><li> Excellent communication skills (both oral and written). </li><li> Experience with IND enabling studies, regulatory filings, and GLP studies is a plus. </li><li> Professional commitment to performance excellence. <br></li></ul><strong><u>Competencies<br></u></strong><ul><li> Experience in general and advanced lab techniques such as molecular cloning and plasmid design and construction, qPCR, ELISA, cell culture, plate-based luciferase and/or enzymatic activity assays, SDS-PAGE/western blotting, etc. </li><li> Ability to mentor junior team members. </li><li> Highly adaptable and comfortable in an environment with dynamic priority demands. </li><li> Strong communication skills, exhibiting the ability to clearly and concisely describe research to a cross-disciplinary audience. </li><li> Rigorous and conscientious, exhibiting care and thoroughness in data interpretation. </li><li> Proactive and collaborative mindset, exhibiting an enthusiastic team attitude. </li><li> Meticulous record keeping, documentation, and reporting of research. </li><li> Independently learn, understand, and utilize current and developing industry practices, techniques, and standards in a rapidly changing field. </li><li> Goal-driven and strong organizational skills. </li><li> Experience managing external collaborations is a plus <br></li></ul>Please be aware that Spark mandates COVID-19 vaccination of all employees regardless of work location. Accommodations may be made in accordance with applicable law.<br><br>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Spark Therapeutics, Inc.\", \"sameAs\": \"https://www.linkedin.com/company/spark-therapeutics-inc\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQFzJ4q08gUrNg/company-logo_200_200/0/1519872937735?e=1638403200&v=beta&t=DnfsqAZDV4j_6n0lioFaNRUalP7ydLWRRYC0mXmn2aU\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Spark Therapeutics, Inc.\", \"value\": \"784602800\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQFzJ4q08gUrNg/company-logo_100_100/0/1519872937735?e=1638403200&v=beta&t=HVjBjYijwF2ME2uUAw3oiVXmI4zA1kKrWP7DLiXA7bs\", \"industry\": \"Biotechnology,Pharmaceuticals,Research\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Philadelphia\", \"addressRegion\": \"PA\", \"postalCode\": \"08051\", \"streetAddress\": null}, \"latitude\": 39.95106, \"longitude\": -75.16562}, \"skills\": \"\", \"title\": \"Sr. Research Scientist-Liver 1\", \"validThrough\": \"2021-09-30T00:13:51.000Z\", \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 36}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}