{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-09-02T05:32:06.000Z\", \"description\": \"<strong><u>Job Description<br><br></u></strong>Important Note: During the application process, ensure your contact information (email and phone number) is up to date and upload your current resume when submitting your application for consideration. To participate in some selection activities you will need to respond to an invitation. The invitation can be sent by both email and text message. In order to receive text message invitations, your profile must include a mobile phone number designated as \\u201cPersonal Cell\\u201d or \\u201cCellular\\u201d in the contact information of your application.<br><br>At Wells Fargo, we are looking for talented people who will put our customers at the center of everything we do. We are seeking candidates who embrace diversity, equity and inclusion in a workplace where everyone feels valued and inspired.<br><br>Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.<br><br>Technology sets IT strategy; enhances the design, development, and operations of our systems; optimizes the Wells Fargo infrastructure; provides information security; and enables Wells Fargo global customers to have 24 hours a day, 7 days a week banking access through in-branch, online, ATMs, and other channels.<br><br>Our mission is to deliver stable, secure, scalable, and innovative services at speeds that delight and satisfy our customers and unleash the skills potential of our employees.<br><br>This position will be a Software Engineer supporting our Community Banking Gateway application, Community Banking Voltron application and the Community Banking Data Warehouse (CBDW) application. The Gateway application supports Community Banking reports. The Voltron application stores data used for Community Banking reporting. CBDW is a data application system which holds Community Bank data such as product sales data, customer experience data and incentive data.<br><br><strong><u>Responsibilities Include<br></u></strong><ul><li>Work with the product owner and business stakeholders to identify solutions to business needs.</li><li>Attend all Kanban and/or agile team meetings, including the daily stand ups. Be an agile champion.</li><li>Write and maintain all required project documentation needed, such as work flows and user guides.</li><li>Assist the product owner with writing and editing user stories.</li><li>Meet sprint goals.</li><li>Conduct data, functional and web based testing</li><li>Create test plans and test cases. Write, submit and manage testing defects.</li><li>Assist in automating unit/system tests.</li><li>Conduct validation in our production environment.</li><li>Write, maintain and manage all required test documentation.</li><li>Conduct business analysis as needed.</li><li>Providing CBDW application end user support.</li><li>Perform web content changes.</li><li>Acts in a lead technical role providing technical guidance and consultation with application teams, clients, and Engineering Managers for their technology domain environments including but not limited to cloud, middleware, operating systems, applications, Software-as-a-Service, and Platform-as-a-Service products. </li><li>Design, code, test, debug and document programs using agile development practices. </li><li>Provides the strategy and design for projects associated with their technology domain including, upgrades and deployments.</li><li>Utilizes advanced technologies and methods to integrate their technology domain with other technology domains, enabling the creation of new or expanded heterogeneous environments. </li><li>Develops new documentation and departmental technical procedures. Directs the gathering of performance statistics to assist in determining hardware and communication tools needed to support projected transaction volumes, response time and system availability targets. </li><li>May provide guidance and direction to less experienced staff in resolution of highly complex technical problems. </li><li>Assures quality, security and compliance requirements are met for supported technology domain. </li><li>Leads projects and as an escalation point, provides guidance and direction to less experienced staff in resolution of highly complex technical problems. </li><li>Assures quality, security and compliance requirements are met for supported technology domain.<br></li></ul><strong><u>Required Qualifications<br></u></strong><ul><li>5+ years of software engineering experience<br></li></ul><strong><u>Desired Qualifications<br></u></strong><ul><li>An industry-standard technology certification</li><li>Strong verbal, written, and interpersonal communication skills</li><li>1+ year of JIRA experience</li><li>Experience using the team collaboration software Confluence</li><li>Data warehouse experience</li><li>Strong analytical skills</li><li>Proficiency in Excel and other Microsoft Office products (Power Point, Word, Access)</li><li>Experience with Agile methodology of project delivery</li><li>Knowledge and understanding of application lifecycle, from design and development to testing, implementation and production support</li><li>Experience communicating and presenting complex information to multiple levels of the organization</li><li>Experience successfully escalating complex issues and tracking follow-through to completion</li><li>2 + years of SQL Server SSIS, SSRS and SSAS experience </li><li>Knowledge and understanding of technology testing: automation and data automation </li><li>Experience with automation, regression, and performance testing<br></li></ul><strong>Disclaimer<br><br></strong>All offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.<br><br>Relevant military experience is considered for veterans and transitioning service men and women.<br><br>Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation.<br><br><strong><u>Benefits<br><br></u></strong><strong>Benefits Summary<br><br></strong>Visit https://www.wellsfargo.com/about/careers/benefits for benefits information.<br><br><strong><u>Reference Number<br><br></u></strong>5584963-1\", \"employmentType\": \"PART_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Wells Fargo\", \"sameAs\": \"https://www.linkedin.com/company/wellsfargo\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQGLxWPpGqaVmw/company-logo_200_200/0/1607533344544?e=1638403200&v=beta&t=fSRup_Z-JMSrnf3AQDDwgvMR10iKgCvR-plHkqn9DY8\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Wells Fargo\", \"value\": \"5584963-1\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQGLxWPpGqaVmw/company-logo_100_100/0/1607533344544?e=1638403200&v=beta&t=t0o2MNpcxsB5nNHC-9wuapN6of9tzGpiNz4JVi4H8Fg\", \"industry\": \"Financial Services,Investment Management,Banking\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Minneapolis\", \"addressRegion\": \"MN\", \"postalCode\": \"55440\", \"streetAddress\": null}, \"latitude\": 44.977486, \"longitude\": -93.264366}, \"skills\": \"\", \"title\": \"Test Automation - Software Engineer\", \"validThrough\": \"2021-10-02T05:32:06.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 60}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}