{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-30T05:19:42.000Z\", \"description\": \"<strong><u>Job Summary<br><br></u></strong>Job description<br><br>The Project Engineer 4 (PE4) is responsible for the development, design, test, verification, validation, documentation, qualification, support and release of variety of complex electromechanical components and equipment with mechanical, electronics and software content. The PE4 has extensive technical expertise and has full knowledge of design and product support of aircraft equipment and systems and will be able to troubleshoot the equipment successfully and lead in failure root cause analysis. The PE4 extends technical leadership and is able to lead a team of 3 or more engineers and effectively operate in a cross functional team with members of other departments / partners.<br><br>The PE4 interprets customer requirements documents and relate them successfully to the design of new products to meet those requirements. The PE4 is fluent in aircraft regulatory requirements and is able to identify improvement opportunities in the equipment to meet the ever changing needs of the customers. Responsible for the complex electro-mechanical equipment fulfilling the overall system operation, the PE4 has attained the expert level knowledge of the project/system for which s/he is responsible and is responsible for all aspects of safety and regulatory compliance.<br><br><strong><u>Summary Of Duties<br></u></strong><ul><li><li> Is responsible for the creation and execution of product strategies, product IR&amp;D, and product life cycle management.</li><li><li> Provides technical leadership and guidance to other engineers with the capacity to mentor and train engineering staff</li><li><li> Supports proposal activities including identifying applicable innovative technology and providing engineering resource estimation</li><li><li> Monitors project performance metrics, and provide monthly updates to his/her manager on project NRC status (ITD, EAC, variance to plan), product DTC and DTW status. Works with Program Management and Sales to manage all out-of-scope requests and assists with assertions.</li><li><li> Works independently and/or with a team composed of various disciplines including program management, sales and marketing, operations. Leads and oversees all aspects of product design life cycle including research, proposal, development and production phases.</li><li><li> Develops project and/or development plans including schedules, budgets and necessary design resources.</li><li><li> Thoroughly translates equipment specification into a work breakdown structure and product breakdown structure, equipment / component specifications, and allocate software and hardware requirements.</li><li><li> Creates, maintains and checks the lifecycle documentation for aerospace products such as equipment development plan, validation and verification plan / procedures, qualification plan / procedures. Evaluates or generates Engineering Change Requests (ECR's) as appropriate. The project engineer is responsible for the on-time release of the lifecycle documents in compliance to the program schedule.</li><li><li> Ensures compliance of design solutions to performance, safety, reliabi<br><br></li>Job requirements<br><br><strong><u>Education<br><br></u></strong>Qualifications:<br><ul><li><li> Bachelor's degree (B.S. in Electrical or Computer Sciences) or equivalent<br><br></li><strong><u>Experience<br></u></strong><ul><li><li> 12+ years of related experience<br><br></li><strong><u>Other Skills<br></u></strong><ul><li><li> Maintains good organizational skills with the ability to prioritize multiple tasks from internal customers such as project engineers and system engineers.</li><li><li> Vast in depth product and competitive industry intelligence such as competitors IP activities. Viewed as an industry leader in the subject matter</li><li><li> Possess in depth and extensive knowledge of manufacturing methods to allow \\u201cbest fit\\u201d for new product development</li><li><li> Thorough engineering foundation in one or more disciplines such as electrical, thermal, electromechanical, materials, structural, aerospace, and chemical fields.</li><li><li> Mature written and verbal communication skills with the ability to drive consensus to a balanced decision.</li><li><li> Possess strong work ethic with the commitment to excellence. Effective in working independently or within a cross-functional team.</li><li><li> Ability to prioritize and plan work activities. Must use time efficiently and develop realistic achievable action plans.</li><li><li> Excellent problem solving skills based on solid technical reasoning.</li><li><li> Extensive experience in product development under a regulated environment using FAA, SAE, RTCA, OEM and industry guidelines. Knowledge of RTCA-DO160 / 178 / 254 and OEM specifications.<br></li>Additional Preferred Skills: (not required)<br><ul><li><li> Desired leadership experience in Aerospace</li><li><li> Bachelor's degree in mechanical or aerospace engineering<br></li>Description: Senior Level within job role<br><br>EEO Statement<br>It is the policy of Safran to provide equal employment opportunity to all individuals regardless of their race, color, religion, sex, sexual preference, gender identity, pregnancy, age, national origin, disability, military or veteran status, citizenship status, genetics, or any other characteristic protected by applicable federal, state, and local laws.<br><br>Specificity of the job<br><br><strong><u>Working Conditions<br><br></u></strong><li> Does require fluent communication in English.</li><li> Employment status is full-time.</li><li> Minor traveling may be required.</li><li> Protracted or irregular hours may be required.</li><li> Relocation to another facility may be required.<br><br></li>Company information<br>Safran Cabin<br><br>Safran is an international high-technology group, operating in the aviation (propulsion, equipment and interiors), defense and space markets. Its core purpose is to contribute to a safer, more sustainable world, where air transport is more environmentally friendly, comfortable and accessible. Safran has a global presence, with 79,000 employees and sales of 16.5 billion euros in 2020 and holds, alone or in partnership, world or regional leadership positions in its core markets. Safran undertakes research and development programs to maintain the environmental priorities of its R&amp;T and Innovation roadmap.<br><br>Safran ranks first in Forbes's 2020 list of the World's Best Employers for its sector.<br><br>Safran Cabin is a world leader in fully integrated Cabin Interiors, Catering Systems and Cargo Equipment.<br><br></li></li></ul></li></li></li></li></li></li></li></li></li></ul></li></ul></li></ul></li></li></li></li></li></li></li></li></li></ul>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Safran\", \"sameAs\": \"https://fr.linkedin.com/company/safran\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQF12gJLvR-O3Q/company-logo_200_200/0/1519935017250?e=1635984000&v=beta&t=aS_RYzL6Ys1UUfPxq5km4v1F3qzXpt8YpaE_ZWN7K5Q\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Safran\", \"value\": \"88381\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQF12gJLvR-O3Q/company-logo_100_100/0/1519935017250?e=1635984000&v=beta&t=GbQIBQmWeu7cHU7LzU2kYwXGdsetwkpZp4-_jxKluv4\", \"industry\": \"Electrical/Electronic Manufacturing,Aviation & Aerospace,Mechanical or Industrial Engineering\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Huntington Beach\", \"addressRegion\": \"CA\", \"postalCode\": \"92605\", \"streetAddress\": null}, \"latitude\": 33.659775, \"longitude\": -117.99931}, \"skills\": \"\", \"title\": \"Project Engineer 4\", \"validThrough\": \"2021-08-29T05:19:41.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 144}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}