{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-16T17:14:14.000Z\", \"description\": \"Fearless is looking for a <strong>Software Engineer II (React) </strong>to add to our diverse team of 140+ employees (and counting!).<br><br><strong>What you'll be doing:<br><br></strong>We're looking to change the world by building software with a soul, and we want your help. This program is within our Museums Division supporting a culturally significant program.<br><br>The Software Engineer II develops, maintains, and enhances complex software systems that solve customer and user problems. This role brings breadth across software development skills and depth in specific technologies like languages and frameworks that allows them to build effective software solutions. The Software Engineer II shares in the responsibility with other software engineers and team members to deliver maintainable solutions.<br><br>We need your coding skills! What other skills will help you succeed at Fearless? Glad you asked! We're excited about candidates who can accomplish the following:<br><br><strong>Responsibilities and Contributions:<br><br></strong><ul> <li>Coaches and mentors others to develop their professional skills.</li> <li>Takes initiative for their own growth through personal leadership.</li> <li>Decomposes tasks into discrete objectives to serve the strategic direction of the team. </li> <li>Builds software solutions with minimal direction in the form of maintainable code in accordance with the project/organization technical standards.</li> <li>Delivers complete software solutions that function well within the full system including documentation and automated unit/integration tests.</li> <li>Debugs existing software and corrects defects.</li> <li>Performs manual exploratory testing individually and with the team, as appropriate for the project test strategy.</li> <li>Advises the team on specific implementation options that meet business requirements.</li> <li>Contributes actively in team Agile processes through collaboration, discussion, and/or preparation.</li> <li>Provides feedback to improve the team's technical procedures.</li> <li>Collaborates with other Engineers and Designers to implement features that meet design specifications and deliver business value.</li> <li>Contributes during all phases of the development lifecycle from task creation to production deployment of new code.</li> <li>Coaches others on the team through code reviews.</li> <li>Seeks and engages peer-reviews of tasks and deliverables; coaches others when reviewing their tasks and deliverables.</li> <br></ul><strong>Essential Skills, Experience, and Competencies:<br><br></strong><ul> <li>Proficient in web-development including front-end (browser) and back-end (server) including UI components, client-server integrations, APIs, and data persistence. </li> <li>Knowledgable with React, preferably Gatsby and SCSS.</li> <li>Knowledgeable of accessibility/508 compliance.</li> <li>Proficient in at least one programming language and associated framework such as Node.js (express), Python (Django/Flask), Go, Java 8+ (Spring.io), Ruby (Ruby on Rails).</li> <li>Proficient with important libraries and technologies in the ecosystem of programming language expertise.</li> <li>Proficient with the unit testing frameworks appropriate to the language of expertise.</li> <li>Proficient with HTML, Javascript and ability to quickly translate designs into well structured markup and maintainable CSS.</li> <li>Proficient with at least one front-end technology like <strong>React</strong>, Angular, Vue, Ember, Backbone, Svelte.</li> <li>Experience with building applications in containerized development environments.</li> <li>Expert in basic git actions like cloning, creating branches, navigating between branches, staging code for commit, committing code, resetting, and merging.</li> <li>Demonstrated interest in and ability to learn new systems and technology quickly.</li> <li>Ability to discuss technical tasks and team process topics with team members and outside stakeholders.</li> <li>Proficiency with advanced Git actions like rebasing, squashing, and cherry-picking.</li> <li>Ability to operate and manage work, strategically reason, and build relationships and influence others.</li> <br><br></ul><strong>Compensation:<br><br></strong>We believe in paying people fairly, so we've established a compensation model that ensures everyone at Fearless \\u2014 regardless of race, ethnicity, gender, sexual orientation, disability, religion, age, nationality, or negotiation skills \\u2014 is given equal pay for equal work.<br><br><strong>So, what's next?<br><br></strong>Over the years, we've honed a 3-step interview process that helps ensure that every employee we hire is the right fit for us and that we're the right fit for them. If we think you're a good fit, we'll get in touch and start scheduling your interviews!<br><br><ul> <li><strong>Culture Add Interview</strong> - We're a people-first company, so we always start off by getting to know more about you, how you work, what your career goals are, and what you're passionate about. This is your opportunity to ask questions and get a feel for Fearless, so don't be shy!</li> <li><strong>Technical Interview</strong> - This is where we get into the nitty gritty of the project. During the Technical Interview, you'll be interviewed by our Passion Coaches and/or the team's Project Lead to make sure your skills align with the project requirements.</li> <li><strong>Business Interview</strong> - At this point, you've made it to the final frontier! The Business Interview is when you'll meet with Fearless leadership to dot the i's, cross the t's, and determine whether or not we'll be moving forward with the hiring process.</li> <br><br></ul><strong>Why Fearless?<br><br></strong>Our people make us who we are. We believe that every member of the Fearless team has something to share, and we value the unique viewpoint you'll bring to our community. But we value <em>your </em>community, too, so we offer fulfilling work that stays in balance with the rest of life. Because everyone has different needs, desires, and goals, our benefits offer the choices and flexibility that our team members need to live well and succeed. Here are a few highlights of our benefits package:<br><br><ul> <li>Flexible schedule</li> <li>Family-friendly workplace</li> <li>3 weeks accrued PTO + 1 week sick leave + 10 federal holidays + your birthday off</li> <li>100% coverage of the employee-only premium for HSA, HMO, or PPO plan and Employee Wellness Plan</li> <li>Tech, education / training, and snack allowances</li> <li>Free parking in downtown Baltimore / public transit coverage</li> <li>Safe Harbor 401(k) plan with employer contributions</li> <br><br></ul><strong>About Fearless:<br><br></strong>Fearless is a full-stack digital services firm in Baltimore that delivers sleek, modern, and user-friendly software designed to push the boundaries of possibility. It's our mission to build software with a soul \\u2014 tools that empower communities and make a difference \\u2014 so we can create a world where good software powers the things that matter.<br><br>That's not our only goal, though. We also strive to create a purple culture that makes our employees excited to come to work every day. That's why we encourage our employees to pursue their passions, both in and out of the office. With built-in company mentoring, continuing education support, flexible schedules, and a family-friendly work environment, we've created a culture that allows our team to thrive professionally and personally.<br><br>Fearless believes in equal opportunity employment. We won't discriminate against any employee or applicant on the basis of race, gender, nationality, age, religion, disability, military status, or sexual orientation. As a company and as individuals, we're committed to providing an inclusive and welcoming environment for our team, our family members, our clients, our subcontractors, and our vendors.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Fearless\", \"sameAs\": \"https://www.linkedin.com/company/fearlessbmore\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQG1_RrdjLPV6w/company-logo_200_200/0/1535724584960?e=1634774400&v=beta&t=yqroNoEEk-xvBANOMsab1LQXk8EVa0QzPe8L3U79swU\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Fearless\", \"value\": \"3308105\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQG1_RrdjLPV6w/company-logo_100_100/0/1535724584960?e=1634774400&v=beta&t=4OYBfRUVodKHLHgn1lMTxdmjIn_yPj5d698axZZl1TM\", \"industry\": \"Information Technology and Services,Computer Software,Internet\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Baltimore\", \"addressRegion\": \"MD\", \"postalCode\": \"21226\", \"streetAddress\": null}, \"latitude\": 39.290443, \"longitude\": -76.612335}, \"skills\": \"\", \"title\": \"Software Engineer II (React/Gatsby)\", \"validThrough\": \"2021-08-15T17:14:14.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"estimatedSalary\": {\"@type\": \"MonetaryAmount\", \"currency\": \"USD\", \"value\": {\"@type\": \"QuantitativeValue\", \"minValue\": 77300, \"maxValue\": 166000, \"unitText\": \"YEAR\"}}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}