{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-09-12T03:40:36.000Z\", \"description\": \"<strong><u>Job Description<br><br></u></strong><strong> TITLE: </strong> UX Researcher, International - NetSuite GBU<br><br><strong> LOCATION: </strong> Burlington,MA or East Coast Remote<br><br><strong> We Are <br><br></strong>A family of +60 UX Designers and Researchers around the world, working together with Product Managers, Software Engineers, Technical Writers and many other wonderful people. We pursue innovative ways of building user-centered solutions that can scale over time.<br><br>We work using Agile methodologies and iterative processes. We can proudly say we practice Design Thinking and iterate our solutions based on customer feedback and technical feasibility. And we keep the loop going with the efforts of dedicated, committed teams.<br><br>At NetSuite we think out-of-the-box and spend a lot of time brainstorming. The greatest and simplest solutions come from the group effort. And we move forward by bridging Experience Design with Product Management and Engineering at every step.<br><br><strong><u>What We\\u2019re Looking For<br><br></u></strong>We\\u2019re looking for a talented UX Researcher to join our International Experience Design Team as the main researcher for our spanish-speaking Latin American customers and partners, and working collaboratively with the local International Product Manager and a team of PM and Designers spread world-wide. Oracle NetSuite is growing faster than ever, and the company is investing heavily in ensuring the best resources are focused on expanding globally. You will be joining the team that is leading some of the key product initiatives for the company; a global product that feels local.<br><br>You will be focusing on the Internationalization and Localization efforts in LatAm (most specifically in Mexico and Colombia at first). You will empathize with users on these countries and building last-mile functionality that will make the product feel like it's built for them.<br><br>Are you capable of translating challenging business problems into simple interaction solutions? Do you have the instinct to design for simplicity? Have you spent time understanding the users\\u2019 profiles and tailoring solutions to their workflows? Are you comfortable presenting rationales of your design work and justify your decisions? Are you willing to work together with fellow designers and collect feedback while moving further?<br><br><strong><u>What You\\u2019ll Do<br></u></strong><ul><li>Hands-on creative problem solving in a cloud-driven enterprise software system.</li><li>Collaborate with Experience Design (designers and other researchers), product management, and other cross-functional stakeholders to help establish research strategy, methodology, and process for product team projects.</li><li>This is a very hands-on role and includes helping with participant recruitment, data collection, data synthesis and analysis, and delivery of findings and recommendations.</li><li>Plan and perform UX research remotely and in-person (requires travel to Latin America)</li><li>Execute and deliver user research at various stages of the development lifecycle, including formative and generative research, validation research and/or measurement of final product experiences.</li><li>Work with a multi-cultural, international team of people around the world.</li><li>Keep communication flowing by bringing feedback from customers to the team, and taking team questions back to customers.<br></li></ul><strong><u>Qualifications/Skills<br></u></strong><ul><li>Advanced-level degree in the field of Psychology, HCI, Human Factors, Usability Engineering or related field (ex. MS, MA, PhD).</li><li>Fluency in English and Spanish with outstanding written and verbal communication skills.</li><li>Flexibility to work virtually with geographically distributed teams. </li><li>Foundational know-how for planning and executing different types of research and usability testing activities such as interviews, customer visits, requirements gathering activities, survey research, and formative and summative usability evaluations.</li><li>Knowledge of evaluative research and associated methodologies is a plus. </li><li>Ability to contribute toward producing research materials (such as a facilitator's guide) for a range of methodologies.</li><li>Tenacity to tackle projects in a dynamic setting while staying organized.</li><li>Passion, curiosity, and a desire to ultimately find the best possible solution through data-driven research. <br></li></ul><strong>EQUALITY<br><br></strong>Because we believe that innovation starts with diversity and inclusion, we\\u2019re committed to creating a workplace where all kinds of people work together. All qualified applicants will receive consideration for employment without regard to race, color, national origin, marital status, sexual orientation, gender, gender identity, age, religion, disability, protected veteran status, or any other characteristic prohibited by federal, state, or local law.<br><br>Responsible for creating, evaluating and modifying prototypes to support evolving hardware and software application development.<br><br>As a member of the User Experience team, you will develop and apply software design/usability processes in the investigation of technical problems. May develop user profiles, with emphasis on human error control, display issues, visual interaction, physical manipulation and task and objective analyses. Provide product usability, evaluation and support to product development teams, including the analysis and investigation of applications/systems including tactile methods, visual graphics, web, multimedia, voice response and conversational user interaction. May assist in developing design concept and implementation, providing input on user design considerations. May produce specifications describing user needs and internal structures for product in development.<br><br>Duties and tasks are standard with some variation; displays understanding of roles, processes and procedures. Performs moderately complex problem solving with assistance and guidance in understanding and applying company policies and processes. BS degree or equivalent experience relevant to functional area. Typically one year of software engineering or related experience needed.<br><br><strong><u>About Us<br><br></u></strong>Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It\\u2019s when everyone\\u2019s voice is heard and valued, that we are inspired to go beyond what\\u2019s been done before. That\\u2019s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.<br><br>Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Oracle\", \"sameAs\": \"https://www.linkedin.com/company/oracle\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_200_200/0/1568109893443?e=1639612800&v=beta&t=FrGTr82IIB-9KhMDZKa0eBQuO4U_qbEPZ7SposMz5t0\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Oracle\", \"value\": \"121066\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_100_100/0/1568109893443?e=1639612800&v=beta&t=aUtEzOfbBH01pgx7r8Df4rp5yNI5RK4OEatnNjw98HU\", \"industry\": \"Information Technology and Services,Computer Software,Financial Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Burlington\", \"addressRegion\": \"MA\", \"postalCode\": \"01803\", \"streetAddress\": null}, \"latitude\": 42.504986, \"longitude\": -71.19583}, \"skills\": \"\", \"title\": \"UX Researcher\", \"validThrough\": \"2021-10-12T03:40:35.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 12}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}