{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-24T19:03:36.000Z\", \"description\": \"Due to the current health crisis related to COVID-19 and the escalating visa/travel restrictions in place, we're currently unable to extend offers to anyone who cannot work from India due to lockdown visa/travel restrictions, or other restrictive measures until further notice. Consequently, we will be prioritizing candidates who can start in this location by set date as expected. We're keeping the situation under review and would adjust our position should the restrictive measures be removed later on.<br><br>Minimum qualifications:<br><ul><li>Master's degree in a quantitative discipline or equivalent practical experience.</li><li>2 years of experience in data analysis or related field.</li><li>Experience with statistical software (e.g., R, Python, Julia, MATLAB, pandas) and database languages (e.g., SQL). <br><br></li></ul>Preferred qualifications:<br><ul><li>Ph.D. degree in a quantitative discipline.</li><li>4 years of relevant work experience, including expertise with statistical data analysis such as linear models, multivariate analysis, stochastic models, and/or sampling methods.</li><li>Experience with Machine Learning on large datasets.</li><li>Experience articulating business questions and using mathematical techniques to arrive at an answer using available data. Experience translating analysis results into business recommendations.</li><li>Ability to select the right statistical tools given a data analysis problem. </li><li>Willingness to both teach others and learn new techniques. Excellent leadership and communication skills.<br><br></li></ul><strong><u>About The Job<br><br></u></strong>At Google, data drives all of our decision-making. Quantitative Analysts work all across the organization to help shape Google's business and technical strategies by processing, analyzing and interpreting huge data sets. Using analytical excellence and statistical methods, you mine through data to identify opportunities for Google and our clients to operate more efficiently, from enhancing advertising efficacy to network infrastructure optimization to studying user behavior. As an analyst, you do more than just crunch the numbers. You work with Engineers, Product Managers, Sales Associates and Marketing teams to adjust Google's practices according to your findings. Identifying the problem is only half the job; you also figure out the solution.<br><br>As a Data Scientist, you will evaluate and improve Google's products. You'll collaborate with a multi-disciplinary team of Engineers and Analysts on a wide range of problems, bringing analytical rigor and statistical methods to the challenges of measuring quality, improving consumer products, and understanding the behavior of end-users, advertisers, and publishers.<br><br>Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.<br><br><strong><u>Responsibilities<br><br></u></strong><ul><li>Work with large, complex data sets. Solve difficult, non-routine analysis problems, applying advanced analytical methods. Conduct end-to-end analysis, including data gathering and requirements specification, processing, analysis, ongoing deliverables, and presentations. </li><li>Build and prototype analysis pipelines iteratively to provide insights at scale. Develop comprehensive understanding of Google data structures and metrics, advocating for changes where needed.</li><li>Interact cross-functionally with a variety of people and teams. Work closely with Engineers to identify opportunities, design, and assess improvements to Google products.</li><li>Make business recommendations (e.g. cost-benefit, forecasting, experiment analysis) with effective presentations of findings at multiple levels of stakeholders through visual displays of quantitative information.</li><li>Research and develop analysis, forecasting, and optimization methods to improve the quality of Google's user facing products.<br><br></li></ul>Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Google\", \"sameAs\": \"https://www.linkedin.com/company/google\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQHiNSL4Or29cg/company-logo_200_200/0/1519856215226?e=1637798400&v=beta&t=zkaFhkrSYuTOXYeaC9f03LKFJZbw2mkviRwjGzbVYaM\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Google\", \"value\": \"96397206996558534\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQHiNSL4Or29cg/company-logo_100_100/0/1519856215226?e=1637798400&v=beta&t=xi0I1fm1j-Y5Iu9Iaz-L-Naag4Xc4cCGiQiYW6Dfif8\", \"industry\": \"Information Services,Internet\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"IN\", \"addressLocality\": \"Bengaluru\", \"addressRegion\": null, \"postalCode\": \"560069\", \"streetAddress\": null}, \"latitude\": 12.976747, \"longitude\": 77.57528}, \"skills\": \"\", \"title\": \"Data Scientist, Engineering\", \"validThrough\": \"2021-09-23T19:03:35.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 48}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}