{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-04T20:23:32.000Z\", \"description\": \"<p>This is an environment&nbsp;<strong>unlike anything</strong>&nbsp;<strong>in the high-tech world</strong>&nbsp;and the secret of Costco\\u2019s success is its culture.&nbsp;The value Costco puts on its employees is well documented in articles from a variety of publishers including Bloomberg and Forbes.&nbsp;Our employees and our members come FIRST.&nbsp;Costco is well known for its generosity and community service and has won many awards for its philanthropy. The company joins with its employees to take an active role in volunteering by sponsoring many opportunities to help others.&nbsp;In 2018, Costco contributed over $39 million to organizations such as United Way and Children's Miracle Network Hospitals.</p><p><br></p><p>Costco IT is responsible for the&nbsp;<strong>technical future of Costco Wholesale</strong>, the second largest retailer in the world with wholesale operations in twelve countries. Despite our size and explosive international expansion, we continue to provide a family, employee centric atmosphere in which our employees thrive and succeed. As proof, Costco consistently ranks in the&nbsp;<strong>top five of Forbes \\u201cAmerica\\u2019s Best Employers\\u201d</strong>.</p><p><br></p><p>The&nbsp;<strong>Data Scientist - Data Analytics&nbsp;</strong>is responsible for&nbsp;<strong>generating insights and to augment decision making by the business</strong>. At Costco, we are on a mission to significantly leverage big data to provide better products and services for our members. This role is focused on advanced analytics, machine learning and data science delivery to support multiple business areas. This role will partner with Product Owner and business owners to build, test advanced analytics solutions and turn data into actionable insights. This is a senior role to enhance the maturity of advanced analytics methods and coach the team across multiple PODs. The Data Scientist is a knowledgeable leader with an ability to lead and is passionate about data and using machine learning to solve business problems. The right candidate will have&nbsp;<strong>deep knowledge of applying data science for forecasting, customer analysis, item and inventory management</strong>&nbsp;and other areas of retail.</p><p>We are looking for a&nbsp;<strong>highly motivated, customer focused professional</strong>&nbsp;who wants to work in a fun and highly collaborative environment and willing to be the player as well as coach for the data science community at Costco.</p><p><br></p><p>If you want to be a part of one of the<strong>&nbsp;<u>BEST \\u201cto work for\\u201d companies</u>&nbsp;in the world</strong>, simply apply and let your career be reimagined.</p><p><br></p><p><strong><u>ROLE</u></strong></p><ul><li>Leads the analysis by applying statistics, machine learning and analytic approaches to predict and optimize business outcomes.</li><li>Designs and builds ML/DL models to solve business problems.</li><li>Correctly frames a problem and comes up with a hypothesis.</li><li>Assesses the effectiveness and accuracy of models on an ongoing basis.</li><li>Identifies new data that could enhance the quality and accuracy of models to improve predictions.</li><li>Communicates results effectively with storytelling and visualization.</li><li>Coaches the team in feature engineering using machine learning techniques.</li><li>Performs peer review for another Data Scientist\\u2019s work.</li><li>Provides feedback to enhance the testing framework and MLOps.</li><li>Extends beyond core data science work to perform data wrangling and data preparation as needed.</li></ul><p><br></p><p><strong><u>REQUIRED</u></strong></p><ul><li>5+ years\\u2019 experience in delivering business insights using advanced statistical and machine learning models and visualization.</li><li>Proficiency in working with diverse databases and other data sources.</li><li>Strong proficiency in Machine Learning, Statistical and Reporting tools (Python, R, SQL, PowerBI).</li><li>Knowledge of Deep Learning and Neural Networks, and its applications.</li><li>Strong experience working in Cloud (AWS, Azure) based analytics platform.</li><li>Graduate degree in Computer Science, Data Science, and Statistics/Mathematics or related field.</li></ul><p><br></p><p><strong><em>Recommended</em></strong></p><ul><li>Knowledge of Agile software development.</li><li>Experience in software development.</li><li>Exposure to the retail industry.</li><li>Experience leading team of data scientists.</li><li>Excellent verbal and written communication skills.</li></ul><p><br></p><p><strong><u>Required Documents</u></strong></p><ul><li>Cover Letter</li><li>Resume</li></ul><p><br></p><p>California applicants, please click&nbsp;here&nbsp;to review the Costco Applicant Privacy Notice.</p><p><br></p><p>Apart from any religious or disability considerations, open availability is needed to meet the needs of the business.&nbsp;If hired, you will be required to provide proof of authorization to work in the United States. Applicants and employees for this position will not be sponsored for work authorization, including, but not limited to H1-B visas.</p><p></p>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Costco IT\", \"sameAs\": \"https://www.linkedin.com/company/costco-weareit\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQGvuFJWJhBoaw/company-logo_200_200/0/1619221415170?e=1635984000&v=beta&t=pZQV00A0yun1fEWlUpuhWZ_38ke8nZfPxGvXVMUYHI8\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Costco IT\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQGvuFJWJhBoaw/company-logo_100_100/0/1619221415170?e=1635984000&v=beta&t=1w559ljrvmA7fRopTweYmkF7zXyQWmSW8GdqXPilz-k\", \"industry\": \"Retail\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Issaquah\", \"addressRegion\": \"WA\", \"postalCode\": \"98029\", \"streetAddress\": null}, \"latitude\": 47.53007, \"longitude\": -122.032906}, \"skills\": \"\", \"title\": \"Data Scientist - Data Analytics\", \"validThrough\": \"2021-09-03T20:23:32.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 60}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}