{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-11T23:39:33.000Z\", \"description\": \"<em>To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.<br><br></em><strong> Job Category </strong>Products and Technology<strong> Job Details <br><br></strong>Tableau introduced the power of visual analytics to the world making it the de-facto standard in the enterprise. Tableau is as much a philosophy as an amazing suite of tools. <em><strong>We enable people see and understand their data</strong></em>, helping people make important decisions based on those insights. If you are passionate about technology, but also care deeply about doing something meaningful, Tableau is the place for you. Tableau products have been helping fight global pandemics, most recently COVID-19, by providing data insights to the professionals, and the public.<br><br><strong><u>What We Do...<br><br></u></strong>Besides helping people transform data to easy visuals, we also have really fun architectural and scaling challenges. <strong>Container Services team</strong> in the C<strong>loud Engineering group </strong>drives platform innovation for <strong>Tableau SaaS </strong>products. We explore new platforms, technologies, tools and bring the best to run Tableau SaaS. We lead the Tableau SaaS transformation to Containers with <strong>Docker, Kubernetes, and AWS EKS</strong>. Along the way, we adopted cool tools for <strong>Infrastructure-as-Code (IaC),</strong> and <strong>Continuous Delivery (CD)</strong>.<br><br><strong>Team you will work in...<br><br>The Container Services team</strong> is a talented and passionate group of engineers. They are building a SaaS platform with AWS EKS infrastructure, and a Deployment platform for release orchestration. The team is in-charge of migrating Tableau Online from AWS EC2 to EKS. As trailblazers of Kubernetes in Tableau, team members regularly guide other internal teams adopting Containers and Kubernetes. As a core member of the Container Services team, you will bring your creativity, and expertise to the team for best practice guidance. You will craft the Infrastructure, Deployment, and Migration strategies and oversee their implementation.<br><br><strong>Things you will do include...<br></strong><ul><li>Design, build and optimize automated CI/CD pipelines and configuration management for Continuous Delivery of software to cloud environments</li><li>Create and configure infrastructure using Infrastructure as Code principles with a goal to re-provision environments at any point in time</li><li>Automate Infrastructure and Application Deployments on private and public clouds (preferred: AWS)</li><li>Deploy, troubleshoot Docker containers in Kubernetes (preferred: AWS EKS)</li><li>Drive operational cost reductions through Service Optimizations and Autoscaling</li><li>Develop and maintain provisioning, security, configuration, and deployment procedures</li><li>Evaluate existing processes &amp; tools and implement changes for better efficiency</li><li>Orient feature teams in CI/CD platform/tool training and troubleshooting</li><li>Participate in on-call rotations as needed</li><li>Design and implement Security and Compliance solutions to meet regulatory requirements (such as GDPR, FedRAMP)</li><li>Use these languages/tools/platforms daily: Python, TypeScript, Terraform, Kubernetes/EKS, AWS, Linux, CI/CD. It\\u2019s nice if you can employ your prior C++ or Java skills for object-oriented programming on this job. We are always evolving and learning/developing new tools. <br></li></ul><strong><u>Who You Are...<br></u></strong><ul><li>Experienced. You have industry (non-intern) experience coding commercial software and a passion for solving complex problems. You have a great understanding of cloud infrastructure technologies, CI/CD tools. You have solid development skills for Infrastructure-as-Code, Deployment-as-Service. You built these skills on top of your experience with object-oriented languages (Java/C#/C++). You contributed to cross-team projects using Agile methodologies. You have at least a year of hands-on AWS experience. It\\u2019s a definite plus if you built scalable services using open source or contributed to open-source projects.</li><li>A True Team Player. You enjoy collaborating, learning from or teaching others so we can all become better developers. </li><li>Customer Advocate. You understand customer requirements and prioritize for maximum customer / user experience.</li><li>Passionate. You are passionate about technology and the work you do. You always want to do your best to delight the customers, help your team and strive to excellence.</li><li>You are a Recruiter! Salesforce/Tableau hires company builders and, in this role, you are on the lookout for the best talent to bring onboard to help us continue building one of the best companies in the world.<br></li></ul><strong><u>What You Have<br></u></strong><ul><li>BS in Computer Science or a related field or equivalent experience</li><li>6+ years of industry experience in SaaS or large-scale systems</li><li>4+ years acting as technical mentor in teams of 6+ engineers developing/implementing platforms.</li></ul><strong> Accommodations <br><br></strong>If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.<br><br><strong> Posting Statement <br><br></strong>At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.<br><br><u>Salesforce.com</u> and <u>Salesforce.org</u> are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. <u>Salesforce.com</u> and <u>Salesforce.org</u> do not accept unsolicited headhunter and agency resumes. <u>Salesforce.com</u> and <u>Salesforce.org</u> will not pay any third-party agency or company that does not have a signed agreement with <u>Salesforce.com</u> or <u>Salesforce.org</u> .<br><br>Salesforce welcomes all.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Salesforce\", \"sameAs\": \"https://www.linkedin.com/company/salesforce\", \"logo\": \"https://media-exp3.licdn.com/dms/image/C560BAQHZ9xYomLW7zg/company-logo_200_200/0/1591198956689?e=1634169600&v=beta&t=3ixJazFO9ksCAZogt4xjsNiNiKEU_uwU3wuoP91ZRg0\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Salesforce\", \"value\": \"JR104123-1\"}, \"image\": \"https://media-exp3.licdn.com/dms/image/C560BAQHZ9xYomLW7zg/company-logo_100_100/0/1591198956689?e=1634169600&v=beta&t=CT7xGy1JOC5QlpSpkM_B7N66wAcoe29j2ldJgzflh_E\", \"industry\": \"Computer Software,Information Technology and Services,Internet\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Kirkland\", \"addressRegion\": \"WA\", \"postalCode\": \"98034\", \"streetAddress\": null}, \"latitude\": 47.675507, \"longitude\": -122.20336}, \"skills\": \"\", \"title\": \"Lead Software Engineer, Container Services - Tableau\", \"validThrough\": \"2021-08-10T23:39:33.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 72}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}