{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services",
        "description": "<p>• Knowledge of at least one of the programming languages like SQL, Python, R, and Scala</p><p>• Familiarity with business intelligence tools (e.g., Tableau)</p><p>• Strong mathematics skills (e.g., statistics, algebra)</p><p>• Experience with big data technologies such as Hadoop and Spark</p><p>• Advanced ability to perform exploratory data analysis</p><p><br></p><p>&nbsp;</p><p><strong>Responsibilities</strong></p><p>• Collecting Service data through means such as analyzing current sources or by setting up and managing new studies</p><p>• Transferring data into a new format to make it more appropriate for analysis</p><p>• Creating new, experimental frameworks to collect Service data</p><p>• Building tools to automate data collection</p><p>• Searching through large data sets for usable information</p><p>• Creating reports and presentations for business uses</p><p>• Correlating similar data, identify patterns and trends in data sets to find actionable results.</p><p>• Understanding the business problems and analyzing the data by using appropriate Statistical models to generate insights</p><p>• Application of various machine learning algorithms and statistical Modeling like decision trees, text analytics, natural language processing (NLP), supervised and unsupervised, regression models, deep learning and clustering.</p><p>• Use Machine learning along with real-time usage and performance data to optimize product performance, quality and reliability</p><p>Create digital twins using 3D software and run simulations to measure product reliability in varying conditions to enable enhanced service design and predictive maintenance.</p><p></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-19T20:39:12.000Z"
    },
    "company": {
        "name": "L&amp;T Technology Services Limited",
        "link": "https://in.linkedin.com/company/l&amp;t-technology-services-limited"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Marlborough",
        "region": "MA",
        "postal_code": "01752",
        "street_address": null,
        "latitude": 42.346947,
        "longitude": -71.54718
    }
}