{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-09-02T06:08:32.000Z\", \"description\": \"Purpose of Job<br><br>We are currently seeking talented Java Software Engineers \\u2013 Sr. Level for our Phoenix, AZ facility, for teams inside our Chief Administrative Office group.<br><br>USAA Java Software Engineers - Web Services create and maintain APIs for our business software applications that our members use. Done well, many may never realize or appreciate how critical these APIs are or how we've made them simpler. Faster. Safer. Yet they help make our members' lives better. It's a great challenge and responsibility.<br><br>Here, you will invent. You'll design and test. You'll take risks. You'll create new technology, but the impact you'll make on our members will be far more significant.<br><br>Job Requirements<br><br>As a Java Engineer - Web Services, you are expected to be able to function in a fast-paced environment driving innovation through rapid prototyping and iterative development ensuring quality is built into all solutions leveraging TDD. Your responsibilities will require you to be an expert in API development. You will lead teams of developers guiding on engineering and architecture best practices as well as demonstrate the ability to influence and engage with other engineers and architects. You will work closely with business clients and UI designers to analyze user requirements, design and code applications and customize and/or integrate commercial software packages for both internal employees and external member-facing applications across multiple platforms.<br><br>As a Java Engineer - Web Services, it will be your responsibility to maintain code integrity and quality as well as ensure application architecture is designed for performance and resiliency.<br><br><strong><u>About USAA<br><br></u></strong>USAA knows what it means to serve. We facilitate the financial security of millions of U.S. military members and their families. This singular mission requires a dedication to innovative thinking at every level.<br><br>USAA Careers \\u2013 World Class Benefits (31 seconds)<br><br><strong><u>Primary Responsibilities<br></u></strong><ul><li>Utilizing technical expertise; Creates system requirements, performs design and analysis, and coding and unit testing of complex to highly complex system functionality and/or defect correction across multiple platforms. Identifies ideas to improve system performance and impact availability. Resolves complex technical design issues.</li><li>Provides functional and/or technical guidance in evaluating applications systems or evaluating requests for proposals. Coordinates changes and influences and prioritizes tasks with business or technical departments.</li><li>Analyzes and influences technical, system, and/or user requirements. Identifies and creates solutions to improve system performance and availability. Facilitates root cause analysis of system issues to minimize impact and future occurrences.</li><li>Creates system documentation/play book(s) and serves as a lead technical reviewer and contributor in requirements, design and code reviews. Typically serves as a resource to the business.</li><li>Develops accurate estimates on work packages and ensures the accuracy of estimates developed by less experienced internal and third party team members. Analyzes and designs specifications for less experienced internal and third party team members to execute. Acts as a technical resource throughout the development life cycle. May also actively contribute to the technical and soft skills development of team members.</li><li>Assists team leads and management with delegation of technical work packages to cross-functional and third party team members for execution through the full development life cycle. Keeps management appropriately informed of progress and issues.</li><li>Coordinates system application transition from development teams to maintenance and production teams, and/or constructs and implements necessary controls to assure system/application traceability.<br></li></ul>When you apply for this position, you will be required to answer some initial questions. This will take approximately 5 minutes. Once you begin the questions you will not be able to finish them at a later time and you will not be able to change your responses.<br><br><strong><u>Minimum Requirements<br></u></strong><ul><li>Bachelor's degree in related field of study or 4 additional years of I/T experience beyond the minimum required in lieu of a degree. </li><li>AND, 6+ years of software engineering/development experience utilizing Java with 2+ years experience working with RESTful Web Services</li><li>Demonstrated ability to independently research technical issues and generate creative/innovative solutions.<br></li></ul><strong><u>Preferred Experience<br></u></strong><ul><li>4+ years in REST frameworks with focus on API development</li><li>2+ years in AGILE methodology (Scrum, Lean, SAFe, etc.)</li><li>2+ years experience with JavaScript</li><li>2+ years experience integrating with backend services like JMS, J2C, ORM frameworks (Hibernate, JPA, JDO, etc), JDBC.</li><li>Experience with event driven frameworks such as Kafka, RabbitMQ, or IBM MQ</li><li>Experience building APIs with Spring Boot</li><li>Ability to design and implement container based APIs using container frameworks like OpenShift, Docker, or Kubernetes.</li><li>Relational Database design and optimization with Oracle DB2, MySQL, or PostgreSQL</li><li>Understanding of microservices architecture design and implementation</li><li>Working experience with Gradle, GIT, GitHUB, GITLab, etc. around continuous integration and continuous delivery infrastructure</li><li>Cloud infrastructure application development with vendors like AWS, Google or Microsoft.</li><li>Experience testing in REST services</li><li>Experience in design and develop automated tests and frameworks<br></li></ul>The above description reflects the details considered necessary to describe the principal functions of the job and should not be construed as a detailed description of all the work requirements that may be performed in the job.<br><br><strong>Compensation: </strong>USAA has an effective process for assessing market data and establishing ranges to ensure we remain competitive. You are paid within the salary range based on your experience and market position. The salary range for this position is: $106,800 - $192,300*( this does not include geographic differential it may be applied based on your work location)<br><br>Employees may be eligible for pay incentives based on overall corporate and individual performance or at the discretion of the USAA Board of Directors.<br><ul><li>Geographical Differential: Geographic pay differential is additional pay provided to eligible employees working in locations where market pay levels are above the national average.<br></li></ul><strong>Shift premium:</strong> will be addressed on an individual-basis for applicable roles that are consistently scheduled for non-core hours.<br><br><strong>Benefits: </strong>At USAA our employees enjoy best-in-class benefits to support their physical, financial, and emotional wellness. These benefits include comprehensive medical, dental and vision plans, 401(k), pension, life insurance, parental benefits, adoption assistance, paid time off program with paid holidays plus 16 paid volunteer hours, and various wellness programs. Additionally, our career path planning and continuing education assists employees with their professional goals.<br><br>Please click on the link below for more details.<br><br><strong>USAA Total Rewards<br><br></strong><strong>Relocation</strong> assistance is <strong>available</strong> for this position.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"USAA\", \"sameAs\": \"https://www.linkedin.com/company/usaa\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQFI2UB_4CpQnA/company-logo_200_200/0/1585925691495?e=1638403200&v=beta&t=Mx0HY4WY3BywOCLxd5gnuIrFDcMhUX434hEywnExsNM\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"USAA\", \"value\": \"R0066974\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQFI2UB_4CpQnA/company-logo_100_100/0/1585925691495?e=1638403200&v=beta&t=NL3Jn1QHZMddZ2lKTEsz1bMtKrQwJEZftWHO0lNr1DA\", \"industry\": \"Financial Services,Information Technology and Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Phoenix\", \"addressRegion\": \"AZ\", \"postalCode\": \"85009\", \"streetAddress\": null}, \"latitude\": 33.448204, \"longitude\": -112.072586}, \"skills\": \"\", \"title\": \"Java Software Engineer-Web Services-Senior Level\", \"validThrough\": \"2021-10-02T06:08:31.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 72}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}