{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-20T23:03:45.000Z\", \"description\": \"Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals, and branded generic medicines. Our 109,000 colleagues serve people in more than 160 countries.<br><br>The Senior Software Quality Engineer assures new or modified products conform to requirements and establish compliance with the quality system. They are responsible for maintaining a strong collaborative partnership with cross-functional team members that facilitates organizational success by protecting patient / user safety and meeting business needs. The Senior Software Quality Engineer position focuses primarily on software quality, but also supports other aspects of product development based on experience.<br><br><strong><u>The Senior Software Quality Engineer Position<br></u></strong><ul><li>Provides technical and quality system guidance related to establishing software requirements.</li><li>Supports software verification and validation activities for new products in accordance with design planning procedures. This includes, but is not limited to, review and approval of software test case protocols and reports, review of software development plans, and review of other system and software documentation.</li><li>Leads meetings to prioritize, review and/or approve of action plans for addressing issues captured in problem resolution systems during development.</li><li>Performs risk evaluation and associated management activities related to software development including FMEA, product risk analysis, and mitigation of software issues.</li><li>Participates in technical and management reviews to ensure design plans, product design and deliverables related to product software are met. Represents the quality engineering function for the review and approval of designated design outputs.</li><li>Supports non-product software validation by assessing the need for validation and preparing and/or supporting protocols, reports and other documentation as required.</li><li>May be involved with supporting product cybersecurity assessments in conjunction with a cross-functional team.</li><li>Drive best practices for establishing requirements and completing design verification and validation especially as it relates to user needs.</li><li>Complies with U.S. Food and Drug Administration (FDA) regulations, other regulatory requirements, company policies, operating procedures, processes, and task assignments.</li><li>Maintains a strong, collaborative partnership with cross functional team members especially with R&amp;D.</li><li>Works as an individual contributor and may provide guidance or oversee work of other QE team members.</li><li>Performs other related duties and responsibilities, on occasion, as assigned.<br></li></ul><strong><u>Required<br><br></u></strong>Qualifications:<br><ul><li>Bachelor\\u2019s degree in Engineering or Technical Field.</li><li>Minimum of 7 years of quality engineering experience with new product development and demonstrated use of quality tools / methodologies.</li><li>Knowledge of regulations, standards, and guidance affecting medical software and non-medical device software development.</li><li>Project management and leadership skills, including the demonstrated ability to lead multi-departmental project teams and resolve quality-related issues in a timely and effective manner.</li><li>Advanced computer skills, including statistical/data analysis and report writing skills.</li><li>Ability to work in a highly matrixed and geographically diverse business environment.</li><li>Ability to work within a team and as an individual contributor in a fast-paced, changing environment.</li><li>Ability to leverage and/or engage others to accomplish projects.</li><li>Strong verbal and written communication with ability to effectively communicate at multiple levels in the organization.</li><li>Multitasks, prioritizes and meets deadlines in timely, proactive manner.</li><li>Strong organizational and follow-up skills, as well as attention to detail.</li><li>Ability to travel approximately 10%, including internationally.</li><li>Ability to maintain regular and predictable attendance.<br></li></ul><strong><u>Preferred<br></u></strong><ul><li>Advanced degree</li><li>ASQ CSQE certification desired.</li><li>Prior medical device experience preferred.</li><li>Experience in Medical Device Software and Integrating Systems or in a related industry with relevant Software / System Integration experience.</li><li>Experience working in a broader enterprise / cross-division business unit model.</li></ul>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Abbott\", \"sameAs\": \"https://www.linkedin.com/company/abbott-\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQHOkTAbXwQjcg/company-logo_200_200/0/1625141088050?e=1637798400&v=beta&t=5lmCpjL73OGKHbpOnBCGhIxvI1ehyUt62lKGnw0cn44\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Abbott\", \"value\": \"f6865ed1841126a1ae35b8c94879c922\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQHOkTAbXwQjcg/company-logo_100_100/0/1625141088050?e=1637798400&v=beta&t=hURBc_6UEZ26W18nUY-RuTTcZV_0MQQIWZcwqOA5uKg\", \"industry\": \"Hospital & Health Care\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Atlanta\", \"addressRegion\": \"GA\", \"postalCode\": \"30355\", \"streetAddress\": null}, \"latitude\": 33.748547, \"longitude\": -84.3915}, \"skills\": \"\", \"title\": \"Senior Software Quality Engineer\", \"validThrough\": \"2021-09-19T23:03:44.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 84}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}