{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-24T07:07:22.000Z\", \"description\": \"<strong><u>About Involve.ai -<br><br></u></strong>We are a successful startup backed by VCs like Bonfire, Greycroft, BDMI, etc. We just raised our Series A led by Sapphire Ventures. Our VCs and angels are early investors in companies like Pendo, DocuSign, Square, Airbnb, Uber, Snowflake, Spotify, Salesforce, etc. Join our core team of sales professionals, demand degeneration specialists, content creators, product leaders, and AI engineers to create, launch, and market a new platform, www.involve.ai. The new technology has mentions on Forbes, Fortune, CIO review, and our founders Gaurav and Saumya were recently announced by Forbes 30 under 30. It is an opportunity to join a small core team at the ground level and create a go-to-market strategy. And a chance to build a generational company.<br><br>Join the vision of making the world customer-obsessed!<br><br>involve.ai is looking for a growth-minded and collaborative individual to join our tech team. We have a culture of constant learning, with people who are always willing to coach you along your desired career path. We are a fast-growing SaaS company with the mission to organize all customer data for businesses in a unified dashboard to predict customer churn and upsells. As a team, we are growth-minded, collaborative, accountable, and always looking for a challenge to solve. We'd love to meet you!<br><br>*100% Remote in the US*<br><br>In this role you will:<br><ul><li>Work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.</li><li>Collaborate with product management and engineering to build our SaaS enterprise Data Models</li><li>Develop custom data models and algorithms to apply to data sets.</li><li>Coordinate with different functional teams to test models and monitor outcomes.</li><li>Develop our core ML which predicts customer churn</li><li>Collaborate with product management and engineering to build our SaaS enterprise ML platform</li><li>Research new ML/DL ideas to add value to the product</li><li>Running training and implementation programs for clients</li><li>Mine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies.</li><li>Assess the effectiveness and accuracy of new data sources and data gathering techniques.<br></li></ul>We are looking for:<br><ul><li>2-3 years of experience in ML/ Software Development or equivalent practical experience.</li><li>Experience querying databases and using statistical computer languages: Python, SLQ, Spark etc.</li><li>Individuals with a BS, MS, in an engineering or quantitative discipline; advanced degrees preferred</li><li>Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets.</li><li>Experience visualizing/presenting data for stakeholders using: Periscope, Business Objects, D3, ggplot, etc.</li><li>Coordinate with different functional teams to implement models and monitor outcomes.</li><li>Knowledge of statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.</li><li>Strong problem solving skills with an emphasis on product development.</li><li>Data-driven, business impact-focused, and fast learner</li><li>Experience working with and creating data architectures and data pipelines.<br></li></ul>You will stand out from the rest if you have:<br><ul><li>Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.</li><li>Experience with SQL and modern relational / NoSQL databases</li><li>Experience with Rest API\\u2019s<br></li></ul>Perks and benefits:<br><ul><li>People - involve.ai has an excellent cohort of like-minded professionals</li><li>Flexible schedules to make WFH more enjoyable</li><li>Robust healthcare plans-100% medical coverage for employees</li><li>Half-day Fridays</li><li>10 days of PTO, 4 floating holidays, and up to 10 company holidays annually</li><li>Weekly company-wide \\u201call hands\\u201d meetings</li><li>An OKR driven team so everyone is on the same page</li><li>Sponsor H1-B Visas<br><br></li></ul><strong><u>About Involve.ai<br><br></u></strong>involve.ai is an AI early warning system to supercharge customer teams with actionable insights and automation, so they can reduce churn, increase upsells, and improve customer experience. involve.ai is built with love in Santa Monica, California, and with team members in San Diego, San Francisco, Austin, New Delhi, Manilla, Buenos Aires, Ontario, and St. Petersburg, Russia just to name a few. To learn more about involve.ai, please visit https://www.involve.ai.<br><br>Our Core Values<br><br>Be Product Obsessed. We love making our product the best in the world. Every feature, every screen, every word is thought through. It's like magic, smooth, easy, fantastic. It's like Apple products, and the quality is like Japanese products. Its vision is like Tesla's products.<br><br>Grow every day. We make big bets, and we believe in the power of feedback and encourage a mindset of continuous learning and growth.<br><br>Have Internal-Drive. We're a company of builders who care deeply about real-world applications. And are internally driven to do good work. We understand that we can get to about the 90th percentile in our field by working either smart or hard, which is still a great accomplishment. But getting to the 99th percentile requires both.<br><br>Collaborate. We know that many of our biggest advances grow out of work done across multiple teams. We communicate and love working in teams.<br><br>Be Accountable. We own challenges, problems, solutions, and outcomes. We don't blame our team, circumstances, or luck. We take ownership, find issues, and execute quickly to improve.<br><br>Individuals seeking employment at involve.ai are considered without regard to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.<br><br>PLEASE NOTE - Direct applicants ONLY. Any recruiter/3rd party submissions we receive will be considered a gift.<br><br>Powered by JazzHR<br><br>mxzHiLZLvG\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"involve.ai\", \"sameAs\": \"https://www.linkedin.com/company/involveai\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQEh1-etMMOivg/company-logo_200_200/0/1627075326569?e=1637798400&v=beta&t=8EGiM2Mry6EqptuXwoZR3wnDSMj7c_0Y4iOzE0KPIv8\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"involve.ai\", \"value\": \"3120191\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQEh1-etMMOivg/company-logo_100_100/0/1627075326569?e=1637798400&v=beta&t=qJTrf67dwC7TDmSNVeLBAZd89uaEK4q17rute-Eoex0\", \"industry\": \"Information Technology and Services,Computer Software,Internet\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Santa Monica\", \"addressRegion\": \"CA\", \"postalCode\": \"90403\", \"streetAddress\": null}, \"latitude\": 34.010933, \"longitude\": -118.491516}, \"skills\": \"\", \"title\": \"Data Scientist\", \"validThrough\": \"2021-09-23T07:07:22.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 24}, \"jobLocationType\": \"TELECOMMUTE\", \"applicantLocationRequirements\": {\"@type\": \"Country\", \"name\": \"United States\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}