{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-15T10:59:17.000Z\", \"description\": \"<p>As part of NC Medicaid Transformation, the Federal Centers for Medicare &amp; Medicaid Services approved a groundbreaking pilot program called Healthy Opportunities. Cape Fear Collective\\u2019s (CFC) partner, Community Care of the Lower Cape Fear was selected by the North Carolina Department of Health and Human Services as one of three region leads to pilot services related to housing, food, transportation, and interpersonal safety to directly impact the health outcomes and healthcare costs of Medicaid beneficiaries. CFC\\u2019s role in this initiative is to support regional collaboration across each of the sectors and work closely with CCLCF\\u2019s county leads and nonprofit partners to ensure proper implementation, coordination, collaboration, and shared learning across the network.&nbsp;</p><p>&nbsp;</p><p>This is a rare opportunity to impact the health of thousands of people through an innovative pilot program that has the potential to transform healthcare reimbursement and how we address the social determinants of health and health equity.&nbsp;</p><p><br></p><p>In addition to this position, CFC is currently hiring four (4) program manager positions, one for each of the service sectors: housing, food, transportation, and interpersonal safety. All five positions are currently grant funded for two years. CCLFC and CFC intend to apply for an additional two years of support, if available. Applicant must live in, or be willing to travel frequently to, New Hanover, Brunswick, Pender, Onslow, Bladen, and Columbus counties.&nbsp;</p><p><br></p><p><strong>Specific responsibilities include:</strong></p><p><br></p><p><strong><em>Data Platform.</em></strong></p><ul><li>Clean and transform data from multiple and varied data sources.</li><li>Implement data ingestion processes for scalable, repeatable, consistent, and efficient work flow.</li><li>Advise on tools and technology to maximize security, usability, and performance.</li><li>Collaborate with community partners as necessary for insights and context.</li></ul><p><br></p><p><strong><em>Data Socialization.</em></strong></p><ul><li>Produce annual baseline and results reports as directed.</li><li>Deliver data content that can be used for group seminars, forums, and public communications and presentations.</li><li>Partner with the journalism team on data usage for external communications.</li><li>Document and present analytical output in a way easily consumed by an audience with varying technical literacy and comfort.</li></ul><p><br></p><p><strong><em>Data Modeling.</em></strong></p><ul><li>Implement predictive, prescriptive, and descriptive models using a variety of supervised and unsupervised techniques, as appropriate for the business use case.</li><li>Mine and analyze data from data platform and other sources to drive continued insight.</li><li>Assess the effectiveness and accuracy of models, processes, and data sources.</li></ul><p><br></p><p><strong><em>Other Responsibilities as Assigned by the Director of Data Science.</em></strong></p><p><br></p><p><strong>Qualifications and skills:</strong></p><p><br></p><ul><li>Masters in Data Science, Computer Science, Mathematics, Economics, Statistics, or other relevant field and/or 3+ years experience working in the data science domain.</li><li>Intermediate to advanced proficiency using R to perform data analysis and apply statistical techniques.</li><li>Experience applying predictive, prescriptive, and descriptive methods on large and varied data sources. Working knowledge of how to apply these techniques, as well as their advantages/drawbacks.</li><li>Familiarity with key data engineering concepts.</li><li>Intermediate to advanced proficiency using SQL to query a database.</li><li>Experience with data visualization (ggplot, R Shiny, Tableau, arcGIS is a plus).</li><li>Demonstrated ability to work on multi-functional project teams.</li><li>Strong interpersonal, written, and verbal communication skills.</li><li>Ability to understand customer needs and provide valuable recommendations.</li><li>Ability to work under stressful conditions and manage time to achieve goals.</li><li>Decision-making and problem-solving skills, driving toward outcomes with sometimes ambiguous direction.</li><li>Passion to learn from your peers, manager, and other stakeholders in the data science domain and greater community.</li><li>Attention to detail.</li><li>Ability to troubleshoot common data/statistics issues.</li><li>Experience working in the social impact sector [Preferred, but not necessary]</li></ul><p><br></p><p><strong>Physical Demands</strong></p><p><br></p><ul><li>Vision, hearing, speech, movements requiring the use of wrists, hands and/or fingers</li><li>Able to sit, stand, stoop and bend</li><li>The ability to work the days and hours required to fulfill the essential functions of the position</li></ul><p><br></p><p><strong>The Cape Fear Collective is an Equal Opportunity Employer</strong> and provides equal employment opportunities to all applicants without regard to race, color, religion, gender, sexual orientation, gender orientation or expression.&nbsp;&nbsp;</p><p>&nbsp;</p><p><strong>Benefits</strong></p><p><br></p><ul><li>Health Insurance</li><li>Dental Insurance</li><li>Vision Insurance</li><li>Life Insurance</li><li>401k</li><li>Education and Professional Development Stipend</li><li>Paid Time Off</li><li>Flexible Schedule</li></ul>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Cape Fear Collective\", \"sameAs\": \"https://www.linkedin.com/company/cape-fear-collective\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQEDjeK6nTIFXg/company-logo_200_200/0/1571348939215?e=1634169600&v=beta&t=Xn88bb7CHrHO2luDC09FRSHvOIYLG8hGbP8d-8eweXg\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Cape Fear Collective\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQEDjeK6nTIFXg/company-logo_100_100/0/1571348939215?e=1634169600&v=beta&t=J_1QA3KbNPASxASEn313zRxTABtxdpfM02stqcCcahA\", \"industry\": \"\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Raleigh-Durham-Chapel Hill Area\", \"addressRegion\": null, \"postalCode\": \"27603\", \"streetAddress\": null}, \"latitude\": 35.817448, \"longitude\": -78.27004}, \"skills\": \"\", \"title\": \"Data Scientist\", \"validThrough\": \"2022-01-11T10:57:32.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 36}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}