{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-20T04:22:09.000Z\", \"description\": \"<p><strong>REMOTE POSITION</strong></p><p><br></p><p>Kayhan Space is seeking ambitious, solution-driven Software Engineers to join our fast-growing team. We are looking for individuals with strong knowledge of developing SaaS applications to help push our product through the next growth stage.</p><p><br></p><p><strong>About Kayhan Space</strong></p><p>Kayhan Space is a mission-driven, venture-backed startup, building autonomous solutions for the space industry. Our Colorado-based company is committed to building an environment where innovation is rewarded, diversity is magnified, and ambition is not throttled.</p><p></p><p>At Kayhan, we have the goal of leaving a great legacy behind. Whatever you do, big or small, we want you to own it. Because that\\u2019s the legacy you\\u2019ll leave for others.&nbsp;</p><p></p><p>We are skiers, parents, musicians, campers, geeks, scientists, and pet lovers. While we may come from different backgrounds and have different opinions and interests, we are united around a common set of core values.</p><p><br></p><p>Our mission drives everything we do!</p><p><br></p><p><strong><em>We\\u2019re looking for ambitious team members who share our values and are ready to think bigger!&nbsp;</em></strong></p><p><br></p><p><strong>Our Core Values</strong></p><ul><li><strong>Integrity: </strong>Integrity is paramount to our success as a company. Telling the truth and providing accurate data is crucial for space operations \\u2014 otherwise, it can cost lives. Maintaining a high level of transparency allows the Kayhan team to provide an open workplace culture that supports professional growth and development across the organization.</li></ul><p><br></p><ul><li><strong>Hard Work: </strong>We value hustlers who hold themselves accountable and who are able to think on their feet, as evidenced by our founders\\u2019 tireless work ethic! Kayhan employees seek to establish and surpass goals that will allow us to reach new heights.</li></ul><p><br></p><ul><li><strong>Diversity: </strong>At Kayhan Space, we want our employees to be empowered to shoot for the moon! Our company is committed to building a diverse, inclusive, and equitable team where members experience a sense of belonging. We believe these non-negotiables enhance the quality of our relationships with clients, partners, and vendors of all identities and backgrounds to make us a better, more effective organization.</li></ul><p><br></p><p><strong>About You: Responsibilities</strong></p><ul><li>Design, build and maintain APIs, services, and systems across our engineering stack.</li><li>Shaping the technical foundation for future new products, sustained growth, and high availability standards.</li><li>Deliver architecture and data environment that supports a test and learn approach to business problems.</li><li>Regularly provide meaningful design feedback and code review to peers.</li><li>Help improve engineering standards, tooling, and processes.</li><li>Contribute to the overall culture of engineering excellence and best practices.</li><li>Adapt the latest and greatest cybersecurity protocols to safeguard the company\\u2019s proprietary technology and customer data.&nbsp;</li><li>Communicate with industry expert team members to translate complex physical and mathematical formulations into high-quality software.</li></ul><p><br></p><p><strong>About You: Qualifications</strong></p><ul><li>Able to drive small/medium complexity projects on your own</li><li>Experienced engineer with proven impactful software engineering&nbsp;</li><li>You are excited about working on unfamiliar things and with new technologies.</li><li>You want to work in an environment where learning, self-improvement, and personal and professional development are not only encouraged but an important and necessary part of the job.</li><li>You're relentlessly curious and think about tactical execution now and building for scale in the future.</li><li>You enjoy working closely with other engineers, whether it's bouncing ideas around or mentoring new hires. You thrive in a highly collaborative environment and embrace the diversity of thought and experience when thinking through solutions.</li></ul><p><br></p><p><strong>About You: What You Need</strong></p><ul><li>At least three years of professional software development experience after graduation</li><li>Enjoy and have experience building scalable backend infrastructure</li><li>Experience building high-quality, developer-centric API products</li><li>Experience working with various databases and caching systems</li><li>Hold yourself and others to a high bar when working with production systems</li><li>Take pride in working on projects to successful completion involving a wide variety of technologies and systems</li><li>Experience with writing automated tests</li><li>Experience in working in an agile development environment</li><li>Experience using Git in a professional/workplace environment</li><li>Experience working in the aerospace industry is a plus</li><li>Experience working in a startup environment is a plus</li><li>Bachelor's degree in Computer Science or related field</li><li><strong>U.S. Citizenship</strong></li></ul><p><br></p><p><strong>About You: Skills</strong></p><ul><li>Python, C, and C++ Programming (3+ years professional experience)</li><li>Git (3+ years professional experience)</li><li>Amazon Web Services or other cloud providers (3+ years professional experience)</li><li>Relational Databases &amp; Data Modelling (3+ years professional experience)</li><li>Linux (3+ years professional experience)</li><li>Docker, Kubernetes, and DevOps practices (preferred)</li><li>Networking &amp; Communication Protocols (preferred)</li><li>Strong foundation in math</li></ul><p><br></p><p><strong>Why Kayhan Space:</strong></p><ul><li>This is an amazing opportunity to join an explosively growing start-up on the \\u201cground floor\\u201d and to be part of our entrepreneurial, people-first, high-performance culture!</li><li>We offer stock options in the company \\u2013 everyone\\u2019s an owner!</li><li>We offer excellent medical, dental, and vision insurance</li><li>We offer a 401K</li><li>We treat you like an adult with our \\u201cBe Reasonable\\u201d PTO policy.&nbsp;</li><li>This is an amazing opportunity&nbsp;</li><li>And lots, lots more!</li><li>Did we say we are building software for the Space industry?! Your work will go to space!</li></ul><p><br></p><p><em>Kayhan Space is an equal opportunity employer. At Kayhan, we make all employment decisions, which include hiring, promoting, transferring, demoting, evaluating, compensating and separating, without regard to sex, sexual orientation, gender identity, race, color, religion, age, national origin, pregnancy, disability, service in the uniform services, or any other classification protected by federal, state or local law.</em></p>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Kayhan Space\", \"sameAs\": \"https://www.linkedin.com/company/kayhan-space\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQGulb0DIRmQEA/company-logo_200_200/0/1621797751615?e=1637798400&v=beta&t=6g8gcEnUb-9VR0WzFS_43aMhfMfQrQz0EIxmLeSueeY\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Kayhan Space\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQGulb0DIRmQEA/company-logo_100_100/0/1621797751615?e=1637798400&v=beta&t=CbMYFBqB14E9RJzK6biruRrLkzwL_mn-ZLqvcT7EF8k\", \"industry\": \"\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Boulder\", \"addressRegion\": \"CO\", \"postalCode\": \"80310\", \"streetAddress\": null}, \"latitude\": 40.016872, \"longitude\": -105.279625}, \"skills\": \"\", \"title\": \"Software Engineer\", \"validThrough\": \"2022-02-16T04:22:09.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 36}, \"jobLocationType\": \"TELECOMMUTE\", \"applicantLocationRequirements\": {\"@type\": \"Country\", \"name\": \"United States\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}