{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-25T17:51:28.000Z\", \"description\": \"<strong>DevOps Engineer / Senior</strong> <strong>DevOps Engineer<br></strong><ul><li>U.S. citizenship is required for this position due to Department of Defense restrictions*<br></li></ul><strong><u>Role Summary<br><br></u></strong>This position can be filed at the Professional level or the Senior level. Part of a dynamic team, you will be responsible for the installation, upgrade, and support of enterprise Linux servers and applications. As WPS embraces DevSecOps, most of our Linux systems are automated through a continuous delivery pipeline. To be successful in this role, you must be passionate about infrastructure automation, DevSecOps and must love to help customers solve complex issues with automated solutions.<br><br><strong><u>In This Role You Will<br></u></strong><ul><li>Use and develop WPS\\u2019 continuous delivery pipeline to build, deploy, patch and manage Linux servers and applications.</li><li>Help ensure security of WPS systems and data by automating compliance checks and standards through the CI/CD pipeline.</li><li>Learn all aspects of compliance on Linux based systems as you secure systems and participate in system audits.</li><li>Work with other team members and teams to facilitate adoption of DevSecOps processes.</li><li>Introduce, design, and implement new technologies to streamline business processes.</li><li>Work on automation of COTS deployment using CI/CD technology, and design &amp; implement solutions based on design requirements.<br></li></ul><strong><u>This Role Could Be a Good Fit If You<br></u></strong><ul><li>Want to work on moderately complex projects independently or as part of a larger project team.</li><li>Can handle multiple competing initiatives and escalate issues effectively, efficiently and independently.</li><li>Are interested in working with technically adept team members that collaborate to solve complex problems.</li><li>Would thrive working with a leader that encourages autonomy, ideation and independence while maintaining strong team cohesion.</li><li>Have a passion for technology, process improvement, and a strong interest in innovation and automation.</li><li>Are experienced with configuration management concepts and infrastructure automation.</li><li>You have demonstrated experience in customer-focused solution development.</li><li>Are extremely detail oriented</li><li>You enjoy improving your own (and your teammates\\u2019) technical skills<br></li></ul><strong><u>You\\u2019ll Benefit From This Experience By<br></u></strong><ul><li>Providing technical assistance to clients both internal and external.</li><li>Working in an environment that will challenge you, and allow you to challenge others.</li><li>Working in an environment that serves our Nation\\u2019s military, veterans, Guard and Reserves along with their families.<br></li></ul><strong><u>You Need To Have<br></u></strong><ul><li>U.S. citizenship is required for this position due to Department of Defense restrictions.</li><li>Bachelor's Degree in related field or equivalent post high school and/or related work experience.</li><li>Senior Level: 1 year or more of related work experience.<br></li></ul><strong><u>We Highly Prefer<br></u></strong><ul><li>Senior level: - 4 or more years in information systems performing system administration.</li><li>Professional level: - 2 or more years in information systems performing system administration.</li><li>Strong grasp of the Linux platform, including understanding how the operating systems functions and package deployment methodology.</li><li>Strong programming and scripting skills in at least one of the following languages: Bash, Python, Java or Ruby.</li><li>Hands-on experience with at least one configuration/deployment management system, such as Chef, Puppet, Ansible, Salt or other similar tools.</li><li>Proficiency with version control system workflows, such as TFS, Git, Subversion, etc.</li><li>CI/CD pipeline development experience for software delivery using Jenkins, GitLab, Bamboo or similar tools.</li><li>Knowledge and hands-on experience with source code repository processes and tools, such as Artifactory.<br></li></ul><strong><u>We Also Prefer<br></u></strong><ul><li>Experience with ServiceNow or similar ticketing systems</li><li>Experience working in a highly secure environment</li><li>Puppet code testing with rspec or similar tools.</li><li>Experience with unit/system testing</li><li>Understanding of DISA, NIST, FISMA, DoD, and/or CMS audit requirements<br></li></ul><strong><u>Nice To Have<br></u></strong><ul><li>Experience with container management using OpenShift or Kubernetes.</li><li>Experience with working in cloud environments like AWS, Azure and Google.<br></li></ul><strong>This role is open to 100% remote work<br><br></strong><strong>Approved States:</strong> Arizona, Colorado, Connecticut, Florida, Georgia, Illinois, Indiana, Iowa, Michigan, Minnesota, Missouri, Nebraska, New Jersey, North Carolina, North Dakota, South Carolina, Texas, Virginia, Wisconsin<br><br><strong><u>Your Team<br><br></u></strong>You will be part of the DevOps - Linux and Core Infrastructure team, responsible for building and configuring the key technology components relied upon by WPS and all our business units. This is a small team, responsible for Linux, Unix, VMware, and server hardware. Two Senior and one Junior Linux Administrators will be your mentors. Our Sr. level individuals eventually will help train, coach, and support other team members (and other WPS teams) to write code that will manage infrastructure and application configurations.<br><br><strong><u>Compensation And Benefits<br></u></strong><ul><li>Eligible for annual Performance Bonus Program</li><li>401(k) with dollar-per-dollar match up to 6% of salary</li><li>Competitive paid time off</li><li>Health and dental insurance start DAY 1</li><li>Vision insurance</li><li>Flexible spending, dependent care, and health savings accounts</li><li>Short- and long-term disability, group life insurance</li><li>Innovative professional and cognitive development programs<br></li></ul><strong><u>Who We Are<br><br></u></strong>WPS Health Solutions is an innovator in health insurance and a worldwide leader in claims administration, serving millions of beneficiaries in the United States and abroad.<br><br>Founded in 1946, WPS offers health insurance plans for individuals, families, and seniors, and group plans for small and large businesses. We are a world-class claims processor and program administrator for the government\\u2019s Medicare program. And we manage benefits for millions of active-duty and retired military personnel and their families.<br><br>WPS has been named one of the World's Most Ethical Companies\\u00ae by the Ethisphere\\u00ae Institute for 10 years in a row<strong><em>.<br><br></em></strong><strong>Learn more about WPS</strong><strong>. <br><br></strong><strong>Our Purpose and Values<br><br></strong>Our purpose is to make healthcare easier for those we serve. <strong>Click Here<br><br></strong>Our values - Customer Focused, Individual Responsibility, Mutual Respect, and Driven &amp; Passionate - are the core of who we are and how we conduct business every day.<br><br><strong>Health Insurance<br><br></strong>WPS Health Insurance offers high-quality health insurance plans for individuals and families, Medicare supplement plans for seniors, and group health plans for businesses of every size.<br><br>http://wpshealthsolutions.com/business-units/wpshi.shtml<br><br><strong>Military and Veterans Health<br><br></strong>WPS Military and Veterans Health administers claims and provides customer service and related activities for the U.S. Department of Defense and the U.S. Department of Veterans Affairs and their beneficiaries.<br><br>http://wpshealthsolutions.com/business-units/wpsmvh.shtml<br><br><strong>Government Health Administrators <br><br></strong>WPS Government Health Administrators manages Medicare Part A and Part B benefits for more than 7 million beneficiaries. As one of the largest contractors for the Centers for Medicare &amp; Medicare Services, we\\u2019ve served Medicare beneficiaries and their health care providers since 1966.<br><br>http://wpshealthsolutions.com/business-units/wpsgha.shtml<br><br><strong>WPS Health Plan<br><br></strong>WPS Health Plan offers Health Maintenance Organization and Point-of-Service plans to the group and individual markets in eastern and north-central Wisconsin, plus third-party administrator services.<br><br>http://wpshealthsolutions.com/business-units/wpshi.shtml<br><br><strong><u>EPIC Specialty Benefits<br><br></u></strong>EPIC Specialty Benefits provides businesses group insurance products that cover:<br><ul><li>Life</li><li>Disability</li><li>Dental</li><li>Vision</li><li>Voluntary benefits<br></li></ul>http://wpshealthsolutions.com/business-units/epicsb.shtml<br><br><strong>Stay connected: </strong><strong>Sign-up for Job Alerts<br><br></strong><strong>FOLLOW US!<br><br></strong><strong>Facebook<br><br></strong><strong>Twitter<br><br></strong><strong>LinkedIn</strong>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"WPS Health Solutions\", \"sameAs\": \"https://www.linkedin.com/company/wps-health-solutions\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQFDClp4Ted9rw/company-logo_200_200/0/1619212765729?e=1637798400&v=beta&t=FUm5H2q8tLdILvHI2bQX04KF78hTd35B4MAqbAU_hX4\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"WPS Health Solutions\", \"value\": \"69758475-59a0-411f-9b9f-c9c557c74fd6\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQFDClp4Ted9rw/company-logo_100_100/0/1619212765729?e=1637798400&v=beta&t=-S6q8lREmAGH4QwcBzr-HbDFtvESfxxLq_WXbb-tF0Y\", \"industry\": \"Information Technology and Services,Insurance,Hospital & Health Care\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Illinois\", \"addressRegion\": \"United States\", \"postalCode\": \"61709\", \"streetAddress\": null}, \"latitude\": 40.12414, \"longitude\": -89.14863}, \"skills\": \"\", \"title\": \"Senior DevOps Engineer\", \"validThrough\": \"2021-09-24T17:51:27.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 48}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}