{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-29T16:22:21.000Z\", \"description\": \"<strong><u>Job-Specific Responsibilities<br><br></u></strong>We are looking for an aspiring and motivated software engineer to join the Department of Biomedical Informatics at Harvard Medical School, to build platforms for genome analysis. Genome sequencing is becoming a routine approach for diagnosing genetic diseases. As the number of patients referred to genetic screening is increasing, there is a need to build effective solutions to manage their data for clinical applications and discovery research.<br><br>The Clinical Genomic Analysis Platform (CGAP) and the 4D Nucleome (4DN) Platform at Harvard Medical School are scalable web-based applications for analysis, annotation, visualization, and reporting of genomic data. The portals are developed by a multidisciplinary diverse team of clinical geneticists, bioinformatic scientists, and software engineers, and share the cloud-based back-end. The working environment combines the best features of a startup (fast pace, flexibility, flat hierarchies) with those of one of the leading medical schools (excellent benefits, outstanding opportunities for learning).<br><br><strong><u>You Are An Aspiring Software Engineer Who Wants<br></u></strong><ul><li>to build open-source data portal for genomics,</li><li>to gain practical experience with all the technologies the platform is based on,</li><li>to work in a small team of developers and scientists utilizing state of the art big data technologies and following best practices,</li><li>to conduct systems analysis, design, development, and implementation of new web applications, to take courses at the Harvard Extension school at very reasonable costs (optional),</li><li>to enjoy other excellent benefits Harvard University has to offer,</li><li>to contribute to science and healthcare through software engineering.<br></li></ul><strong><u>The Responsibilities Include<br></u></strong><ul><li>optimizing data structures and databases to store and query millions of genetic variants,</li><li>improving the back-end of the application according to users\\u2019 feedback,</li><li>end-to-end software testing.<br></li></ul>The successful candidate will gain hands-on experience with, and master the following technologies:<br><ul><li>Python</li><li>Cloud computing (eg. Amazon Web Service)</li><li>Docker</li><li>Github/Jira</li><li>RESTful API (Pyramid) <br></li></ul><strong>Typical Core Duties<br></strong><ul><li>Participate fully in software development life cycle</li><li>Support technical solutions to deliver business requirements</li><li>Troubleshoot problems and suggest improvements to coding practices</li><li>Act as technical liaison to internal clients</li><li>Abide by and follow the Harvard University IT technical standards, policies and Code of Conduct<br></li></ul><strong><u>Basic Qualifications<br></u></strong><ul><li>Minimum of two years\\u2019 post-secondary education or relevant work experience<br></li></ul><strong><u>Additional Qualifications And Skills<br></u></strong><ul><li>BA/BS degree in Computer Science or related technical field or equivalent practical experience.</li><li>Examples of past programming projects that used Python and version control systems (eg. Git)</li><li>Strong Python coding skills.</li><li>Experience with version control systems and team software development (preferably Git).</li><li>Ability to define and solve logical problems for highly technical applications.</li><li>Strong communication skills with both technical and non-technical colleagues.</li><li>Ability to work independently, manage own time and learn quickly.</li><li>Ability to select, adapt, and effectively use a variety of programming methods.</li><li>Experience working with large amounts of data and building data pipelines.</li><li>Experience in web application development. API design, security, and integration testing.</li><li>Familiarity with web stack, including protocols and web server optimization techniques.</li><li>Cloud computing architectures (preferably with Amazon Web Services).</li><li>Automated testing, Continuous integration/deployment.</li><li>Experience with software development for healthcare products as well as familiarity with common clinical scenarios, regulatory and quality standards, payer and provider considerations.<br></li></ul><strong><u>Additional Information<br><br></u></strong>This is a one-year term position with strong potential for renewal.<br><br>This Staff role may start as a remote position due to the COVID-19 pandemic and while restrictions are still in place. The current remote nature of this role is considered temporary and may change as the University continues to evaluate options. While we continue to monitor the evolving COVID-19 guidelines, local on-campus work may be expected for some roles. Harvard Medical School does support flexible schedules, subject to individual departments\\u2019 business needs.<br><br>Harvard will require COVID vaccination for all Harvard community members who will have any on-campus presence. Individuals may claim exemption from the vaccine requirement for medical or religious reasons. More information regarding the University\\u2019s COVID vaccination requirement and exceptions may be found at the University\\u2019s \\u201cCOVID-19 Vaccine Information\\u201d webpage: http://www.harvard.edu/coronavirus/covid-19-vaccine-information/ .<br><br>Please note that we are currently conducting a majority of interviews and onboarding remotely and virtually. We appreciate your understanding.<br><br><em>We are committed to cultivating an inclusive workplace culture of faculty, staff, and students with diverse backgrounds, styles, abilities, and motivations. We appreciate and leverage the capabilities, insights, and ideas of all individuals. </em> <strong><em>Harvard Medical School Mission and Community Values<br><br></em></strong><strong><u>Harvard University Offers An Outstanding Benefits Package Including<br></u></strong><ul><li> Time Off: 3 - 4 weeks paid vacation, paid holiday break, 12 paid sick days, 12.5 paid holidays, and 3 paid personal days per year. </li><li> Medical/Dental/Vision: We offer a variety of excellent medical plans, dental &amp; vision plans, all coverage begins as of your start date. </li><li> Retirement: University-funded retirement plan with full vesting after 3 years of service. </li><li> Tuition Assistance Program: Competitive tuition assistance program, incredibly affordable classes directly at the Harvard Extension School, and discounted options through participating Harvard grad schools. </li><li> Transportation: Harvard offers a 50% discounted MBTA pass as well as additional options to assist employees in their daily commute. </li><li> Wellness options: Harvard offers programs and classes at little or no cost, including stress management, massages, nutrition, meditation, and complementary health services. </li><li> Harvard access to athletic facilities, libraries, campus events, and many discounts throughout metro Boston. </li></ul> The Harvard Medical School is not able to provide visa sponsorship for this position.<br><br>Not ready to apply? Join our Talent community to keep in touch and learn about future opportunities!<br><br>https://app.jobvite.com/TalentNetwork/action/campaign/w/NzM2NjU<br><br><strong>Job Function<br><br></strong>Information Technology<br><br><strong>Location<br><br></strong>USA - MA - Boston<br><br><strong>Job Code<br><br></strong>I0756P Applications Professional II<br><br><strong>Sub-Unit<br><br></strong><strong>Department<br><br></strong>Biomedical Informatics<br><br><strong>Time Status<br><br></strong>Full-time<br><br><strong><u> Salary Grade <br><br></u></strong>056<br><br><strong>Union<br><br></strong>00 - Non Union, Exempt or Temporary<br><br><strong>Pre-Employment Screening<br><br></strong>Education, Identity<br><br><strong>Schedule<br><br></strong>35 hrs. per week | Monday - Friday | 9:00 am - 5:00 pm<br><br><strong>EEO Statement<br><br></strong>We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, gender identity, sexual orientation, pregnancy and pregnancy-related conditions, or any other characteristic protected by law.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Harvard University\", \"sameAs\": \"https://www.linkedin.com/company/harvard-university\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQF5t62bcL0e9g/company-logo_200_200/0/1519855919126?e=1637798400&v=beta&t=N9Ck0welu3eojLWX36yPq3swhLkwHRn1RqSy6KHBGY8\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Harvard University\", \"value\": \"1906478\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQF5t62bcL0e9g/company-logo_100_100/0/1519855919126?e=1637798400&v=beta&t=_2-PJHxJGAv9-OmvpYJF8RiTQUdwbV7MHujI4ijMdTo\", \"industry\": \"Nonprofit Organization Management,Financial Services,Hospital & Health Care\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Boston\", \"addressRegion\": \"MA\", \"postalCode\": \"02118\", \"streetAddress\": null}, \"latitude\": 42.358994, \"longitude\": -71.05863}, \"skills\": \"\", \"title\": \"Junior Software Engineer\", \"validThrough\": \"2021-09-22T07:49:37.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 24}, \"estimatedSalary\": {\"@type\": \"MonetaryAmount\", \"currency\": \"USD\", \"value\": {\"@type\": \"QuantitativeValue\", \"minValue\": 63500, \"maxValue\": 95900, \"unitText\": \"YEAR\"}}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}