{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-06T17:48:32.000Z\", \"description\": \"<p>The Opportunity:&nbsp;&nbsp;</p><p><br></p><p>As part of the team, you&nbsp;would:&nbsp;</p><ul><li>Design and build state of the art machine learning solutions at scale&nbsp;</li><li>Develop optimized and automated ML deployment strategies</li><li>Contribute to development of ML life-cycle management tools</li><li>Collaborate with and learn from team members across the organization&nbsp;</li></ul><p>&nbsp;</p><p>Vianai&nbsp;is looking for experienced&nbsp;developers&nbsp;interested in furthering the&nbsp;state of the art of AI, democratizing our approaches to the design of thinking systems, and promoting our vision to current and&nbsp;prospective clients.&nbsp;</p><p>&nbsp;</p><p>What you\\u2019ll do:&nbsp;&nbsp;</p><ul><li>Setup, configure, deploy, upgrade and maintain both internal and cloud hosted landscapes across major cloud platforms e.g. AWS, Azure, GCP etc.</li><li>Develop and maintain CI/CD strategies that facilitate automated ML application deployment and monitoring.</li><li>Develop and maintain container-based infrastructure to support web-based application hosting, life-cycle management, etc.&nbsp;</li><li>Participate in development architecture design, especially for deployment and maintenance decisions.</li><li>Manage resource allocation and support software development activities such as: Authentication and permissions configuration; Deployment of web applications, preferably server-side JavaScript applications; Git repository management; And SSO configuration and management.</li></ul><p><br></p><p>About You:&nbsp;</p><p>You are fascinated by the unknown and curious to understand it. Your systems mindset and affinity for diving into code make you a natural explorer of new technology at the bleeding edge.&nbsp;</p><p><br></p><p>Our ideal colleague:&nbsp;</p><ul><li>Expert &amp; Student: We want to work with someone who has deep\\u202fdomain expertise and is also open and curious to new ways of doing things.</li><li>Maker &amp; Manager:\\u202fSomeone who&nbsp;will&nbsp;be hands-on and do the work, as well as\\u202flead&nbsp;brainstorming sessions and&nbsp;teams. A colleague who will jump in the trenches and lead by example.</li><li>Collaborative &amp; Independent: Someone who values communication and connection with others and&nbsp;can\\u202fcollaborate as part of a team and work independently</li></ul><p>&nbsp;</p><p>Education &amp; Qualification&nbsp;</p><ul><li>3~5 years hands work experience as a ML Ops Engineer or similar software engineering role.</li><li>Expert level knowledge of Kubernetes (and all K-prefixes eg. Knative, Kubeflow etc.)</li><li>Deep experience in CI/CD pipeline and tools.</li><li>Working knowledge of databases and SQL.</li><li>Excellent system design and object-oriented design and development skills.</li><li>Hands on experience with server based JavaScript application development.</li><li>General Unix or Linux expertise.</li><li>Faster learner and team player.</li><li>Excellent oral and written communication skills.</li><li>BS/BA in Information Technology, Computer Science or a related discipline; professional certification is a plus.</li></ul><p><br></p><p>Preferred Qualifications&nbsp;</p><ul><li>Extensive experience in managing the applications on major cloud platform, certified preferred.</li><li>Good understanding of release management.</li><li>Experience on data management, machine learning and application development.</li></ul><p><br></p><p>About Us:&nbsp;</p><p><br></p><p>Who we are:&nbsp;</p><p>We are a team of engineers, designers, doers, makers, and thought leaders. We are curious and creative, confident and humble. We have a passion for technology and believe that when used to amplify our humanity, it has the power to do good in the world. We are starting small, but we believe that we&nbsp;have the ability to&nbsp;change the world if we stay focused and remain true to our values.\\u202fVianai's&nbsp;team comes with deep expertise in enterprise technologies and landscapes, business application development, engineering services, design thinking, and cutting-edge AI research. We are a startup, but we are founded, funded and led by veterans of the industry. We think and work like entrepreneurs, but we\\u2019ve brought a wealth of experience and expertise that is deeply relevant to our mission and the market opportunity.&nbsp;&nbsp;&nbsp;</p><p>&nbsp;</p><p>How we Work:&nbsp;</p><p>We are professionals\\u202fand experts\\u202ffocused\\u202fon\\u202fbuilding\\u202forganizational\\u202fwisdom by\\u202factivating\\u202fartificial\\u202fintelligence and\\u202famplifying\\u202fhuman\\u202fminds. We are also sisters and brothers, fathers and mothers, sons and daughters, partners and friends. Our family comes from around the world. We love the environment. We believe in science and in spirituality, and we honor every living thing that shares the planet with us. We are teachers, and we are lifelong students.&nbsp;</p><p>&nbsp;</p><p>While\\u202fVianai\\u202fis a part of each one of us, it isn\\u2019t all of us.&nbsp;</p><p>&nbsp;</p><p>Our company is founded on a culture of trust, empowerment and respect. We bring our whole self to work \\u2014 the non-perfect, messy, sometimes imposter, sometimes expert, sometimes vulnerable and sometimes superhuman self that contributes to what we believe in. We strive to provide everyone, regardless of race, sex, age, gender, ability or sexual orientation, with a safe environment so each person can focus on doing what they do&nbsp;best, and&nbsp;help us change the world.&nbsp;</p><p>&nbsp;</p><p>We are committed to advancing inclusion, equity and diversity because we believe that to design more transparent and beneficial AI systems, we need architects of all types. And to us, the more perspectives the better. We don\\u2019t have all the answers, but we encourage questions and smart, creative people with diverse experience and expertise. The combination helps us gain clarity, find ideas and move to the best solution faster.&nbsp;</p><p>&nbsp;</p><p>We ask tough questions to each other and of ourselves. We don\\u2019t shrink from our responsibility to our community, and to all of humanity.&nbsp;</p><p>&nbsp;</p><p>Connect with Us: How to apply&nbsp;</p><p>Submit your resume and a cover letter introducing yourself and why you are interested in joining our team&nbsp;</p>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Vianai Systems, Inc.\", \"sameAs\": \"https://www.linkedin.com/company/vianai\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQG3TR2yyy3IHw/company-logo_200_200/0/1568268761315?e=1636588800&v=beta&t=fvQ6wZaWXVcb7NMkDQnHp0-yIg3_BOXxZC_a2NAnf7s\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Vianai Systems, Inc.\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQG3TR2yyy3IHw/company-logo_100_100/0/1568268761315?e=1636588800&v=beta&t=6jmApoygwsoGVt96FQleV-y2EC99VwXOoKe0QeixV2Y\", \"industry\": \"Computer Software,Internet,Information Technology and Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"San Francisco Bay Area\", \"addressRegion\": null, \"postalCode\": \"94112\", \"streetAddress\": null}, \"latitude\": 37.39271, \"longitude\": -122.042}, \"skills\": \"\", \"title\": \"Machine Learning Ops Engineer\", \"validThrough\": \"2021-09-05T17:48:31.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 60}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}