{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-16T11:12:10.000Z\", \"description\": \"<strong><u>Job Description<br><br></u></strong><strong>Enterprise Engineering (EE) group in Oracle Cloud Infrastructure (OCI) organization is seeking a motivated Principle Site Reliability Engineer that thrives in a fast-paced rapidly evolving technology environment. This individual will be a member of the SRE Infrastructure services team and focused on driving for those quality standards across all of EE. <br><br></strong><strong>As part of the Operational Engagement programs you will be instrumental in fostering a culture of SRE for horizontal activities and DevOps for products and tools across our global operations teams. The team you work in will have diverse expertise in systems, networking, and software development to provide the stability, performance and reliability our customers need. We work with multiple service development teams, identifying cross-team issues which create risk for operations across the organization and resolving those issues with a mixture of engineering, troubleshooting expertise, and general operational guidance. Your role also requires communication and organizational skills: you are an interface between Devops Tools, application teams that implement OCI services. You will deliver the solutions that directly contribute to our internal customer\\u2019s success.<br><br></strong><strong>Alongside the software and tools development, you will be required to perform systems, networking automation running on virtualized and non-virtualized platforms in cloud through automation. Other duties include researching, proofing OCI cloud services, their features for improving operations and authoring technical documentation that are beneficial to the company and the team.<br><br></strong><strong><u>What Will You Do<br></u></strong><ul><li>Articulate technical characteristics of services and technology areas and guide development teams to engineer and add capabilities to internal EE tools.</li><li>Act as ultimate escalation point for complex or critical issues that have not yet been documented as Standard Operating Procedures (SOPs).</li><li>Utilize a deep understanding of service topology and the dependencies required to troubleshoot issues and define mitigations.</li><li>Understand and explain the effect of product architecture decisions on systems.</li><li>Serve as part of a 24x7 On Call rotation in support of the infrastructure life cycle</li><li>Professional curiosity and a desire to a develop deep understanding of services and technologies.</li><li>Use your experience and wisdom from building &amp; running systems and infrastructures as a multiplier to drive operational improvements into OIT, its Service Teams and its Services.</li><li>Use your excellent written &amp; oral communication skills to ask pertinent questions, and to assess/aggregate/report the responses.</li><li>Quickly grasp and analyze new or new-to-you systems that are complex and rapidly changing.</li><li>Educate yourself and others on anything that helps Service Teams more quickly and easily build, test, deploy &amp; run their Services to be more reliable.</li><li>Identify problems and/or opportunities for improvements that are common across many teams/services.</li><li>Optimize application for maximum speed and scalability</li><li>Collaborate with other team members and stakeholders<br></li></ul><strong><u>Qualifications<br><br></u></strong><strong>Mandatory Qualifications<br></strong><ul><li>10+ years experience in compute, network, storage, database troubleshooting for improving capacity, reliability, scalability, availability working as a site reliability engineer</li><li>Bachelor\\u2019s or Master\\u2019s degree in Computer Science or equivalent related field experience</li><li>Experience with Python including Object Oriented programming</li><li>Experience working with fault tolerant, highly available, high throughput, distributed, scalable systems</li><li>Aptitude to be a good team player and the desire to learn and implement new Cloud technologies as needed</li><li>Excellent organizational, verbal, and written communication skills</li><li>Good understanding of Agile software development principles including using common tools such as JIRA</li><li>System Administration including Linux and Windows internals, TCP/IP, DNS, Load balancing technologies</li><li>OS image build for Linux, Windows and patch automation using Python, PowerShell</li><li>Cloud network experience<br></li></ul><strong><u>Preferred<br><br></u></strong><strong>8+ years of experience in four or more of the following<br></strong><ul><li>Experience VDI and Remote Administration Services</li><li>Developing/operating large scale distributed services / applications.</li><li>Creating API based services.</li><li>Experience with Security services and devices including: Firewalls, IDS/IDP, SIEM.</li><li>Container administration and development utilizing Kubernetes, Docker, Mesos, or similar</li><li>Infrastructure automation through Terraform, Chef, Ansible, Puppet, Packer or similar</li><li>Knowledge of cloud compute technologies, network monitoring</li><li>Experience with Cloud Orchestration frameworks, development and SRE support of these systems</li><li>Experience with CI/CD pipelines including VCS (git, svn, etc), Gitlab Runners, Jenkins, Rundeck</li><li>Oracle Database knowledge in ATP, ADW and programming in SQL, PL/SQL</li><li>Working with or supporting production, test, and development environments for medium to large user environments</li><li>Installing and configuring application servers and database servers</li><li>Experience in developing scripts to automate software deployments and installations</li><li>Experience in a 24\\u00d77 high-availability production environment</li><li>Ability to come with best solution by capturing big picture instead of focusing on minor details. Root cause analysis<br></li></ul><strong><u>Certifications Preferred<br></u></strong><ul><li>Cloud Certifications - OCI Certified, AWS Certified, Kubernetes certified</li><li>Python Certifications</li><li>Network Certifications \\u2013 CCNA</li><li>OS Certifications - OEL certified, RHCE certified</li><li>Security Certifications - Cloud security certs<br></li></ul><strong><u>Education (Preferred Degree)<br></u></strong><ul><li>M.S / B.S. in Computer Science, Computer Engineering, Software Engineering, or related areas is preferred<br></li></ul><strong><u>Additional Competencies<br><br></u></strong><strong>1: Bias for Action<br><br>Evaluates acts and communicates in SLA time. Is decisive. Makes timely, practical, effective decisions. Takes initiative without being asked. Plans efficiently while avoiding analysis paralysis. Knows how to take smart risks. Demonstrate strong follow-through and consistently keep commitments to customers and employees. Take ownership and responsibility for priority customer issues where and when required review urgent and critical incidents for quality.<br><br></strong><strong>2: Prioritization<br><br>Ability to prioritize the assignments at hand even in loosely structured situations. Effectively handles multiple projects or tasks at the same time and complete them within a set time frame.<br><br>3: Self development and teaching<br><br>Understands personal strengths and development needs. Initiates self-development actions. Seeks and shares job-relevant learning, developmental experiences, and feedback to enhance performance. Encourages others to take personal responsibility for continual learning and skill growth. Shares knowledge with others.<br><br>4: Dealing with ambiguity<br><br>Able to function well in loosely structured situations. Works effectively in situations involving uncertainty or lack of information. Effectively handles multiple projects or tasks at the same time. Is open to and responds flexibly to change.<br><br>5: Teamwork and willingness to roll up sleeves<br><br>Fosters cross-functional and cross business teamwork. Builds and promotes team morale. Works efficiently and effectively on teams to meet customers' needs. Contributes outside the scope of the job. Meets all team commitments. Consistent effort, intense commitment, and willingness to go above and beyond when needed. Willing to do low profile, non-challenging work to get the project done.<br><br></strong><strong><u>Special Requirements<br><br></u></strong><strong>Successful candidates might be required to perform on-call duty on rotational bases.<br><br></strong>Solve complex problems related to infrastructure cloud services and build automation to prevent problem recurrence. Design, write, and deploy software to improve the availability, scalability, and efficiency of Oracle products and services. Design and develop designs, architectures, standards, and methods for large-scale distributed systems. Facilitate service capacity planning and demand forecasting, software performance analysis, and system tuning.<br><br>Work with Site Reliability Engineering (SRE) team on the shared full stack ownership of a collection of services and/or technology areas. Understand the end-to-end configuration, technical dependencies, and overall behavioral characteristics of production services. Responsible for the design and delivery of the mission critical stack, with focus on security, resiliency, scale, and performance. Authority for end-to-end performance and operability. Partner with development teams in defining and implementing improvements in service architecture. Articulate technical characteristics of services and technology areas and guide Development Teams to engineer and add premier capabilities to the Oracle Cloud service portfolio. Understand and communicate the scale, capacity, security, performance attributes, and requirements of the service and technology stack. Demonstrate clear understanding of automation and orchestration principles. Act as ultimate escalation point for complex or critical issues that have not yet been documented as Standard Operating Procedures (SOPs). Utilize a deep understanding of service topology and their dependencies required to troubleshoot issues and define mitigations. Understand and explain the affect of product architecture decisions on distributed systems. Professional curiosity and a desire to a develop deep understanding of services and technologies.<br><br>A BS or MS in Computer Science, or equivalent. Identifies and implements complex solutions to knowledge of server hardware and software configuration, networking, standard internet services, scripting languages, cloud computing patterns, technology security and compliance. Experience running large scale customer facing web services. Identifies and implements complex solutions to understanding of load balancing technologies and experience with development in programming languages, databases and big data stores, and container technologies. Work involves defining and documenting technical architecture of complex and highly scalable products. A minimum of 8+ years experience of running large scale customer facing web services.<br><br><strong>Range and benefit information provided in this posting are Colorado-specific.<br><br></strong>Colorado Pay Range: from $97,000 to $186,000 per annum eligible for bonus and equity.<br><br>Oracle maintains broad salary ranges for its roles in order to account for variations in knowledge, skills, experience and market conditions, as well as reflect Oracle\\u2019s differing products, industries and lines of business.<br><br>Candidates are typically placed into the range based on the preceding factors as well as internal peer equity.<br><br>Oracle offers a comprehensive benefits package which includes the following:<br><ul><li> Medical, dental, and vision insurance, including expert medical opinion</li><li> Short term disability and long term disability</li><li> Life insurance and AD&amp;D</li><li> Supplemental life insurance (Employee/Spouse/Child)</li><li> Health care and dependent care Flexible Spending Accounts</li><li> Pre-tax commuter and parking benefits</li><li> 401(k) Savings and Investment Plan with company match</li><li> Flexible paid time off (unlimited or accrued vacation and sick leave)</li><li> Paid parental leave</li><li> Employee Stock Purchase Plan</li><li> Adoption assistance</li><li> Financial planning and group legal</li><li> Voluntary benefits including auto, homeowner and pet insurance<br></li></ul><strong><u>About Us<br><br></u></strong>Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It\\u2019s when everyone\\u2019s voice is heard and valued, that we are inspired to go beyond what\\u2019s been done before. That\\u2019s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.<br><br>Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Oracle\", \"sameAs\": \"https://www.linkedin.com/company/oracle\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_200_200/0/1568109893443?e=1637193600&v=beta&t=ubcHKNa8sawZcfHWjbUGCDvdWuBDJ9EmyUnrPonTlu8\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Oracle\", \"value\": \"117217\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_100_100/0/1568109893443?e=1637193600&v=beta&t=Lb8alKEFy7nLgY_vG1rSHqjIDoRytt5VAd-u0QreJKM\", \"industry\": \"Information Technology and Services,Computer Software,Financial Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Broomfield\", \"addressRegion\": \"CO\", \"postalCode\": \"80020\", \"streetAddress\": null}, \"latitude\": 39.923985, \"longitude\": -105.08166}, \"skills\": \"\", \"title\": \"Principal Site Reliability Engineer, OCI\", \"validThrough\": \"2021-09-15T11:12:08.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 120}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}