{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-10-05T17:47:15.000Z\", \"description\": \"Replicated is the modern way to ship multi-prem software. Replicated helps software vendors quickly and easily deploy their applications to any customer using a single architecture.The Replicated platform provides all of the tools needed to operationalize and scale the distribution of Kubernetes applications into any enterprise environment. Those tools include Kubernetes-native versions of release channels, customer license management, automated troubleshooting, and a nextgen end-customer admin experience.<br><br>Replicated is committed to cultivating an efficient, respectful workplace. We know that innovation thrives on teams where diverse points of view come together to solve hard problems in ways that are just now possible. As such, we explicitly seek people that bring diverse life experiences, diverse educational backgrounds, diverse cultures, and diverse work experiences.<br><br>We are fully remote and plan to stay that way! Most roles are open in any state in the US. We're open to candidates in Canada and the UK also.<br><br><strong>Full Stack Engineer<br><br></strong>Full Stack Engineers bring expertise in front end and Typescript development to a collaborative development team. They contribute to every stage of building the Replicated delivery and management platform. They implement, test, and deploy new enhancements and updates to our products. They work closely with Core engineers which have a complementary expertise in backend and service development.<br><br>As a member of the team you will get to use cutting-edge technology and emerging open source tools and standards. Our stack includes Go, Typescript, Kubernetes, and more. You\\u2019ll get an opportunity to work across the stack and build software for our highly technical user-base of software developers. You won\\u2019t be locked into legacy products or technology, our engineers learn something new every day.<br><br>What you'll do:<br><ul><li>Work with product managers, designers, and core engineers from prototype to production</li><li>Build public and internal APIs, often interfacing with core Kubernetes APIs</li><li>Write and contribute to Kubernetes operators and CLIs</li><li>Build web-based user interfaces for our vendor dashboards, on-premises customer dashboards, open source tools, marketing pages, and more</li><li>Mentor and be mentored, based on your experience level</li><li>Participate in a team based support and on-call rotation for our products<br><br></li></ul>You should have:<br><ul><li>2-5 years of professional development experience</li><li>Solid proficiency with Typescript and an interest in learning Go</li><li>Excellent technical communication and collaboration skills</li><li>Strong sense of responsibility for the experience of your users<br><br></li></ul>Nice to have:<br><ul><li>Passion for and well reasoned opinions on technology</li><li>Sense of design and product</li><li>Open source contributions (code, bug reports, community support)</li><li>Kubernetes experience</li><li>Graphic design experience<br><br></li></ul>Location: Remote US/Canada/UK<br><br>Not sure you meet 100% of our qualifications? Please apply anyway!<br><br>We invest in our team and love candidates who are eager to learn and grow. We have a fantastic team of highly collaborative individuals who enjoy learning, growing, and mentoring others.<br><br><u><strong>OUR VALUES<br><br></strong></u><strong>Curious.</strong> We are driven by a passion for solving hard problems and propelled by a shared desire to continuously learn.<br><br><strong>Trailblazing.</strong> We have the confidence to pursue new avenues and the courage to zig when so many others zag.<br><br><strong>Humble.</strong> We are proud of our accomplishments but understand that we haven\\u2019t solved every problem, yet. We\\u2019re on a journey of discovery and improvement.<br><br><strong>Dedicated. </strong>We take the long view when it comes to how we treat each other, how we treat our customers, and how we build our technology.<br><br><strong>Trusting and trusted. </strong>We inherently trust each other and believe in empowerment and autonomy so people can bring and do their best.<br><br><strong>Inclusive. </strong>We strive for diversity and inclusiveness because we know that being diverse and inclusive helps people, companies and communities thrive.<br><br><strong>Care personally.</strong> We know each member of our team is valuable and deserving of our active listening, understanding, and support.<br><br><strong>Benefits<br><br></strong>We offer strong benefits to help you stay healthy and productive. For the US, our benefits are listed below:<br><ul><li>Health/Dental/Vision</li><li>Life/AD&amp;D</li><li>LTD/STD</li><li>FSA</li><li>401K</li><li>Partner perk programs</li><li>Generous time off, we expect you to take a minimum of 3 weeks of per year</li><li>Laptop+accessories you need to get set up</li><li>Generous home office set up allowance or co-working space allowance - up to $10,000 per year!</li><li>Curiosity Budget to help you keep learning and growing!<br><br></li></ul>Replicated is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We encourage applicants of all backgrounds and we work to make sure that all team members have an equal opportunity to succeed.<br><br><em>We do not accept unsolicited assistance from any headhunters or recruitment firms for any of our job openings. All resumes or profiles submitted by search firms to any employee at Replicated in any form without a valid, signed search agreement in place for the specific position will be deemed the sole property of Replicated. No fee will be paid in the event the candidate is hired by Replicated as a result of the unsolicited referral.<br><br></em>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Replicated\", \"sameAs\": \"https://www.linkedin.com/company/replicated\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQFw5PvyZd-p1g/company-logo_200_200/0/1627327665641?e=1641427200&v=beta&t=83qA-VquI93XR_LNRR-whtppO5nSo_xopCRZ4GalE4c\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Replicated\", \"value\": \"4084973004\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQFw5PvyZd-p1g/company-logo_100_100/0/1627327665641?e=1641427200&v=beta&t=4trbUOFLzCeg-OZ91LrJsD2mvl0oT-zUSqBtxEAG_ls\", \"industry\": \"Internet\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"United States\", \"addressRegion\": null, \"postalCode\": \"99999\", \"streetAddress\": null}, \"latitude\": 39.50355, \"longitude\": -99.0183}, \"skills\": \"\", \"title\": \"Software Engineer (full stack)\", \"validThrough\": \"2021-11-04T17:47:14.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 24}, \"jobLocationType\": \"TELECOMMUTE\", \"applicantLocationRequirements\": {\"@type\": \"Country\", \"name\": \"United States\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}