{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-31T00:20:43.000Z\", \"description\": \"<strong><u>Company Description<br><br></u></strong>Etsy is the global marketplace for unique and creative goods. We build, power, and evolve the tools and technologies that connect entrepreneurs with buyers around the world. As an Etsy employee, you\\u2019ll tackle unique problems alongside talented coworkers committed to Keeping Commerce Human. We&apos;re large enough that you&apos;ll focus on meaningful, complex challenges, but small enough that you can make a rewarding impact.<br><br><strong><u>Job Description<br><br></u></strong>Etsy is the global marketplace for unique and creative goods. We build, power, and evolve the tools and technologies that connect entrepreneurs with buyers around the world. As an Etsy employee, you&apos;ll tackle unique problems alongside talented coworkers committed to Keeping Commerce Human. We&apos;re large enough that you&apos;ll focus on meaningful, complex challenges, but small enough that you can make a rewarding impact.<br><br>Do you love to craft amazing apps?<br><br>Etsy is looking for a passionate iOS Engineer to join our established Native Engineering organization. In this role you will work to build beautiful experiences for Etsy buyers and sellers on Apple platforms. You will collaborate with a talented team of engineers, designers, product and analytics colleagues who work together closely to support our iPhone and iPad apps. Our growing team requires someone who will thrive making technical contributions in a lively environment, but loves to have fun while they do so<br><br>This is a full-time role located (eventually) in Brooklyn, NY or San Francisco, CA. We are also open to remote hires in Canada and within all U.S. states, with the exception of Hawaii and Alaska.<br><br><strong><u>About The Team<br><br></u></strong>You&apos;ll be joining a team that focuses on expanding the horizons of what is already possible on the Etsy iOS app. We are a multi-discipline team of API engineers, designers, iOS engineers, UX researchers, and a product manager. In the past, we have worked on augmented reality, video capture, video display, and other more cutting-edge technologies.<br><br><strong><u>About Etsy Engineering<br><br></u></strong>The technical staff at Etsy believes that code is craft, and that the work we do is part of a larger creative culture represented by the hundreds of thousands of inspired artists and designers who make Etsy such a unique marketplace. We believe that small, empowered, self-motivated teams can do big things. We believe in measuring everything, taking advantage of our pioneering continuous deployment system to ship code early and often, and a blameless culture based on trust and a commitment to learning. Our product engineering teams have recently shipped projects like a unified and redesigned set of seller tools, a better recommendation and personalization experience for buyers, and a system to allow buyers and sellers to communicate more effectively about variations on their orders. Learn more about our engineering philosophies, tools, and some of the challenges we&apos;ve been solving on our Engineering blog: https://codeascraft.com/<br><br><strong><u>Qualifications<br><br></u></strong><strong>You will do well in this role if you:<br></strong><ul><li>Lead with questions, curiosity, and kindness while being an excellent communicator.</li><li>Are comfortable with saying \\u201cI don\\u2019t know\\u201d, doing research, and returning with options complete with trade offs.</li><li>Know your way around Xcode, lldb, the simulator, instruments, and various Apple devices.</li><li>Are proficient in both Swift and Objective-C.</li><li>Feel comfortable working with API engineers in order to make the best API response possible for various platforms.</li><li>Have a deep knowledge of the various iOS frameworks along with knowledge of when to use which tool for what job.</li><li>Have a willingness to understand, accurately use, and scale various iOS architectures.</li><li>Appreciate working with folks who value knowledge sharing, and want to contribute to a culture of generosity.<br></li></ul><strong><u>In This Role You Will<br></u></strong><ul><li>Assist with technically leading the iOS engineering work when it comes to unexplored areas of the Etsy iOS app.</li><li>Work with Product, Design, UX, API engineers, and other iOS engineers in order to determine what is possible on the platform in order to surprise, delight, and engage our users.</li><li>Effectively conduct technical discovery, break down projects into actionable pieces, and advise on timelines, dependencies, and tradeoffs.</li><li>Work with other iOS engineers on other teams to improve the Etsy app alongside iOS platform improvements.</li><li>Guide more junior engineers in their technical and architectural decisions, using thoughtful code reviews, mentoring, and project planning discussions.<br></li></ul><strong><u>Additional Information<br><br></u></strong><strong>What&apos;s Next<br><br></strong>If you&apos;re interested in joining the team at Etsy, please send a cover letter and resume telling us why you&apos;d be right for the position. As you&apos;ve hopefully seen already, Etsy is a place that values individuality and variety. We don&apos;t want you to be like everyone else -- we want you to be like you! So write to us and tell us what you&apos;re all about.<br><br><strong>Our Promise<br><br></strong>At Etsy, we believe that a diverse, equitable and inclusive workplace makes us a more relevant, more competitive, and more resilient company. We encourage people from all backgrounds, ages, abilities, and experiences to apply. Etsy is an equal opportunity employer. We do not discriminate on the basis of race, color, ancestry, religion, national origin, sexual orientation, age, citizenship, marital or family status, disability, gender, gender identity or expression, pregnancy or caregiver status, veteran status, or any other legally protected status. We will ensure that individuals with disabilities are provided reasonable accommodations to participate in the job application and interview process, to perform essential job functions, and to receive other benefits and privileges of employment. While Etsy supports visa sponsorship, sponsorship opportunities may be limited to certain roles and skillsets.<br><br><strong><u>For U.S. Roles Only<br><br></u></strong>Many Etsy roles are open to remote candidates, and you&apos;ll be able to identify which ones within the location header of each job description. We&apos;re open to remote hires from all U.S. states except Hawaii and Alaska. For candidates who will work remotely from Colorado, visit this link for information related to Colorado&apos;s Equal Pay for Equal Work Act.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Etsy\", \"sameAs\": \"https://www.linkedin.com/company/etsy\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQH54mBKd3375Q/company-logo_200_200/0/1562622034895?e=1638403200&v=beta&t=kLKpzRxkIj32wtDipysV3F4CfAD_SSvxZgHUDIjURCE\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Etsy\", \"value\": \"743999769637940\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQH54mBKd3375Q/company-logo_100_100/0/1562622034895?e=1638403200&v=beta&t=IAGTekiBUaFlVtQ4LzlXdBFikOvBN3Uupr8dCK3mzj4\", \"industry\": \"Marketing and Advertising,Computer Software,Internet\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Brooklyn\", \"addressRegion\": \"NY\", \"postalCode\": \"11239\", \"streetAddress\": null}, \"latitude\": 40.692528, \"longitude\": -73.991}, \"skills\": \"\", \"title\": \"Senior Software Engineer, iOS\", \"validThrough\": \"2021-09-30T00:20:42.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"jobLocationType\": \"TELECOMMUTE\", \"applicantLocationRequirements\": {\"@type\": \"Country\", \"name\": \"United States\"}, \"estimatedSalary\": {\"@type\": \"MonetaryAmount\", \"currency\": \"USD\", \"value\": {\"@type\": \"QuantitativeValue\", \"minValue\": 126000, \"maxValue\": 197000, \"unitText\": \"YEAR\"}}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}