{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-16T03:09:16.000Z\", \"description\": \"<strong><u>Job Brief<br><br></u></strong><strong>Job Description<br><br></strong>Sr Principal Site Reliability Engineer / Customer Engineering position with the Oracle Unity product in Oracle Customer Experience (CX) suite. This is similar to a Principal Solution Architect meets DevOps kind of a position that entails customer facing as well as deep technical ask<br><br><strong><u>The Product<br><br></u></strong>Oracle Unity brings together online, offline, and third-party customer data sources to create a single, dynamic view of the customer. With built-in artificial intelligence (AI) and machine learning, Oracle Unity derives and delivers timely intelligence about your customers so you can optimize their brand experience across marketing, sales, and service. Embedded within Oracle Customer Experience Cloud, Oracle Unity is open and extensible for integrating actionable intelligence into partner and ecosystem applications for the fastest time to value.<br><br>Learn more about the product at <u> https://www.oracle.com/cx/customer-data-platform/ <br><br></u><strong><u>Job Responsibilities<br></u></strong><ul><li> Be a subject matter expert (technical) on oracle Unity. </li><li> Act as a trusted technical advisor to both customer stakeholders and internal teams. </li><li> Perform technical audits of implementations to resolve escalated issues and suggest technical best practices independently. </li><li> Exercise excellent judgment, at a faster-than average pace, while paying extremely close attention to the details. </li><li> Using business and technical analysis skills to solve complex issues, and creating innovative workarounds and solutions to customer\\u2019s unique business needs. </li><li> Working with the product management and development organizations to channel client feedback and solutions into future releases. </li><li> Build and maintain excellent relationships with clients and achieve the highest level of customer satisfaction. </li><li> Responsible for building the tools and automation in accordance with the project/product needs. </li><li> Ensure proper recording and closure of all issues. </li><li> Interact with various internal teams such as product management, engineering and facilitate communication between customers and other teams. </li><li> Contribute technical content to Deployment Guides, Knowledge Base, FAQ\\u2019s etc.. </li><li> Work as part of our Customer Engineering team in a start-up atmosphere, doing whatever it takes to exceed customer expectations. </li><li> To be part of on-call rotational support model as needed. </li><li> Must have a complete understanding of the product architecture and be totally familiarized . </li><li> Must be able to render the customers with some of the best practices for integrations and suggest how to derive the best out of our product. </li><li> Communicates effectively, both verbally and written, with management, team members, and other departments. <br></li></ul><strong><u>Requirements<br></u></strong><ul><li> BS/MS in Computer Science or a related technical field. </li><li> 14+ years in a technical role such as senior engineer, lead, or architect in Solution Architecture, SW engineering, System Design, or Post Sales functions. </li><li> Strong knowledge in one of the scripting or programming language. (Perl/ Python / Java / Javascript / Go). </li><li> Strong grasp of automation with languages such as Python and Go with demonstrated experience. </li><li> Strong knowledge of cloud technologies. </li><li> Experience in designing, developing technology architectures, and the ability to identify and drive issues to closure. </li><li> Significant experience working with Linux OS. </li><li> Experience of BigData systems(Hadoop &amp; DW technologies like ADW/RedShift/SnowFlake). </li><li> Experience of SQL/NoSQL(MongoDB, Cassandra) databases. </li><li> Expertise with automation, monitoring and log analysis tools. </li><li> Expert knowledge of network architectures, security, and troubleshooting of connectivity or latency issues. </li><li> Comfortable managing several thousand node deployments and the automation it takes to ensure system uptime and redundancy </li><li> Continuous Integration development/deployment, e.g. Docker, Kubernetes. </li><li> Knowledge in CRM systems (Zendesk, Jira, Confluence). </li><li> Experience solving problems in a live production environment. </li><li> Must have excellent oral presentation and customer interaction skills. </li><li> Experience in managing multiple stakeholders and projects. </li><li> A listener who is customer-oriented and attentive to their needs. </li><li> Critical thinker and problem-solving skills. </li><li> Team player. </li><li> Good time-management skills. </li><li> Great interpersonal and communication skills. <br></li></ul><strong><u>Bonus Skills<br></u></strong><ul><li> Experience working with and managing multiple Hadoop clusters is a huge plus </li><li> Certification in Big Data technologies a plus </li><li> Experience in setting up Hadoop based solutions </li><li> Experience working or developing autoscaling tools (ex. Vertical Pod Autoscaler, Cluster Autoscaler and/or the Horizontal Pod Autoscaler) <br></li></ul>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.<br><br>As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. Define specifications for significant new projects and specify, design and develop software according to those specifications. You will perform professional software development tasks associated with the developing, designing and debugging of software applications or operating systems.<br><br>Provide leadership and expertise in the development of new products/services/processes, frequently operating at the leading edge of technology. Recommends and justifies major changes to existing products/services/processes. BS or MS degree or equivalent experience relevant to functional area. 8 or more years of software engineering or related experience.<br><br><strong><u>About Us<br><br></u></strong>Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It\\u2019s when everyone\\u2019s voice is heard and valued, that we are inspired to go beyond what\\u2019s been done before. That\\u2019s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.<br><br>Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Oracle\", \"sameAs\": \"https://www.linkedin.com/company/oracle\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_200_200/0/1568109893443?e=1637193600&v=beta&t=ubcHKNa8sawZcfHWjbUGCDvdWuBDJ9EmyUnrPonTlu8\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Oracle\", \"value\": \"115759\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_100_100/0/1568109893443?e=1637193600&v=beta&t=Lb8alKEFy7nLgY_vG1rSHqjIDoRytt5VAd-u0QreJKM\", \"industry\": \"Information Technology and Services,Computer Software,Financial Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Redwood City\", \"addressRegion\": \"CA\", \"postalCode\": \"94064\", \"streetAddress\": null}, \"latitude\": 37.4805, \"longitude\": -122.21528}, \"skills\": \"\", \"title\": \"Sr Principal Site Reliability Engineer\", \"validThrough\": \"2021-09-15T03:09:15.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 168}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}