{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-14T17:03:29.000Z\", \"description\": \"<strong>Are you passionate for innovation, and an entrepreneurial spirit?<br><br></strong><strong>Would you like to be part of a global team working on projects to transform energy?<br><br></strong><strong>Join our Advanced Analytics Team!<br><br></strong>Part of the Energy Innovation Center, the Advanced Analytics Team is focused on developing new digital solutions leveraging state-of-the-art AI/ML and data analytics techniques. We develop new solutions based on predictive data analytics, computer vision, immersive visualization and artificial intelligence technologies. We collaborate across the entire Baker Hughes enterprise on some of the most complex challenges defining the future of energy.<br><br><strong>Partner with the best<br><br></strong>You will work with a diverse, global, and interdisciplinary technology team working at the forefront of Baker Hughes\\u2019s digital transformation. You will lead and contribute to projects utilizing cutting-edge AI/ML methods. You will rapidly build, test and iterate advanced analytics PoCs, deploy in field pilots, and partner with Baker Hughes business units to transition technology ownership and bring new solutions to market.<br><br>As a Lead Machine Learning Engineer, you will be responsible for:<br><br><ul><li>Leading or contribute to one or more team projects, with accountability to develop ML algorithms.</li><li>Developing efficient AI solutions for performing image/video analytics, interpreting time series data, leveraging state-of-the-art ML techniques</li><li>Managing datasets for model training, working with SME as needed for data collection, interpretation and labelin</li><li>Following defined internal standards and best practices on coding, documentation, and version control</li><li>Maintaining knowledge of industry trends and connect with technology partners to identify innovations that can be leveraged</li><li>Proposing shortest-path solutions and work with a \\u201cminimum viable product\\u201d mindset to deliver new solutions rapidly</li><li> Managing projects using corporate portfolio management tools, responsible for planning, executing, monitoring, controlling and completing projects.</li><li> Working with internal/external customers, project sponsors, catcher, and other stakeholders to ensure alignment and project success.<br><br></li></ul><strong>Fuel your passion<br><br></strong>To be successful in this role you will:<br><br><ul><li>Have a Bachelor\\u2019s education in Computer Science or Engineering or related field. M.S. or Ph.D. a plus.</li><li>Have experience as a data scientist or adjacent position</li><li>Demonstrate experience with Python and C or C++.</li><li>Have background in computer vision including traditional image/video processing techniques (OpenCV, skimage), classification, object detection and segmentation</li><li>Have knowledge of other ML/DL domains including NLP, supervised/unsupervised learning, reinforcement learning, Bayesian networks is a plus.</li><li>Have experience successfully managing research &amp; technology development projects, including defining project scope/plan, managing communication with stakeholders, coordinating team and mitigating risks to ensure on-time delivery, and creating/maintaining project documents.<br><br></li></ul><strong>Work in a way that works for you<br><br></strong>We recognize that everyone is different and that the way in which people want to work and deliver at their best is different for everyone too. In this role, we can offer the following flexible working patterns:<br><br><ul><li>Flexible<br><br></li></ul><strong>Working with us<br><br></strong>Our people are at the heart of what we do at Baker Hughes. We know we are better when all of our people are developed, engaged and able to bring their whole authentic selves to work. We invest in the health and well-being of our workforce, train and reward talent and develop leaders at all levels to bring out the best in each other.<br><br><strong>Working for you<br><br></strong>Our inventions have revolutionized energy for over a century. But to keep going forward tomorrow, we know we have to push the boundaries today. We prioritize rewarding those who embrace change with a package that reflects how much we value their input. Join us, and you can expect:<br><br><ul><li>Contemporary work-life balance policies and wellbeing activities</li><li>Comprehensive private medical care options</li><li>Safety net of life insurance and disability programs</li><li>Tailored financial programs</li><li>Additional elected or voluntary benefits<br><br></li></ul><strong>About Us<br><br></strong>With operations in over 120 countries, we provide better solutions for our customers and richer opportunities for our people. As a leading partner to the energy industry, we're committed to achieving net-zero carbon emissions by 2050 and we're always looking for the right people to help us get there. People who are as passionate as we are about making energy safer, cleaner and more efficient.<br><br><strong>Join Us<br><br></strong>Are you seeking an opportunity to make a real difference in a company with a global reach and exciting services and clients? Come join us and grow with a team of people who will energize and inspire you!<br><br><strong>About Us:<br><br></strong>With operations in over 120 countries, we provide better solutions for our customers and richer opportunities for our people. As a leading partner to the energy industry, we\\u2019re committed to achieving net-zero carbon emissions by 2050 and we\\u2019re always looking for the right people to help us get there. People who are as passionate as we are about making energy safer, cleaner and more efficient.<br><br><strong>Join Us:<br><br></strong>Are you seeking an opportunity to make a real difference in a company that values innovation and progress? Join us and become part of a team of people who will challenge and inspire you! Let\\u2019s come together and take energy forward.<br><br>Baker Hughes Company is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.<br><br><strong> R27906</strong>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Baker Hughes\", \"sameAs\": \"https://www.linkedin.com/company/bakerhughes\", \"logo\": \"https://media-exp3.licdn.com/dms/image/C4E0BAQE4CJSgGjKt_w/company-logo_200_200/0/1615928699683?e=1634169600&v=beta&t=G9_HlWDmwsfgEE6H1_XegOU_3i9avc7Wi-WoOpdqmUU\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Baker Hughes\", \"value\": \"R27906\"}, \"image\": \"https://media-exp3.licdn.com/dms/image/C4E0BAQE4CJSgGjKt_w/company-logo_100_100/0/1615928699683?e=1634169600&v=beta&t=0o2cOvPeBi-xJIRSNhD0rTjq-6krjSGMLlG0Ujs4Hnk\", \"industry\": \"Information Technology and Services,Computer Software,Oil & Energy\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Oklahoma City\", \"addressRegion\": \"OK\", \"postalCode\": \"73118\", \"streetAddress\": null}, \"latitude\": 35.468494, \"longitude\": -97.52126}, \"skills\": \"\", \"title\": \"Lead Machine Learning Engineer\", \"validThrough\": \"2021-08-13T17:03:28.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}