{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-25T17:41:52.000Z\", \"description\": \"<strong><u>Job Description<br><br></u></strong><strong>Job Description<br><br></strong>As a <strong>Sr. Software Engineer</strong>, your job will be to work on our digital advertising products across the entire tech stack. You will work with databases, distributed systems, microservices, message bus/queues, and front-end UIs. Our stack includes React, Java, Spring Boot, Oracle DB, Spark, Hive, Kubernetes, Python and many other open source tools.<br><br>You will be using your problem solving ability to come up with innovative solutions to real business problems with internet-scale data. Your success will be measured by how well you couple critical thinking with self-motivation, enthusiasm and determination. You will be required to work effectively with your teammates. Engineers that like to collaborate and share their work will thrive here, and we offer ample opportunities to move between teams and work on varying business domains and technology challenges.<br><br><strong><u>Skills<br><br></u></strong>We look for candidates that have most of these:<br><ul><li> 4+ years experience with Java/Scala, Spring Boot or other microservice frameworks</li><li> 4+ years experience with relational databases and NoSQL/distributed databases, with understanding of tradeoffs</li><li> 2+ years experience with container technologies (docker, kubernetes)</li><li> 2+ years experience with devops - CI/CD, metrics, logging, monitoring/alerting</li><li> 2+ years experience with Javascript, React, Python + Flask a plus</li><li> Strong fundamentals including an understanding of data structures, concurrency, object-oriented and functional programming</li><li> Strong understanding of web architecture, security, cookies, reverse-proxies, REST</li><li> Familiar with and using SOLID, DRY, KISS principles</li><li> Self-starter \\u2013 you\\u2019re able to learn new concepts and technologies mostly on your own</li><li> BS in Computer Science or related field<br></li></ul><strong> Day in the Life <br></strong><ul><li> You will build quality software at world-class scale using cutting edge technologies</li><li> You will participate in a daily scrum and other agile rituals with your team</li><li> You will own your work and add tests and metrics into your code, and participate in code reviews</li><li> You will document designs and runbooks</li><li> You will learn from and teach your coworkers by actively participating in internal meetups (guilds)</li><li> You will contribute to shared libraries using our internal open source model</li><li> You will research and implement new technologies to solve specific problems<br></li></ul><strong> Perks <br></strong><ul><li> We invest in our people using internal &amp; external trainings, conferences and books</li><li> We invest in innovation by organizing many hackathons throughout the year</li><li> We're incredibly diverse - our workforce has many minorities and people of all ages</li><li> We have fantastic benefits, ranging from insurance (medical, dental, and vision) to 401k matching to an Employee Stock Purchase Program</li><li> We have unlimited vacation - and actually use it</li><li> We have fun - we have a beautiful space with foosball, ping pong, video games<br></li></ul><strong> What is Oracle Advertising? <br></strong>https://www.oracle.com/corporate/careers/data-cloud.html<br><br>Oracle Advertising (OA \\u2013 formerly Oracle Data Cloud) brings together data and technology to help digital advertising companies drive better business outcomes across more than 100 countries. Used by 199 out of AdAge\\u2019s 200 largest advertisers, our Audience, Context and Measurement solutions give marketers the data and tools needed for every stage of the marketing journey, from audience planning to data management, brand safety, fraud protection, contextual relevance, viewability confirmation, and ROI measurement. Oracle Advertising combines the leading technologies and talent from Oracle\\u2019s acquisitions of AddThis, BlueKai, Crosswise, Datalogix, Grapeshot, and Moat.<br><br>Our employees are essential to our success and we value the unique perspectives and experience you can bring to Oracle Advertising. We are very passionate about our culture and providing each person every opportunity to unlock their own hidden potential \\u2026 to learn \\u2026 to grow \\u2026 to thrive \\u2026 to achieve \\u2026 to win.<br><br><strong><u>And Underpinning It All Are Our Core Values<br><br></u></strong>WE ARE AUTHENTIC.<br><br>WE EMPOWER PEOPLE.<br><br>WE DRIVE BETTER OUTCOMES.<br><br>WE CELEBRATE CURIOSITY AND PROMOTE CONTINUAL LEARNING.<br><br>WE BUILD A SENSE OF BELONGING.<br><br>WE ARE CHANGING THE GAME.<br>We are a startup culture with the backing of a big company. We work hard, learn, coach, take breaks, and have fun. Join Oracle Advertising and be part of the team creating innovative and groundbreaking data-driven solutions for Marketing, Sales and Customer Intelligence.<br><br>Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.<br><br>As a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs.<br><br>Duties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience.<br>Colorado Pay Range: from $66,000 to $167,000 per annum; eligible for bonus and equity.<br><br>Oracle maintains broad salary ranges for its roles in order to account for variations in knowledge, skills, experience and market conditions, as well as reflect Oracle\\u2019s differing products, industries and lines of business. Candidates are typically placed into the range based on the preceding factors as well as internal peer equity.<br><br>Oracle offers a comprehensive benefits package which includes the following:<br><ul><li> Medical, dental, and vision insurance, including expert medical opinion</li><li> Short term disability and long term disability</li><li> Life insurance and AD&amp;D</li><li> Supplemental life insurance (Employee/Spouse/Child)</li><li> Health care and dependent care Flexible Spending Accounts</li><li> Pre-tax commuter and parking benefits</li><li> 401(k) Savings and Investment Plan with company match</li><li> Flexible paid time off (unlimited or accrued vacation and sick leave)</li><li> Paid parental leave</li><li> Employee Stock Purchase Plan</li><li> Adoption assistance</li><li> Financial planning and group legal</li><li> Voluntary benefits including auto, homeowner and pet insurance<br></li></ul><strong><u>About Us<br><br></u></strong>Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It\\u2019s when everyone\\u2019s voice is heard and valued, that we are inspired to go beyond what\\u2019s been done before. That\\u2019s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.<br><br>Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Oracle\", \"sameAs\": \"https://www.linkedin.com/company/oracle\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_200_200/0/1568109893443?e=1637798400&v=beta&t=_alHc2DpxoQs6i8SGZk_hdsaVjmVTegnNnDtwGBhH8A\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Oracle\", \"value\": \"107257\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_100_100/0/1568109893443?e=1637798400&v=beta&t=MebxQKjxBbTCCgRtxkyThJK81fc29XrGHRS8vxN0ZuA\", \"industry\": \"Information Technology and Services,Computer Software,Financial Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Broomfield\", \"addressRegion\": \"CO\", \"postalCode\": \"80020\", \"streetAddress\": null}, \"latitude\": 39.923985, \"longitude\": -105.08166}, \"skills\": \"\", \"title\": \"Software Engineer\", \"validThrough\": \"2021-10-03T03:00:05.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 48}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}