{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-10T18:10:25.000Z\", \"description\": \"<strong><u>Company Description<br><br></u></strong>Epsilon is the leader in outcome-based marketing. We enable marketing that\\u2019s built on proof, not promises. Through Epsilon PeopleCloud, the marketing platform for personalizing consumer journeys with performance transparency, Epsilon helps marketers anticipate, activate and prove measurable business outcomes. Powered by CORE ID\\u00ae, the most accurate and stable identity management platform representing 200+ million people, Epsilon\\u2019s award-winning data and technology is rooted in privacy by design and underpinned by powerful AI. With more than 50 years of experience in personalization and performance working with the world\\u2019s top brands, agencies and publishers, Epsilon is a trusted partner leading CRM, digital media, loyalty and email programs. Positioned at the core of Publicis Groupe, Epsilon is a global company with over 8,000 employees in over 40 offices around the world.<br><br>For more information, visit epsilon.com. Follow us on Twitter at @EpsilonMktg.<br><br><strong><u>Job Description<br><br></u></strong>Epsilon Strategic Partnership Group is looking for a Software Engineer (lvl2) to be part of our growing team. Our Software Developers create innovative solutions for social media, search and all sorts of cool internet advertising platforms in a Big Data environment. We focus on digital advertising and provide world class support to our internal and external clients. The Strategic Partnership Group wants people who can analyze business problems and then design solutions to solve them. We need people committed to designing and implementing top quality solutions in a rapidly changing environment.<br><br><strong><u>Essential Job Responsibilities<br><br></u></strong>The Software Engineer, level 2 position will focus on designing, developing and supporting all of our data solutions. This person will work closely with business leads to design and build innovative solutions.<br><br><strong><u>The Responsibilities For This Position Include<br></u></strong><ul><li>Participates in design and development of different parts of complex systems, including new systems or enhancements to existing systems.</li><li>Participates in design, development and implementation of robust, high volume applications using Java, Spark, Hadoop, Unix, Spring, Hibernate, Scala, Git, Maven, PostgreSQL, HBase and other related technologies.</li><li>Works independently to determine methods and procedures on new or special assignment to find solutions to existing problems.</li><li>Responsible for creating re-useable processes that help implement each solution.</li><li>Having broad expertise or unique knowledge, uses skills to contribute to development of company objectives and principles and to achieve goals in creative and effective ways.</li><li>Works with stakeholders to understand the business needs and gather requirements in order to develop appropriate applications. Prepares business and technical documentation.<br></li></ul><strong><u>Knowledge, Skill, And Ability Requirements<br></u></strong><ul><li>Bachelor\\u2019s degree or equivalent experience required.</li><li>Last 3 years designing and developing applications using Java</li><li>Understanding of core Java including basic knowledge of multi-threading and garbage collection, good knowledge of java collections</li><li>Experience with SQL and relational database development</li><li>Experience with HTML and JavaScript is a plus</li><li>Extensive experience working in a Unix environment is a must</li><li>Experience writing Unix Shell Scripts.</li><li>Experience using Java frameworks and tools, especially Spring, Hibernate and Maven is a plus</li><li>Experience with Angular or AngularJS is a plus.</li><li>Strong understanding of design patterns is a plus</li><li>Strong problem-solving skills are required. Big Data experience is a plus, especially experience with Hadoop, HBase and Spark</li><li>Experience with Scala and Spark is a plus</li><li>Experience with software development processes and methodology is a plus.</li><li>Experience with Agile methodology a plus.</li><li>Ability to juggle multiple projects simultaneously and manage time efficiently.</li><li>Excellent analytic skills and deadline focused, detail oriented, well organized and self-motivated.</li><li>Well-developed interpersonal skills.<br></li></ul><u><strong>Salary Range </strong></u><strong>$65,000 - $105,000<br><br></strong><strong><u>Additional Information<br><br></u></strong><strong>Great People, Deserve Great Benefits<br><br></strong>We know that we have some of the brightest and most talented associates in the world, and we believe in rewarding them accordingly. If you work here, expect competitive pay, comprehensive health coverage, and endless opportunities to advance your career.<br><br>Epsilon is an Equal Opportunity Employer. Epsilon\\u2019s policy is not to discriminate against any applicant or employee based on actual or perceived race, age, sex or gender (including pregnancy), marital status, national origin, ancestry, citizenship status, mental or physical disability, religion, creed, color, sexual orientation, gender identity or expression (including transgender status), veteran status, genetic information, or any other characteristic protected by applicable federal, state or local law. Epsilon also prohibits harassment of applicants and employees based on any of these protected categories.<br><br>Epsilon will provide accommodations to applicants needing accommodations to complete the application process.<br><br>REF104436B<br><br>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Epsilon\", \"sameAs\": \"https://www.linkedin.com/company/epsilon\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQHmmJFaUUk0ZA/company-logo_200_200/0/1625177275801?e=1636588800&v=beta&t=BEas_DIDbstqu3kP-V0oOAZqpqYl1W_1AaySIM1hSo4\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Epsilon\", \"value\": \"743999766087583\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQHmmJFaUUk0ZA/company-logo_100_100/0/1625177275801?e=1636588800&v=beta&t=QF6EmPOTPjbl_jNHTAiHJiaAJSAfGPfzblB01Qz5Wg8\", \"industry\": \"Computer Software,Information Technology and Services,Marketing and Advertising\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Westminster\", \"addressRegion\": \"CO\", \"postalCode\": \"80035\", \"streetAddress\": null}, \"latitude\": 39.863514, \"longitude\": -105.04112}, \"skills\": \"\", \"title\": \"Software Engineer\", \"validThrough\": \"2021-09-09T18:10:24.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}