{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-31T00:15:45.000Z\", \"description\": \"<p>It's fun to work in a company where people truly believe in what they're doing!&nbsp;&nbsp;</p><p>At Blackline, we're committed to bringing passion and customer focus to the business of enterprise applications.</p><p>Since being founded in 2001, BlackLine has become a leading provider of cloud software that automates and controls the entire financial close process. Our vision is to modernize the finance and accounting function to enable greater operational effectiveness and agility, and we are committed to delivering innovative solutions and services to empower accounting and finance leaders around the world to achieve Modern Finance.</p><p><br></p><p>Being a best-in-class SaaS Company, we understand that bringing in new ideas and innovative technology is mission-critical. At BlackLine we are always working with new, cutting-edge technology that encourages our teams to learn something new and expand their creativity and technical skillset that will accelerate their careers.</p><p><br></p><p>Work, Play and Grow at BlackLine!</p><p><br></p><p><strong>Make Your Mark:</strong></p><p>&nbsp;</p><p>BlackLine empowers our team members to be change agents and are always seeking new and innovative ways to solve problems. We are experiencing explosive growth and looking for passionate and talented people to join our team.</p><p>&nbsp;</p><p>As a Software Engineer, you will play a crucial role in delivering high quality releases to our customers by designing, developing, troubleshooting, maintaining, optimizing and scaling BlackLine\\u2019s cloud-based backend services and driving innovation into our product suite. In this role, you will research, test, benchmark and evaluate new technologies, propose scaling solutions, collaborate with other teams to define and build new features, optimize existing features while writing elegant code, and communicating with people at all levels. Your attention to detail, tenacity, and creative problem-solving and thinking ahead will directly impact the company's success, as well as the success of your peers across the organization.</p><p>If you have a passion for delivering products that make a difference, are driven to make things better in all that you do and are eager to work in a collaborative agile environment where Developers are dedicated to solving customer problems and innovating, then we want to talk to you.</p><p>&nbsp;</p><p><strong>You\\u2019ll Get To:</strong></p><p>&nbsp;</p><ul><li>Provide technical expertise and leadership in the design, development, and delivery of BlackLine\\u2019s products, while adhering to timelines, coding standards, requirements, and quality.</li><li>Architect, design, develop, test, troubleshoot, debug, optimize, scale, maintain and improve software applications, driving the delivery of high-quality value and features to BlackLine\\u2019s customers. Develop functional and technical specifications and test plans. Review others\\u2019 code. Develop and document functional and technical requirements. Collaborate with other team members and other teams on all of the above.</li><li>Design and communicate coding standards, architectural plans, solve complex design and architectural problems, create robust architectural solutions.</li><li>Implement, refine, and enforce software development techniques to ensure that delivered features meet software integration, performance, security, and maintainability expectations.</li><li>Research, test, benchmark, and evaluate new tools and technologies, and recommend ways to implement them in product development.</li><li>Maintain high standards of software quality and technical excellence within the team by establishing good practices and habits and writing clean, testable, maintainable, and secure code.</li><li>Inspire a forward-thinking team of developers, acting as an agent of change and evangelist for a quality-first culture within the organization. Mentor and coach team members and guide them to solutions on complex design issues.</li><li>Proactively identify issues, bottlenecks, gaps, or other areas of concern or opportunity and work to either directly affect change, or advocate for that change by working with peers and leadership to build consensus and take action.</li><li>Perform critical maintenance, deployment, and release support activities, including occasional off-hours support.</li><li>Adaptable team player with strong collaboration skills and a focus on results and value delivery.</li><li>Passion for engineering excellence, curiosity, and demonstrated the ability of continuous learning</li></ul><p><br></p><p><strong>What You\\u2019ll Bring:</strong></p><ul><li>BS degree in Computer Science, or equivalent experience.</li><li>5+ years of experience with software development in general purpose programming languages including but not limited to: C#, .NET, .NET Core.</li><li>5+ years of hands-on experience in building Web Applications, SaaS products, and RESTful APIs.</li><li>Experience with front-end technologies (HTML, JavaScript, CSS, JavaScript Frameworks, etc.) is a plus.</li><li>A solid computer science foundation including data structures, algorithms, and design patterns, with a proven track record of software design and architecture of complex systems.</li><li>Experience in service-oriented architecture and aspect-oriented programming.</li><li>Experience as a technical influencer for highly scalable distributed system designs.</li><li>Advanced knowledge of SQL, including stored procedures, data models, and transactional flows.</li><li>Fluent in SQL, data modeling, and transactional flows</li><li>Provide technical expertise and leadership in the design, development, and delivery of BlackLine\\u2019s products, while adhering to timelines, coding standards, requirements, and quality.</li><li>Architect, design, develop, test, troubleshoot, debug, optimize, scale, maintain and improve software applications, driving the delivery of high-quality value and features to BlackLine\\u2019s customers. Develop functional and technical specifications and test plans. Review others\\u2019 code. Develop and document functional and technical requirements. Collaborate with other team members and other teams on all of the above.</li><li>Design and communicate coding standards, architectural plans, solve complex design and architectural problems, create robust architectural solutions.</li><li>Implement, refine, and enforce software development techniques to ensure that delivered features meet software integration, performance, security, and maintainability expectations.</li><li>Research, test, benchmark, and evaluate new tools and technologies, and recommend ways to implement them in product development.</li><li>Maintain high standards of software quality and technical excellence within the team by establishing good practices and habits and writing clean, testable, maintainable, and secure code.</li><li>Inspire a forward-thinking team of developers, acting as an agent of change and evangelist for a quality-first culture within the organization. Mentor and coach team members and guide them to solutions on complex design issues.</li><li>Proactively identify issues, bottlenecks, gaps, or other areas of concern or opportunity and work to either directly affect change, or advocate for that change by working with peers and leadership to build consensus and take action.</li><li>Perform critical maintenance, deployment, and release support activities, including occasional off-hours support.</li><li>Adaptable team player with strong collaboration skills and a focus on results and value delivery.</li><li>Passion for engineering excellence, curiosity, and demonstrated ability of continuous learning</li></ul><p><br></p><p><strong>We\\u2019re Even More Excited If You Have:</strong></p><p><br></p><ul><li>Good knowledge of internet security issues in software design and code.</li><li>Experience with PostgreSQL and NoSQL databases.</li><li>Experience with open source tools.</li><li>Experience with public cloud architectures (Azure, ASW, or GCP) and cloud-native services.</li><li>Experience designing and scaling high-performance systems.</li><li>Experience with container management solutions like Mesos, Kubernetes, or Nomad.</li><li>Experience with API gateway, identity management, authentication, messaging platforms (e.g: Kafka, SQS, RabbitMQ), workflow orchestration tools, job scheduling, and search.</li><li>FinTech or Financial services domain background.</li></ul><p>&nbsp;</p><p><strong><u>Thrive At BlackLine Because You Are Joining:</u></strong></p><p><br></p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A technology-based company with a sense of adventure and a vision for the future. Every door at BlackLine is open. Just bring your brains, your problem-solving skills, and be part of a winning team at the world's most trusted name in Finance Automation!</p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A culture that is kind, open, and accepting. It\\u2019s a place where people can embrace what makes them unique, and the mix of cultural backgrounds and varying interests cultivates diverse thoughts and perspectives.</p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A company that believes in providing the best possible service to its clients, and that starts with offering amazing perks to its employees. These perks include 100% coverage for healthcare, vision, and dental, 401(k) matching, ESPP, food, drinks, games, and so much more!</p><p>\\u00b7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A culture where BlackLiners\\u2019 continued growth and learning is empowered.&nbsp;BlackLine offers a wide variety of professional development seminars and inclusive affinity groups to celebrate and support our diversity.</p><p>&nbsp;</p><p>BlackLine is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity or expression, race, age, religious creed, national origin, physical or mental disability, ancestry, color, marital status, sexual orientation, military or veteran status, status as a victim of domestic violence, sexual assault or stalking, medical condition, genetic information, or any other protected class or category recognized by applicable equal employment opportunity or other similar laws.</p><p>&nbsp;</p>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"BlackLine\", \"sameAs\": \"https://www.linkedin.com/company/blackline\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQHL3acPcC77Cg/company-logo_200_200/0/1625148755823?e=1638403200&v=beta&t=UNvu70jcE2CHWSg1zKoeVZK9Fw_oLu0aMTsRVIpdl84\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"BlackLine\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQHL3acPcC77Cg/company-logo_100_100/0/1625148755823?e=1638403200&v=beta&t=M7g34oAaCH_tkPb2LIui4GwMwpK5iwsKHbOhBWP7auQ\", \"industry\": \"Computer Software\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Los Angeles\", \"addressRegion\": \"CA\", \"postalCode\": \"90101\", \"streetAddress\": null}, \"latitude\": 34.05224, \"longitude\": -118.24335}, \"skills\": \"\", \"title\": \"Senior Software Engineer\", \"validThrough\": \"2021-09-30T00:15:44.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 60}, \"estimatedSalary\": {\"@type\": \"MonetaryAmount\", \"currency\": \"USD\", \"value\": {\"@type\": \"QuantitativeValue\", \"minValue\": 124000, \"maxValue\": 163000, \"unitText\": \"YEAR\"}}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}