{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-30T23:59:08.000Z\", \"description\": \"<strong><u>Company Description<br><br></u></strong>AIR Worldwide (AIR), a Verisk business, provides risk modeling solutions that make individuals, businesses, and society more resilient to extreme events. In 1987, AIR Worldwide founded the catastrophe modeling industry and today models the risk from natural catastrophes, terrorism, pandemics, casualty catastrophes, and cyber attacks, globally. Insurance, reinsurance, financial, corporate, and government clients rely on AIR\\u2019s advanced science, software, and consulting services for catastrophe risk management, insurance-linked securities, site-specific engineering analyses, and agricultural risk management. AIR Worldwide, is headquartered in Boston with additional offices in North America, Europe, and Asia. To learn more about AIR, please visit us at:\\u202fwww.air-worldwide.com. We are proud to be a part of the Verisk family of companies!<br><br>At the heart of what we do is help clients manage risk. Verisk (Nasdaq: VRSK) provides data and insights to our customers in insurance, energy and the financial services markets so they can make faster and more informed decisions.<br><br>Our global team uses AI, machine learning, automation, and other emerging technologies to collect and analyze billions of records. We provide advanced decision-support to prevent credit, lending, and cyber risks. In addition, we monitor and advise companies on complex global matters such as climate change, catastrophes, and geopolitical issues.<br><br>But why we do our work is what sets us apart. It stems from a commitment to making the world better, safer and stronger.<br><br>It\\u2019s the reason Verisk is part of the UN Global Compact sustainability initiative. It\\u2019s why we made a commitment to balancing 100 percent of our carbon emissions. It\\u2019s the aim of our \\u201creturnship\\u201d program for experienced professionals rejoining the workforce after time away. And, it\\u2019s what drives our annual Innovation Day, where we identify our next first-to-market innovations to solve our customers\\u2019 problems.<br><br>At its core, Verisk uses data to minimize risk and maximize value. But far bigger, is why we do what we do.<br><br>At Verisk you can build an exciting career with meaningful work; create positive and lasting impact on business; and find the support, coaching, and training you need to advance your career. We have received the Great Place to Work\\u00ae Certification for the fifth consecutive year. We\\u2019ve been recognized by <em>Forbes</em> as a World\\u2019s Best Employer and a Best Employer for Women, testaments to our culture of engagement and the value we place on an inclusive and diverse workforce. Verisk\\u2019s Statement on Racial Equity and Diversity supports our commitment to these values and affecting positive and lasting change in the communities where we live and work.<br><br><strong><u>Job Description<br><br></u></strong>We are seeking an enthusiastic and motivated person to join us in testing solutions for Insurance/Reinsurance risk modeling. You will be responsible for testing the software in an agile environment. We are looking for a candidate who can comprehend new technologies, come up to speed quickly and adapt to evolving requirements.<br><ul><li>Analyze functional requirements and design specifications &amp; create test plans and test cases, execute &amp; validate the test results.</li><li>Automate test cases, debug and fix automation issues.</li><li>Create a robust acceptance &amp; regression testing repository.</li><li>Discover, debug, document and verify software anomalies.</li><li>Document test artifacts; evaluate testing results and track them using internal tools/processes.</li><li>Communicate critical issues and status updates in a timely manner.</li><li>Address queries from Product Management, Software Development Group and Client Servicing team\\u2019s w.r.t our software products in a timely manner.</li><li>Identify QA and testing issues, and generate solutions for process improvement</li><li>Contribute to the training of new hires &amp; ramping them up to speed.</li><li>Work collaboratively with a global team.<br></li></ul><strong><u>Qualifications<br><br></u></strong><strong><u>Essential<br></u></strong><ul><li>Minimum of bachelor\\u2019s degree or equivalent in Computer Science, Engineering or Mathematics.</li><li>Minimum 4 - 6 Years\\u2019 experience working in an Agile software development team.</li><li>Knowledge of C#, C++, Java or any other object-oriented programming language.</li><li>Knowledge &amp; hands-on-experience of data management tools including but not limited to SQL/R/Python and Excel.</li><li>Excellent verbal and written communication skills.</li><li>Good analytical skills with strong attention to detail.</li><li>Experience in working with global teams.</li><li>Manager to make final hiring level decision.<br></li></ul><strong><u>Desirable<br></u></strong><ul><li>Knowledge of insurance/reinsurance.</li><li>Experience in working with large datasets.<br></li></ul><strong><u>Additional Information<br><br></u></strong>Verisk Analytics is an equal opportunity employer.<br><br>All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran&apos;s status, age or disability.<br><br>http://www.verisk.com/careers.html<br><br>Unsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.<br><br><strong>Consumer Privacy Notice<br><br></strong>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"AIR Worldwide\", \"sameAs\": \"https://www.linkedin.com/company/air-worldwide\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQHY2SBn_KdMTw/company-logo_200_200/0/1519856169573?e=1638403200&v=beta&t=UvAvghVODDyd4ZgNiJsvAhj8Vlcrjywt1JaW0bg_rZs\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"AIR Worldwide\", \"value\": \"743999769655394\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQHY2SBn_KdMTw/company-logo_100_100/0/1519856169573?e=1638403200&v=beta&t=HIYz2RQUxPwa0dFN9-YgTvV6TaUe0mXUyvixRU_LPN0\", \"industry\": \"Information Technology and Services,Computer Software,Insurance\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Boston\", \"addressRegion\": \"MA\", \"postalCode\": \"02118\", \"streetAddress\": null}, \"latitude\": 42.358994, \"longitude\": -71.05863}, \"skills\": \"\", \"title\": \"Software Quality Engineer or Senior Software Quality Engineer\", \"validThrough\": \"2021-09-29T23:59:07.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 48}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}