{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-06-11T18:14:30.000Z\", \"description\": \"<strong>Your success is a train ride away.<br><br></strong>Amtrak connects businesses and communities across the country and we move America\\u2019s workforce toward the future. We employ more than 20,000 diverse, energetic professionals in a variety of career fields throughout the United States. The safety of our passengers, our employees, the public and our operating environment is our priority and the success of our railroad is the result of our employees.<br><br><strong>Are you ready to join our team?<br><br></strong><strong><u>Summary Of Duties<br><br></u></strong>The Lead Data Engineer drives data transformation into formats that increase usability and analysis capability, as well as, builds data solutions that adhere to industry standards in data analytics.<br><br>The Lead Data Engineer is responsible for expanding and optimizing Amtrak\\u2019s data architecture, as well as optimizing data flow and collection for cross functional teams. This role supports multiple teams concurrently, which often include software developers, database architects, data analysts and data scientists on business initiatives, ensuring an optimal data delivery architecture is consistent throughout ongoing projects.<br><br>The Lead Data Engineer works on major projects providing subject matter expertise and technical direction and is also responsible for systems analysis, design, development, integration, and enhancement. The position works closely with customers, business analysts and team members to understand the business requirements that drive the analysis and design of quality technical solutions. These solutions must be aligned with business and IT strategies and in compliance with the organization\\u2019s architectural standards.<br><br>This role provides technical leadership coaching and mentoring to team members.<br><br><strong><u>Essential Functions<br><br></u></strong>Drives the data component on projects that may span a broad range of systems. Requires expertise in multiple technical environments and possesses an increased level of business knowledge. Responsibilities include, but may not be limited to, the following:<br><ul><li> Creates and maintains optimal data pipeline architecture.</li><li> Assembles large, complex data sets that meet functional/non-functional business requirements.</li><li> Identifies, designs, and implements internal process improvements, automates manual processes, optimizes data delivery, re-designs infrastructure for greater scalability.</li><li> Builds the infrastructure required for optimal extraction, transformation and loading of data from a wide variety of data sources using Structured Query Language (SQL) and Cloud Big Data technologies.</li><li> Build analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency, and other key business performance metrics.</li><li> Works with stakeholders including the Executive, Product, Data and Design Teams to assist with data-related technical issues and support their data infrastructure needs.</li><li> Creates data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader.</li><li> Works with data and analytics experts to strive for greater functionality in our data systems.</li><li> Adheres to quality standards and procedures. Reviews modules for quality assurance and checks compliance with application architecture standards and Service Level Agreements.</li><li> Defines data related development guidelines and standards to be utilized in software development/integration.</li><li> Provides ongoing maintenance of applications.</li><li> As the subject matter expert, provides technical guidance or system process expertise.</li><li> Develops reports and presentations for senior management, as needed.<br></li></ul><strong><li> Conduct requirement analysis, data profiling, data modeling, data ingestion, baseline reporting and visualizations for analytics projects utilizing Erwin, Informatica, Business Objects, Tableau and AWS services.<br><ul><li> Lead the design, development, and deployment of new modules, upgrades, and fixes while ensuring the documentation of project deliverables and post-production support mechanism is in place</li><li> Provide application support and coordinate with Tier2 and Tier 3 support teams to implement defect fixes and enhancements</li><li> Develop and implement projects based on use cases for advanced analytics including diagnostic, predictive, and prescriptive analytics.<br></li></ul><strong><u>Minimum Qualifications<br></u></strong><ul><li> Bachelor\\u2019s Degree in Computer Science, Information Systems, Business Management plus 6+ years relevant experience required or 10+ years of relevant work experience<br></li></ul><strong><u>Have a Broad Level Of Understanding Surrounding Application Architecture Standards, Data Analytics Environments And Tools That Include<br><br></u></strong>Extensive experience programming and systems analysis experience.<br><ul><li> Advanced working SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of databases.</li><li> Experience building and optimizing \\u2018big data\\u2019 data pipelines, architectures, and data sets.</li><li> Experience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement.</li><li> Strong analytic skills related to working with unstructured data sets.</li><li> Build processes supporting data transformation, data structures, metadata, dependency, and workload management.</li><li> A successful history of manipulating, processing, and extracting value from large disconnected data sets.</li><li> Working knowledge of message queuing, stream processing and highly scalable \\u2018big data\\u2019 data stores.</li><li> Experience using the following software/tools or equivalence:<br></li></ul><strong><li> Experience with big data tools<br><ul><li> Experience with SQL/NoSQL databases</li><li> Experience with data pipeline and workflow management tools</li><li> Experience with cloud services</li><li> Experience with stream-processing systems</li><li> Experience with both scripting and general-purpose object-oriented programming languages</li><li> Ability to work well under deadlines and in a flexible environment.</li><li> Must have leadership skills, experience/in-depth knowledge of business operations and systems requirements processes including ability to measure short- and long-term business goals.</li><li> Must possess the ability to utilize adaptable communication skills to effectively translate between technical and business language. Must possess the skills to educate project team members on business unit goals and objectives and educate the business on the value of information technology.</li><li> Ability to identify, propose and oversee the execution of business solutions as well as interpret documents communicating business needs and requirements.</li><li> Must possess the skill to assess the client needs through direct interaction and identify opportunities to develop the business through effective use of technology.</li><li> Provides expertise and technical skill, often leads a diverse team, demonstrates ownership of deliverables manages to deadlines and communicates across teams.</li><li> Effectively perform all IT Controls as applicable.<br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li> Knowledge of systems of operations in the transportation industry and analytics tools such as Tableau or SAP Business Objects</li><li> 7+ years relevant experience preferred<br></li></ul><strong><u>Communications And Interpersonal Skills<br><br></u></strong>Must have excellent written and oral communication skills.<br><br><strong>Requisition ID:</strong> 56025<br><strong>Posting Location(s):</strong> District of Columbia; Maryland; Virginia<br><strong>Job Family/Function:</strong> Information Technology<br><strong>Relocation Offered:</strong> No<br><strong>Travel Requirements:</strong> Up to 25%<br><br><strong> Amtrak employees power our progress through their performance. <br><br></strong>We want your work at Amtrak to be more than a job \\u2013 we want it to be a fulfilling experience where you find challenging and rewarding opportunities, respect among colleagues, competitive pay, benefits that protect you and your family, and a high performance culture that recognizes and values your contributions and helps you reach your career goals.<br><br>We proudly support and encourage U.S. Veterans to apply for Amtrak job opportunities.<br><br>All positions require pre-employment background verification, medical review and pre-employment drug screen. Amtrak is committed to a safe and drug-free workplace and performs pre-employment substance abuse testing. All new hires are required to undergo a hair drug test which detects the presence of illegal drugs for months prior to testing. Marijuana, notwithstanding any statute, ordinance, regulation, or other law that legalizes or decriminalizes the use or possession of marijuana, whether for medical, recreational, or other use. Candidates who engage in the usage of marijuana will not be qualified for hire. We appreciate your cooperation in keeping Amtrak safe and drug-free.<br><br>In accordance with DOT regulations (49 CFR section 40.25), Amtrak is required to obtain prior drug and alcohol testing records for applicants/employees intending to perform safety- sensitive duties for covered Department of Transportation positions. If an applicant/employee refuses to provide written consent for Amtrak to obtain these records, he/she will not permitted to perform safety-sensitive functions.<br><br>Note that any education requirement listed above may be deemed satisfied if you have an equivalent combination of education, training and experience.<br><br>Amtrak is an Affirmative Action/Equal Opportunity Employer and we welcome all to apply. We consider candidates regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability (including blindness), or veteran status.<br><br>POSTING NOTES: Information Technology || Corporate Jobs</li></strong></li></strong>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Amtrak\", \"sameAs\": \"https://www.linkedin.com/company/amtrak\", \"logo\": \"https://media-exp3.licdn.com/dms/image/C4D0BAQFFA5eXL3C_Bw/company-logo_200_200/0/1597160112456?e=1634169600&v=beta&t=RxRaaS1Ww7wEmBxFsWwFUBkRdon00PVIQgfQho4Lzf4\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Amtrak\", \"value\": \"744373900\"}, \"image\": \"https://media-exp3.licdn.com/dms/image/C4D0BAQFFA5eXL3C_Bw/company-logo_100_100/0/1597160112456?e=1634169600&v=beta&t=hfD6G4ZZtNhIXNRScjdB9RP70oPRh_HsvcHGdgAT7BU\", \"industry\": \"Construction,Information Technology and Services,Financial Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Washington\", \"addressRegion\": \"DC\", \"postalCode\": \"20002\", \"streetAddress\": null}, \"latitude\": 38.901917, \"longitude\": -76.993774}, \"skills\": \"\", \"title\": \"Machine Learning/Data Engineer- AWS - 90133515 - Washington\", \"validThrough\": \"2021-08-05T18:14:30.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 84}, \"estimatedSalary\": {\"@type\": \"MonetaryAmount\", \"currency\": \"USD\", \"value\": {\"@type\": \"QuantitativeValue\", \"minValue\": 81500, \"maxValue\": 148000, \"unitText\": \"YEAR\"}}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}