{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-10T05:08:18.000Z\", \"description\": \"Fearless is looking for a <strong>Site Reliability Engineer II </strong>to add to our diverse team of 150+ employees (and counting!).<br><br><strong><u>What You'll Be Doing<br><br></u></strong>We're looking to change the world by building software with a soul, and we want your help.<br><br>The Site Reliability Engineer II implements reliable infrastructure solutions according to the strategic direction of the team. They enable efficient delivery of value to our customers through effective infrastructure and fast pipelines, empowering application developers to deliver at the speed desired for the project. The Site Reliability Engineer II also supports operations of the production environments including observability and troubleshooting issues (sometimes outside of normal business hours if mandated by the contract).<br><br>The SRE II for the DoD portfolio has the opportunity to be involved in a key project with hands on support - helping to build and maintain pipeline tools to allow traditional applications and mobile iOS and Android app development in an AWS Cloud environment.<br><br><strong>What you should know:<br></strong><ul><li>The position is operating remotely during COVID-19. We value our culture and connection, plus flexibility to work form home. We are currently designing hybrid options</li><li>Our office is located in the Spark Building in Baltimore!<br></li></ul>We need your Site Reliability Engineer skills! What other skills will help you succeed at Fearless? Glad you asked! We're excited about candidates who can accomplish the following:<br><br><strong>Responsibilities and Contributions:<br></strong><ul><li>Coaches and mentors others through example and direct coaching on infrastructure and automation skills.</li><li>Takes initiative for their own growth through personal leadership.</li><li>Decomposes tasks into discrete objectives to serve the strategic direction of the team. </li><li>implements infrastructure and pipeline solutions with minimal direction in accordance with the project/organization technical standards.</li><li>Resolves technical issues in software infrastructure like software-defined networks, databases, and compute resources.</li><li>Advises the team on specific implementation options that meet business requirements.</li><li>Designs and automates log collection, storage, and analysis.</li><li>Automates security processes and vulnerability remediation.</li><li>Contributes actively in team Agile processes through discussion and/or preparation.</li><li>Manages the security posture of the system and helps maintain compliance with government regulations.</li><li>Provides feedback to improve the team's technical procedures.</li><li>Delivers scripts and tooling that interacts with external APIs.</li><li>Collaborates with other engineers and designers to implement features that meet design specifications and deliver business value.</li><li>Addresses production issues and implements measures to prevent future issues of the same kind.</li><li>Carries out implementation of Service Level Indicators (SLIs) for effective observability of critical systems.<br></li></ul><strong>Essential Skills, Experience, and Competencies:<br></strong><ul><li>Experience with implementing cloud infrastructure on AWS/Azure/GCP.</li><li>Experience with Linux, especially RHEL family, and Bash scripting.</li><li>Proficient in at least one scripting language (Bash, Python, etc).</li><li>Experience supporting scalable and elastic applications on distributed architectures.</li><li>Strong ability and understanding of securing systems on the application, network, and infrastructure layers.</li><li>Experience managing network/compute/database infrastructure with infrastructure-as-code. </li><li>Proficient in infrastructure management process and tools like Terraform and AWS Cloudformation.</li><li>Experience with server configuration processes and tools such as Chef, Ansible, or Puppet.</li><li>Expert in basic git actions like cloning, creating branches, navigating between branches, staging code for commit, committing code, resetting, and merging.</li><li>Proven ability to work under pressure and in fast-paced environments.</li><li>Understanding of interfacing with external APIs (REST, JSON, Auth Tokens).</li><li>Ability to operate and manage work, strategically reason, and build relationships and influence others.<br></li></ul><strong>Compensation:<br><br></strong>We believe in paying people fairly, so we've established a compensation model that ensures everyone at Fearless \\u2014 regardless of race, ethnicity, gender, sexual orientation, disability, religion, age, nationality, or negotiation skills \\u2014 is given equal pay for equal work.<br><br><strong>So, what's next?<br><br></strong>Over the years, we've honed a 3-step interview process that helps ensure that every employee we hire is the right fit for us and that we're the right fit for them. If we think you're a good fit, we'll get in touch and start scheduling your interviews!<br><ul><li>Culture Add Interview - We're a people-first company, so we always start off by getting to know more about you, how you work, what your career goals are, and what you're passionate about. This is your opportunity to ask questions and get a feel for Fearless, so don't be shy!</li><li>Technical Interview - This is where we get into the nitty gritty of the project. During the Technical Interview, you'll be interviewed by our Passion Coaches and/or the team's Project Lead to make sure your skills align with the project requirements.</li><li>Business Interview - At this point, you've made it to the final frontier! The Business Interview is when you'll meet with Fearless leadership to dot the i's, cross the t's, and determine whether or not we'll be moving forward with the hiring process.<br></li></ul><strong>Why Fearless?<br><br></strong>Our people make us who we are. We believe that every member of the Fearless team has something to share, and we value the unique viewpoint you'll bring to our community. But we value <em>your </em>community, too, so we offer fulfilling work that stays in balance with the rest of life. Because everyone has different needs, desires, and goals, our benefits offer the choices and flexibility that our team members need to live well and succeed. Here are a few highlights of our benefits package:<br><ul><li>Flexible schedule</li><li>Family-friendly workplace</li><li>3 weeks accrued PTO + 1 week sick leave + 10 federal holidays + your birthday off</li><li>100% coverage of the employee-only premium for HSA, HMO, or PPO plan and Employee Wellness Plan</li><li>Tech, education / training, and snack allowances</li><li>Free parking in downtown Baltimore / public transit coverage</li><li>Safe Harbor 401(k) plan with employer contributions<br></li></ul><strong>About Fearless:<br><br></strong>Fearless is a full-stack digital services firm in Baltimore that delivers sleek, modern, and user-friendly software designed to push the boundaries of possibility. It's our mission to build software with a soul \\u2014 tools that empower communities and make a difference \\u2014 so we can create a world where good software powers the things that matter.<br><br>That's not our only goal, though. We also strive to create a purple culture that makes our employees excited to come to work every day. That's why we encourage our employees to pursue their passions, both in and out of the office. With built-in company mentoring, continuing education support, flexible schedules, and a family-friendly work environment, we've created a culture that allows our team to thrive professionally and personally.<br><br>Fearless believes in equal opportunity employment. We won't discriminate against any employee or applicant on the basis of race, gender, nationality, age, religion, disability, military status, or sexual orientation. As a company and as individuals, we're committed to providing an inclusive and welcoming environment for our team, our family members, our clients, our subcontractors, and our vendors.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Fearless\", \"sameAs\": \"https://www.linkedin.com/company/fearlessbmore\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQG1_RrdjLPV6w/company-logo_200_200/0/1535724584960?e=1636588800&v=beta&t=nbQkVxmv0CZcKqF-N9SfFexYTk8mwVy4KgC8snXUeMw\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Fearless\", \"value\": \"3374282\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQG1_RrdjLPV6w/company-logo_100_100/0/1535724584960?e=1636588800&v=beta&t=jL6BGkwSxant42DQyZdZqNphnISKj6wOo3Ia7m_VKG4\", \"industry\": \"Information Technology and Services,Computer Software,Internet\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Baltimore\", \"addressRegion\": \"MD\", \"postalCode\": \"21226\", \"streetAddress\": null}, \"latitude\": 39.290443, \"longitude\": -76.612335}, \"skills\": \"\", \"title\": \"Site Reliability Engineer II (Terraform)\", \"validThrough\": \"2021-09-09T05:08:18.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}