{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-21T02:13:28.000Z\", \"description\": \"<strong>Job Title</strong><strong>:</strong> Pricing Data Analyst <strong>FLSA</strong>: Non-Exempt<br><br><strong>Department:</strong> Grocery <strong>Revision Date</strong>: 05/2018<br><br><strong><u>General Function<br><br></u></strong>Sets the department standards for customer service, employee relations, cleanliness, sanitation, professional appearance and overall profitability. Ensures products are available to the customer in a timely basis and all item parameters are accurately maintained in the product management software.<br><br><strong><u>Reporting Relations<br><br></u></strong>Accountable and Reports to: Store Director; Assistant Director; Store Operations, Perishables, Health Wellness Home; Managers of Store Operations, Perishables, Health Wellness Home; Assistant Managers<br><br>Direct Reports: Pricing Data Specialist<br><br><strong><u>Primary Duties And Responsibilities<br></u></strong><ul><li> Maintains a positive attitude; creates an atmosphere of friendliness and fun through flexibility and teamwork. Generates a friendly atmosphere by encouraging employees to greet and speak to customers; providing prompt, courteous, and efficient service to customers and sets a good example.</li><li> Sets the department standards for customer service, employee relations, cleanliness, sanitation, professional appearance and overall profitability.</li><li> Provides prompt, efficient and friendly customer service by exhibiting caring, concern and patience in all customer interactions and treating customers as the most important people in the store.</li><li> Smiles and greets customers in a friendly manner and makes an effort to learn customers' names and to address them by name whenever possible.</li><li> Assists customers by: (examples include)</li><li> escorting them to the products they're looking for</li><li> securing products that are out of reach</li><li> loading or unloading heavy items</li><li> making note of and passing along customer suggestions or requests</li><li> performing other tasks in every way possible to enhance the shopping experience.</li><li> Determines department goals with store management.</li><li> Supervises all personnel within the Product Management Department.</li><li> Establishes a schedule and daily work plan for the Product Management Department.</li><li> Maintains department supplies and replenishes as needed.</li><li> Assists store management with gross profit analysis and other management reporting functions.</li><li> Ensures inventory information is accurate for monthly inventory.</li><li> Oversees the maintenance of the product management applications and trains other store personnel.</li><li> Utilizes product management software to minimize out of stocks and inventory and maintains correct item parameters and signage to maximize sales and profits.</li><li> Ensures advertised, EDLP, and RDA items are priced and signed correctly and sufficient quantities are ordered.</li><li> Oversees special buys to ensure accuracy of parameters in product management application.</li><li> Plans and schedules inventory and pricing verification in accordance with Hy-Vee policy.</li><li> Works with upper management to determine product placement for new items and resets to ensure the timely presentation of products to the customer.</li><li> Ensures obsolete and discontinued inventory is reduced for quick sale. Monitors excess inventory and works with store management to minimize.</li><li> Monitors and reports on damage/unsaleables and implements solutions to reduce them.</li><li> Approves/edits replenishment and ad orders.</li><li> Ensures price changes and product information changes for all items are completed in a timely manner.</li><li> Assists department managers with questions concerning product management in their department.</li><li> Works with DSD vendors, checks in and balances vendor invoices.</li><li> Maintains strict adherence to department and company guidelines related to personal hygiene and dress.</li><li> Adheres to company policies and individual store guidelines.</li><li> Reports to work when scheduled and on time.<br></li></ul><strong><u>Secondary Duties And Responsibilities<br></u></strong><ul><li> Assists in other areas of store as needed.</li><li> Reviews equipment needs of the Product Management Department and makes recommendations to the Store Director for budget requests.</li><li> Performs other job related duties and special projects as required.<br></li></ul><strong><u>Supervisory Responsibilities<br><br></u></strong>Instructing, assigning work, reviewing work, planning the work of others, maintaining standards, allocating personnel, and coordinating the activities of others.<br><br><strong><u>Education And Experience<br><br></u></strong>High school or equivalent experience. Strong basic math skills necessary. Over six months to one year of similar or related experience.<br><br><strong><u>Physical Requirements<br></u></strong><ul><li> Must be physically able to exert up to 50 pounds of force (energy exerted) occasionally.</li><li> Visual requirements include vision from less than 20 inches to more than 20 feet with or without correction, depth perception, color vision, and field of vision.</li><li> Must be able to perform the following physical activities: Climbing, balancing, stooping, kneeling, reaching, standing, walking, pulling, lifting, grasping, feeling, talking, hearing, and repetitive motions.<br></li></ul><strong><u>Knowledge, Skills, Abilities And Worker Characteristics<br></u></strong><ul><li> Must have the ability to solve practical problems; variety of variables with limited standardization; interpret instructions.</li><li> Ability to do arithmetic calculations involving fractions, decimals, and percentages.</li><li> Possess the ability to interview to obtain basic information; guide people to provide basic direction; follow technical manuals and have increased contact with people.<br></li></ul><strong><u>Working Conditions<br><br></u></strong>This position is frequently exposed to noise, occasionally exposed to temperature extremes and equipment movement hazards, and continually exposed to the fast paced work environment and pressure to meet deadlines.<br><br><strong><u>Equipment Used To Perform Job<br><br></u></strong>Windows based PC, printer, wireless devices, telephone, fax, copier, calculator, internet, product management software, and Microsoft Office products.<br><br><strong><u>Financial Responsibility<br><br></u></strong>Responsible for company assets including equipment and merchandise.<br><br><strong><u>Contacts<br><br></u></strong>Has daily contact with customers, suppliers/vendors and with the general public.<br><br><strong><u>Confidentiality<br><br></u></strong>Has access to confidential information including store inventory information, item costs, and margins.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Hy-Vee, Inc.\", \"sameAs\": \"https://www.linkedin.com/company/hy-vee\", \"logo\": \"https://media-exp3.licdn.com/dms/image/C4D0BAQEILGU2ryppLQ/company-logo_200_200/0/1611263674315?e=1634774400&v=beta&t=uEV1KpzNXXD_-_TtvbDPHdw8iKupPXNOnHEOGEdXiL8\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Hy-Vee, Inc.\", \"value\": \"331964\"}, \"image\": \"https://media-exp3.licdn.com/dms/image/C4D0BAQEILGU2ryppLQ/company-logo_100_100/0/1611263674315?e=1634774400&v=beta&t=XSl56VmPFn6kYx_IOg1sKdbx3pwkX47DMfvhqCzRqn8\", \"industry\": \"Construction,Food & Beverages,Retail\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Waterloo\", \"addressRegion\": \"IA\", \"postalCode\": \"50706\", \"streetAddress\": null}, \"latitude\": 42.49347, \"longitude\": -92.34364}, \"skills\": \"\", \"title\": \"Pricing Data Analyst\", \"validThrough\": \"2021-08-20T02:13:28.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 12}, \"estimatedSalary\": {\"@type\": \"MonetaryAmount\", \"currency\": \"USD\", \"value\": {\"@type\": \"QuantitativeValue\", \"minValue\": 36200, \"maxValue\": 62600, \"unitText\": \"YEAR\"}}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}