{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-10-18T06:14:14.000Z\", \"description\": \"This position contributes to Starbucks success by managing the planning and execution of activities of an Application Development Team with a strong focus on infrastructure and application automation. As engineer principal in application development, you are responsible for managing a team of software developers through planning, delivery and operations of solutions. You are also responsible for the evolvement, delivery and support the technology strategy and roadmaps for new and existing applications and platforms. This role requires managerial experience, technical expertise, domain proficiency, platform depth, and leadership. Models and acts in accordance with Starbucks guiding principles.<br><br>Responsibilities and essential job functions include but are not limited to the following:<br><br><strong>Leadership</strong> - Setting goals for the work group, developing organizational capability, and modeling how we work together: <ul><li>Manages an engineering team with Automation focus to comply with Starbucks Cloud governance and Global Cyber Security requirements.</li><ul><li>Provide Architecture Design Pattern </li><li>Provide Automation Engineering Services for common platform components</li><li>Provide consultative services for technical issues within the application teams.</li><li>Interface with Starbucks Cloud and Global Cyber Security teams representing our application platforms. </li><li>Manages the technical team through the solution design process. Leverages and develops talent on the team through all phases of project efforts, including requirements gathering, assessment and backlog refinement. Shapes and guides systems approach, manages project initiation, technical design and development efforts. </li><li>Ensures platform has appropriate design patterns and coding standards in place. Directs team toward secure, durable, scalable, flexible, and accessible solutions that proactively mitigate against production support issues. </li><li>Identifies and communicates key responsibilities and practices to ensure the immediate team of direct reports promotes a successful attitude, confidence in leadership, and teamwork to achieve business results. </li><li>Accountable for delivery of development and operational efforts of the team by ensuring efforts are staffed, structured, budgeted and prioritized appropriately. <br></li></ul><strong>Platform Stewardship</strong> - Championing platform automation efforts to promote platform evolvement and stability to support business needs.<br><ul><li>Partners with cross functional teams, such as Infrastructure, Security, Architecture, QA and key Development teams, to strengthen and elevate the platform from a technology perspective. Successfully sees designs and solutions through enterprise processes and governance to ensure compliant, secure and supportable solutions. <br></li></ul><strong>Partner Development and Team Building</strong> - Providing partners with coaching, feedback, and developmental opportunities, and building effective teams:<br><ul><li>Provides partners with coaching, feedback and developmental opportunities and builds effective teams. </li><li>Ensures partners adhere to legal and operational compliance requirements. <br></li></ul>Production Support for application and platform components<br><ul><li>Defines and maintains processes, procedures, and expectations for team\\u2019s production support responsibilities. </li><li>Ensures platform application and platform support documentation is in place. </li><li>Leads team through high severity platform related operational incidents. <br></li></ul><strong><u>Basic Qualifications<br></u></strong><ul><li>8-10 years of professional industry experience with software development and operations </li><li>5 years of managing systems or application development projects of all sizes and complexities, including large systems </li><li>3-5 years of leading or managing small technical teams </li><li>Bachelor\\u2019s degree in Computer Science or related field <br></li></ul>Technical Proficiency</ul> <ul><li>Ability to hire, manage and grow a team of technical experts that cohesively build and operate secure, durable, flexible, accessible solutions. Requires an understanding of relevant development languages, tools, frameworks, utilities and technical dependencies. </li><li>Recognizes, values and champions high quality, reusable software with minimal defects on the team. </li><li>Working experience with product development teams in a platform engineering role is highly desirable.</li><li>Ability to build automation tools for platform processes for various application pipeline.</li><li>Working knowledge of application architecture, infrastructure and security concepts and technical implementation. </li><li>Aptitude to pick up new technologies and trends, as they become relevant for the business and our platforms. Examples include Graph DB, Big Data, REST Services, and incorporating cloud components.</li><li>Expert in understanding of implications from design and implementation architecture choices toward building secure, scalable, durable, flexible, accessible solutions. </li><li>Strong knowledge of Azure or AWS and Cloud Computing concepts</li><li>Strong hands-on coding and code review </li><li>Strong knowledge in best practices for:</li><ul><li>System Architecture and design. </li><li>RDBMS and NoSQL </li><li>Platform and infrastructure</li><li>Application. PaaS services</li><li>Monitoring, auditing, and operations</li></ul><li>In-depth working experience in a DevOps culture; one or more DevOps, Orchestration/Configuration Management and Continuous Integration technology (e.g. Docker/Kubernetes, Jenkins, Ansible, Terraform, ELK stack, Splunk etc.) </li><li>Linux (Ubuntu, CoreOS, RedHat) and/or Microsoft Windows Server and associated technologies (Active Directory, Exchange etc.) </li><li>One or more Web and Application Server technologies (e.g. Apache HTTP, Apache Tomcat, Nginx) </li><li>Networking protocols such as HTTP, DNS and TCP/IP </li><li>One or more version control platform (e.g. Git) </li><li>Experience managing full application stacks from the OS up through custom applications </li><li>Expert in analyzing and troubleshooting applications.<br></li></ul>Domain Proficiency<br><ul><li>Broad and deep understanding of relevant platform and applications capabilities, including established API\\u2019s, system activity components, process flows, the underlying data model, implementation specifics of important business rules, batch jobs, user interface components, and application configuration.</li><li>Familiarity and curiosity in the business context and trends, as well as the business customers\\u2019 opportunities. Awareness of the functional aspects of the solution.</li><li>Product platform life cycle - Strategy, development and deployment</li><li>Help define overall platform evolvement strategies and procedures</li><li>Help define operational processes to ensure predictable software development outcomes; refine Information Security processes and procedures.</li><li>Develop, recommend, evaluate, integrate, deploy, and maintain security tools including security framework.</li><li>Evaluate software security products and technologies.</li><li>Develop and deploy solutions in Agile methodology, with continuous delivery processes<br></li></ul>Interpersonal Skills<br><ul><li>Ability to lead and influence cross functional teams that include architects, analysts, developers and QA analysts</li><li>Ability to articulate ideas, using facts and data, for solutions to both technical and business communities</li><li>Excellent verbal and written communication skills</li><li>Ability to influence and negotiate strategy and roadmaps in planning exercises</li><li>Strong analytical and problem-solving skills</li><li>Ability to balance multiple priorities and meet deadlines</li><li>Ability to make timely and effective decisions using a mixture of intuition, analysis, experience and judgment <br></li></ul><em>Starbucks and its brands are an equal opportunity employer of all qualified individuals.<br><br>We are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply.<br><br>Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at 206-318-0660 or via email at applicantaccommodation@starbucks.com<br><br></em>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Starbucks\", \"sameAs\": \"https://www.linkedin.com/company/starbucks\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQEQxk9y2rk7Hw/company-logo_200_200/0/1519856020155?e=1642636800&v=beta&t=nACI5bU7645jZwujZDMWHiOaeryxgL6P2mrMSCagjKs\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Starbucks\", \"value\": \"210001705\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQEQxk9y2rk7Hw/company-logo_100_100/0/1519856020155?e=1642636800&v=beta&t=m-X8Os_d3Y5wKtNClluoja4JwEFxUKF8a64vUkCo7EM\", \"industry\": \"Consumer Goods,Food & Beverages,Retail\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Seattle\", \"addressRegion\": \"WA\", \"postalCode\": \"98133\", \"streetAddress\": null}, \"latitude\": 47.60323, \"longitude\": -122.33028}, \"skills\": \"\", \"title\": \"engineer principal, Platform Automation- Seattle WA\", \"validThrough\": \"2021-11-17T06:14:13.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 96}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}