{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-10-14T00:00:00.000Z\", \"description\": \"<strong><u>Position Summary<br><br></u></strong>Stratasan's mission is to collaborate with hospitals and help them make better, more informed strategic growth decisions. Every employee here cares deeply about achieving that mission, and we work tirelessly to build and support products that will help them succeed.<br><br>In the Software Engineer role, you will build new features and products, closely collaborating with our Product and Data Services teams to deliver delightful software. We have written about how our Engineering team works at engineering.stratasan.com as a resource for new and potential team members.<br><br><strong> In the role you will <br></strong><ul><li> Work with the Engineering team to develop and maintain web-based products and tools. </li><li> Implement best practices in software development, emphasizing security and stability. </li><li> Write automated tests to ensure quality work and prevent introduction of regressions. </li><li> Work with other team members to translate business requirements into technical specifications. </li><li> Manage time to meet deadlines. <br></li></ul><strong> You will love this job if <br></strong><ul><li> You enjoy working with responsible developers and can clearly communicate complex engineering challenges and decisions. </li><li> You have a strong attention to detail and are not afraid to speak honestly and openly about potential improvements to our products and process. </li><li> You feel strongly that shipping early and often is a great way to build software. </li><li> You are willing to grow and take initiative to improve the team and our products. </li></ul> <strong> Why We Should Hear From You <br></strong><ul><li> You have 2 or more years shipping production software on the web. </li><li> You have experience with relational data, SQL and RDBMS like Postgres (Postgres experience is not required, however). </li><li> You are not afraid to work on both the front- and back-end, though this role focuses primarily on the back-end. </li><li> You have experience in healthcare technology, though by no means is this required. We can teach you healthcare! </li><li> You have experience with Python and Django, though experience with similar languages and frameworks is valuable as well. </li></ul> <strong> WFH </strong><strong> The Engineering Team works asynchronously, relying on written communications in GitHub, Slack, and Jira. Our team is 100% distributed. Applicants must live and be authorized to work in the United States. </strong><strong> Compensation </strong><strong> Compensation for this role is commensurate with experience. </strong><strong> About Stratasan <br><br></strong>When you think \\u201chealthcare data and analytics company,\\u201d what\\u2019s the first thought that comes to mind? That sounds like a super fun place to work. Us too! Though, maybe we\\u2019re biased?<br><br>Our bright, diverse team of analysts, engineers, product developers, and everyday dreamers are working to shake up the healthcare space and change the way hospitals use data and analytics. Serving as a hub for business development intelligence, we provide our clients with a foundation for growth in the areas of hospital planning, marketing, physician relations, and expansion.<br><br>We\\u2019re stronger because of customer-first culture and our inclusive work environment. We're a team of entrepreneurially-minded, self-motivated healthcare aficionados and technology geeks. Together, we solve complex problems, rethink conventional processes, and celebrate big wins.<br><br>We\\u2019re an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status. We believe our differences truly make us stronger.<br><br>Interested in joining a team of experts? We\\u2019re looking for passionate individuals interested in challenging the status quo of healthcare data and analytics. We\\u2019re open to your fresh thinking and creative ideas. If you think we might be the right mix of innovative thinking and tech nerd to fit your professional style, then shoot us your application today!<br><br>Everybody Makes the Coffee<br><br>We help where help is needed. Whether we\\u2019re asked to pitch in to support a customer, run a meeting at the last minute, or make the morning coffee, everybody does what\\u2019s necessary to keep the engine running. We don\\u2019t believe in \\u201cpulling rank.\\\"<br><br>Our Success is My Success<br><br>We support one another, strive for the success of our team, and recognize that nothing is done alone.<br><br>We'll Figure it Out<br><br>We may not immediately have the answer to a question, but we\\u2019re always committed to finding one. We believe most challenges are great opportunities to consciously show up, and with a resourceful attitude, brainstorm and consider the best course of action. Whatever comes our way, we won\\u2019t quit until we find a solution.<br><br>Honest Conversations Make Us Stronger<br><br>We approach conversations from a position of vulnerability. We assume others have positive intentions and strive to see their perspective before sharing our own. This combination allows us to create stronger, more collaborative relationships\\u2014which, ultimately, is how we grow.<br><br><strong> Assume Positive Intent <br><br></strong>We believe it\\u2019s important to start from the assumption that people are good and that the intent behind their actions are positive. We believe this builds stronger and more trusting relationships.<br><br><em>By submitting your interest in this job, you agree to receive text notifications with additional steps to complete your job application. You will receive up to 6 messages from the number \\\"63879\\\". Message &amp; data rates may apply. Please refer to our privacy policy for more information.</em>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Stratasan\", \"sameAs\": \"https://www.linkedin.com/company/stratasan\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQGqnsDRRFI3yw/company-logo_200_200/0/1519892284248?e=1642636800&v=beta&t=5l5VRe7QgM5FDgDUMqgTXu783U1g-n49Nmr1lNdSPRw\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Stratasan\", \"value\": \"amF6b2py\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQGqnsDRRFI3yw/company-logo_100_100/0/1519892284248?e=1642636800&v=beta&t=zvIhoIrLDr44Sw15d6IqBFoGxEky0P5NKRoJvTuWK4w\", \"industry\": \"Information Technology and Services,Computer Software,Hospital & Health Care\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Myrtle Point\", \"addressRegion\": \"OR\", \"postalCode\": \"97458\", \"streetAddress\": null}, \"latitude\": 43.06401, \"longitude\": -124.139145}, \"skills\": \"\", \"title\": \"Jr. Software Engineer\", \"validThrough\": \"2021-11-17T04:40:14.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 24}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}