{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-28T17:33:14.000Z\", \"description\": \"Janssen Biotherapeutics (JBIO) in Janssen Research &amp; Development, L.L.C., a division of Johnson &amp; Johnson's Family of Companies is recruiting a <strong>Data Modeling Scientist </strong>to focus on applying data science to support our locations in Spring House and Malvern, PA.<br><br>At the Janssen Pharmaceutical Companies of Johnson &amp; Johnson, we are working to create a world without disease. Transforming lives by finding new and better ways to prevent, intercept, treat and cure disease inspires us. We bring together the best minds and pursue the most promising science. We are Janssen. We collaborate with the world for the health of everyone in it. Learn more at www.janssen.com and follow us @JanssenGlobal. Janssen Research &amp; Development, LLC is part of the Janssen Pharmaceutical Companies.<br><br>Janssen Research &amp; Development, LLC discovers and develops creative large molecule solutions to address meaningful unmet medical needs in oncology, immunology, neuroscience, infectious diseases and vaccines, gene therapy and cardiovascular and metabolic diseases. You can be part of a premier organization, living our credo and helping patients every day.<br><br>The applicant should have a strong technical background engineering, biology or chemistry and experience in pharmaceutical research and development. The candidate should have a strong understanding of the theory and use of modeling to make decisions from model output and ability to train and support project teams. Skills include but not limited to use of predictive models AI/ML, MVA, Bayesian statistics, Digital Twins. They should have a proven record of working independently and leading focused teams to address sophisticated technical issues working at the intersection of drug development and data science. The candidate should have knowledge and experience working in a GxP environment. The individual should have strong oral and written communication skills and be proficient in making presentations to senior management and at company meetings. The candidate should also understand SDLC (Software Development Life Cycle) and use of agile software development tools.<br><br><strong>Primary Responsibilities<br></strong><ul> <li>Build novel models, algorithms, and user interface to enable scalable solutions delivering knowledge and optimized decision-making in R&amp;D.</li> <li>Working with scientists and engineers to define user requirements for data blocks and build data pipelines to assemble, clean, coordinate, integrate, visualize, and interpret data needs for modeling.</li> <li>Collaborate with data engineers and IT architects to build a modeling infrastructure that addresses Biotherapeutics scientific questions.</li> <li>Advise and influence project teams on data driven decision making including design of experiments, demonstrating historical knowledge.</li> <li>Develop in-process predictive modeling capabilities while ensuring standards for data and model quality, statistically appropriate decisions optimizing data to decision.</li> <br><br></ul><strong>Required<br><br></strong><strong>Qualifications<br></strong><ul> <li>B.S. with 7+ years of experience or M.S. 4+ years of experience or Ph.D. with 0-1 years of experience in Core science field, Bioinformatics, Engineering, or related field.</li> </ul><ul> <li>Proficient with one or more programming language such as .net, Java, Perl, C++, Matlab, Julia or Python is required.</li> <li>Skilled at wrangling and transforming high dimensional big data.</li> <li>Proficiency with statistics, algorithm design, and/or machine learning models.</li> <li>Current on knowledge of emerging trends in data science and drug development.</li> <li>Creative thinking, ability to generate new insights and concepts to drive data science in Biotherapeutics.</li> <li>Strong collaboration and communication skills.</li> <br><br></ul><strong>Preferred<br></strong><ul> <li>Experiences in Amazon Web Services (AWS), and/or full-stack development (Cloudera/Hadoop) and use of git, bitbucket and Jira.</li> <li>Knowledge of Biologic Process, Molecular Biology, Biochemistry, Chemistry.</li> <li>Working knowledge of SDLC as it relates to model verification and validation.</li> <li>Applied PAT and or in-line applications (Chemo-metrics, Raman spectroscopy).</li> <li>Working knowledge or experience with GxP and knowledge management.</li> <li>Ability to influence data driven culture, adapting positive change.</li> <br><br></ul>Johnson &amp; Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability.<br><br><strong>Primary Location<br></strong>United States-Pennsylvania-Spring House-Welsh &amp; McKean Roads<br><strong>Other Locations<br></strong>North America-United States-Pennsylvania-Malvern<br><strong>Organization<br></strong>Janssen Research &amp; Development, LLC (6084)<br><strong>Job Function<br></strong>R&amp;D<br><strong>Requisition ID<br></strong>2105917846W<br><br>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Johnson & Johnson\", \"sameAs\": \"https://www.linkedin.com/company/johnson-&-johnson\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQFwn8CHaum_AA/company-logo_200_200/0/1519856123566?e=1635984000&v=beta&t=12sjaNerRI7YC7248GIwuHHLhx47JkZkXgTObxscrII\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Johnson & Johnson\", \"value\": \"jnj-2105917846W-en-us-1\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQFwn8CHaum_AA/company-logo_100_100/0/1519856123566?e=1635984000&v=beta&t=dooLOYO8ox52nIDIL6Nk098S3ZfNf2etdaBXzif4Bj8\", \"industry\": \"Hospital & Health Care,Medical Devices,Pharmaceuticals\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Malvern\", \"addressRegion\": \"PA\", \"postalCode\": \"19355\", \"streetAddress\": null}, \"latitude\": 40.033436, \"longitude\": -75.51271}, \"skills\": \"\", \"title\": \"Data Modeling Scientist.\", \"validThrough\": \"2021-08-27T17:33:13.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 84}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}