{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-09-08T02:52:26.000Z\", \"description\": \"Does a career focused on changing the world's energy future intrigue you? If so, we might have just the opportunity you're looking for!<br><br>Idaho National Laboratory (INL) seeks a Chief Cybersecurity Research Scientist for the National &amp; Homeland Security (N&amp;HS) directorate. The primary role of the Chief Cybersecurity Scientist is to advance the scientific and engineering eminence and vitality of the INL, with specific emphasis on the N&amp;HS missions and Lab-wide infrastructure security initiatives.<br><br>This position works closely with leadership in cyber mission line organizations including the Cybercore Integration Center, which leads INL's effort to expand government, industry, and university partnerships for cybersecurity with its growing Research &amp; Education Campus. Optional Joint Appointment(s) for research or teaching are available with INL's many national and regional university partners.<br><br><strong><u>Responsibilities Include<br></u></strong><ul><li>Build and lead collaborative research teams to advance strategic national/international initiatives.</li><li>Development, chairing, and mentoring for leadership of national/international level conferences, symposia, and workshops on cutting-edge science and engineering to address national challenges.</li><li>Advancing scientific basis and technical outcomes for cyber-physical systems programs through personal and team publications, patents, presentations, and membership on national/international-level professional organizations, advisory panels, editorial boards, and standards committees.</li><li>Mentoring of junior staff, postdocs, and interns in the development of high quality research proposals, peer reviewed publications, presentations, and technologies.</li><li>Support the development of strategic vision that aligns research investments to national challenges that are relevant to N&amp;HS customer needs and condensed into actionable programmatic R&amp;D within the sponsor's perceived funding windows.</li><li>Advise and grow new research areas that complement cybersecurity missions, including wireless security, Artificial Intelligence / Machine Learning and the adversarial challenges with them.</li><li>Member of the directorate committee for the advancement of science and engineering within N&amp;HS, which includes all N&amp;HS fellows.</li><li>Lab Directed R&amp;D (LDRD) leadership and committee work as assigned.<br></li></ul>As the principal initial program leadership responsibility, this position will also provide thought leadership to the Cybersecurity Manufacturing Innovation Institute (CyManII) consortium. CyManII is developing a new Secure Manufacturing Architecture (SMA) and national innovation ecosystem to secure both automation and supply chain to achieve a digital transformation and energy efficiency in U.S manufacturing. CyManII is a national research consortium funded by DOE and led by University of Texas San Antonio (UTSA), with INL as a managing partner, and about 60 leading university and industry partners that collaborate on the creation and execution of a national R&amp;D roadmap to solve the fundamental challenges in cybersecurity for U.S. manufacturing.<br><br><strong><u>Minimum Requirements<br></u></strong><ul><li>Applicants must have a Ph.D. in Computer Science or closely related field plus 10 years work experience, with a strong commitment to research and education in cybersecurity. Research experience in operational technology (OT) systems and practical work experience outside of academia is required. National Laboratory, Department of Energy, or Department of Defense-related experience a plus.<br></li></ul><strong><u>Preferred Requirements<br></u></strong><ul><li>U.S. citizenship required. Able to obtain and maintain a DOE Q clearance, SCI, and special accesses as required.<br></li></ul><strong>Job Information<br></strong><ul><li>Salary Grade: 260</li><li>Chosen applicants are required a \\\"demonstrated commitment to valuing diversity and contributing to an inclusive working environment.\\u201d<br></li></ul><strong><u>INL Overview<br><br></u></strong>INL is a science-based, applied engineering national laboratory dedicated to supporting the U.S. Department of Energy\\u2019s mission in nuclear energy research, science, and national defense. With more than 5,000 scientists, researchers, and support staff, the laboratory works with national and international governments, universities and industry partners to discover new science and development technologies that underpin the nation\\u2019s nuclear and renewable energy, national security, and environmental missions.<br><br><strong><u>INL Mission<br><br></u></strong>Our mission is to discover, demonstrate and secure innovative nuclear energy solutions, other clean energy options and critical infrastructure.<br><br><strong><u>INL Vision<br><br></u></strong>Our vision is to change the world\\u2019s energy future and secure our nation\\u2019s critical infrastructure.<br><br><strong><u>Selective Service Requirements<br><br></u></strong>To be eligible for employment at INL males born after December 31, 1959 must have registered with the Selective Service System (SSS). For more information see www.sss.gov.<br><br><strong><u>Equal Employment Opportunity<br><br></u></strong>Idaho National Laboratory (INL) is an Equal Employment Opportunity (EEO) employer. It is the policy of INL to provide equal employment opportunities to all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information. Women and People of Color are strongly encouraged to apply.<br><br><strong><u>COVID Safety Protocols<br><br></u></strong>As a condition of employment, Idaho National Laboratory will inquire about COVID vaccination status and expects candidates to comply with all required COVID safety protocols, including mask-wearing as applicable. If safety protocols evolve to include mandatory vaccinations, Idaho National Laboratory will require compliance with such vaccine mandates subject to applicable protections under State and Federal Law.<br><br><strong><u>Reasonable Accommodation<br><br></u></strong>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.<br><br><strong><u>Other Information<br><br></u></strong>When applying to positions please provide a resume and answer all questions on the following screens. Applicants, who fail to provide a resume or answer the questions, may be deemed ineligible for consideration.<br><br><strong><u>Benefits &amp; Salary<br><br></u></strong>We have an extremely competitive salary structure, robust relocation package, and phenomenal benefits. For more information, please visit: https://www.inl.gov/careers/benefits-overview/. .<br><li><br></li><strong>Primary Location<br><br></strong>US-ID-Idaho Falls<br><br><strong>Other Locations<br><br></strong>United States<br><br><strong>Job<br><br></strong>Business Development<br><br><strong>Organization<br><br></strong>National &amp; Homeland Security (Dxxx)<br><br><strong>Schedule<br><br></strong>Full-time<br><br><strong>Employee Status<br><br></strong>Regular<br><br><strong>Job Posting<br><br></strong>Sep 7, 2021, 7:12:15 PM<br><br><strong>Unposting Date<br><br></strong>Sep 21, 2021, 11:59:00 PM\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Idaho National Laboratory\", \"sameAs\": \"https://www.linkedin.com/company/idaho-national-laboratory\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQFG7ZHiGjMMvQ/company-logo_200_200/0/1597968908123?e=1639008000&v=beta&t=sHytveCqEAc_kevm_5o4xuIC8elizEoRDXei0N3MliY\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Idaho National Laboratory\", \"value\": \"16656\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQFG7ZHiGjMMvQ/company-logo_100_100/0/1597968908123?e=1639008000&v=beta&t=HSE7nj8_fYZ_QqcAyGzyTSBRUr4rymva-NL32BwjpEo\", \"industry\": \"Information Technology and Services,Computer Software,Research\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Idaho Falls\", \"addressRegion\": \"ID\", \"postalCode\": \"83401\", \"streetAddress\": null}, \"latitude\": 43.491333, \"longitude\": -112.04027}, \"skills\": \"\", \"title\": \"Chief Cybersecurity Research Scientist\", \"validThrough\": \"2021-10-08T02:52:26.000Z\", \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 120}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}