{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services",
        "description": "<p>We're hiring for a fast growing, Series A start-up, who have spun-off from a top-tier U.S University. Their leading AI product, is transforming the lives of patients and physicians, by re-imagining medical workflows with voice and machine learning.</p><p><br></p><p>Their product prepares medical charts, by listening to patient encounters, saving up to 3 hours a day for doctors. They're looking for a Senior NLP engineer to improve current machine learning models, working with the largest datasets of physician-patient encounters. </p><p><br></p><p>Why not join a team of top-tier university alumni, working with state-of-the-art machine learning, whilst revolutionizing healthcare? </p><p><br></p><p>You will:</p><ul><li>Take ownership of the architecture of machine learning models</li><li>Build, iterate and deploy models </li><li>Work alongside leadership to define roadmaps, representing ML model architecture</li><li>Improve efficiency of the human-in-the-loop component </li><li>Work on a variety of NLP problems</li></ul><p><br></p><p>You have:</p><ul><li>Masters or above in Computer Science or related field  </li><li>Experience deploying machine learning models into production </li><li>An interest in healthcare</li><li>Experience working with natural language processing </li><li>Expertise with Python and deep learning frameworks</li><li>The ability to work in a fast paced environment </li></ul><p><br></p><p><em>Big Cloud is acting as a vendor to this position which is a direct hire.</em></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T12:43:25.000Z"
    },
    "company": {
        "name": "Big Cloud",
        "link": "https://uk.linkedin.com/company/big-cloud"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": "",
        "seniority_level": ""
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}