{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-29T06:13:36.000Z\", \"description\": \"At Starbucks, our mission is to inspire and nurture the human spirit - one person, one cup, and one neighborhood at a time. Starbucks Technologists work to achieve this mission using cutting-edge technology delivered to our partners, customers, stores, roasters, and global communities. This job contributes to Starbucks success by delivering high-quality, reliable, and stable technologies in support of the Starbucks Global Technology Platform. This position is accountable for problem identification and analysis, problem resolution, and system lifecycle management. In addition to providing first and second level support of a continuously operational production environment, the technologist in this role will create and implement automation to perform operations tasks, and to prevent and respond to incidents across teams. An effective DevOps Engineer will develop and share subject matter expertise and gain experience by partnering with senior system engineers outside their team.<br><br>Models and acts in accordance with Starbucks guiding principles<br><br><strong><u>Summary Of Key Responsibilities<br><br></u></strong>Responsibilities and essential job functions include but are not limited to the following<br><br><strong>Technical Design and Implementation<br></strong><ul> <li>With support from the application development team, develops software tools to solve technology operations problems. Ensures solutions are secure, durable, scalable, flexible, and accessible. Proactively mitigates against production support issues.</li> <li>Proposes opportunities for automation to prevent and respond to incidents, to improve security, to improve data integrity, and to help application owners successfully manage their environments. </li> <li>Learning to build incrementally, with an eye toward vision of the final product. Assists in prototypes with innovative ideas for complex problems. Provides transparency in approach and progress, throughout the process.</li> <li>Participates in requirements gathering, assists with systems approach, helps with project initiation, contributes to functional design, and delivers technical design and development.</li> <li>Automates test coverage per platform capabilities and requirements. Assists with manual system and integration testing efforts.</li> <li>Learns to operate effectively in both waterfall and Agile Software Development Lifecycle (SDLC) processes and methodologies.</li> <br></ul><strong>Production Support <br><br></strong><strong><u>Application And Platform Components<br></u></strong><ul> <li>Diagnoses, troubleshoots, and remediates incidents and problems to support the tools created and owned by the operations team. Participates in root cause analysis efforts to identify and implement solutions to operational issues.</li> <li>Maintains and reports operational Key Performance Indicators (KPIs) on items such as performance, service incidents and tickets set forth by the organization leadership.</li> <li>Creates and maintains documentation supporting training, system administration, deployment, and operational processes and procedures.</li> <br><br></ul><strong><u>Operations Support<br></u></strong><ul> <li>Participates in on-call rotation for 24x7 environment.</li> <li>Provides system support, working trouble tickets and escalating to teammates according to priority and required expertise queue, completing resolution within SLA. </li> <li>Assists in incident resolution leveraging pre-defined work instructions for issue remediation </li> <li>Investigates and provides root cause analysis for incidents </li> <li>Fulfills service requests and writes scripts automating the fulfillment of service requests </li> <li>Engages with vendors in support of incidents as needed</li> <li>Identifies operating system problems, takes corrective action, and refers problems or issues to second- or third- level support groups as required; uses established escalation procedures.</li> <li>Documents problems in the problem management system, extracts statistics on errors or problems, and prepares reports on trends. </li> <li>Represents department as a participant in application development, change management, production readiness reviews and other special projects as required. </li> <br></ul><strong>Leadership <br></strong><ul> <li>Shares knowledge freely, assisting teammates in learning coding, systems engineering, etc., helping to raise the overall skill level of the team</li> <li>Receptive and responsive to coaching and guidance from leaders and more experienced application development engineers from other teams. Seeks input and support as required. Begins working in an increasingly self-directed manner. </li> <li>Provides constructive input and perspective to team conversations. </li> <br></ul><strong>System Admin Specific Competencies for Role <br></strong><ul> <li>Install, configure, test and maintain operating systems, application software and system management tools </li> <li>Monitor and test application performance for potential bottlenecks, identify possible solutions, and assist application owners with implementing fixes </li> <li>Tier 1 and Tier 2 management and monitoring all installed systems and infrastructure pertinent to specified role (e.g., Physical Server, Virtual Servers, Storage, Firmware, Pre-Engineered Systems, OS, Monitoring/App Performance Software, Desktop Hardware/OS, general end user infrastructure front line support) </li> <li>Use console management, incident management, and job scheduler software applications. </li> <br><br></ul><strong><u>Basic Qualifications<br><br></u></strong><strong>Summary of Experience<br></strong><ul> <li>1+ years of professional industry experience with software development </li> <li>2+ years\\u2019 experience with systems administration across both Linux (or other Unix OS) and Windows Servers </li> <li>Bachelor\\u2019s degree in Computer Science or related field</li> <li>Experience automating tasks via Python or other scripting tools</li> <li>Experience creating and updating Slack apps / bots</li> <li>2+ years\\u2019 experience supporting servers on both physical hardware and VMware</li> <li>Ability to be on call periodically</li> <br><br></ul><strong><u>Preferred Qualifications<br><br></u></strong>Technical Proficiency<br><ul> <li>Knowledge of Continuous Integration / Continuous Deployment best practices</li> <li>Knowledge of data structures, algorithms, and computer science concepts relative to the platform.</li> <li>Proficiency in development languages, tools, frameworks, utilities, and technical dependencies.</li> <li>Ability to write and value high quality, reusable software with minimal defects. Ability to learn and incorporate new technologies, concepts, and development languages.</li> <li>Ability to absorb new concepts and technical implementation of application architecture, infrastructure, and security. </li> <br></ul>Interpersonal Skills<br><ul> <li>Excellent verbal and written communication skills</li> <li>Strong analytical and problem-solving skills</li> <li>Ability to balance multiple priorities and meet deadlines</li> <li>Ability to use business knowledge, sound judgment, and resourcefulness to proactively move efforts forward</li> <br><br></ul><em>Starbucks and its brands are an equal opportunity employer of all qualified individuals.<br><br></em><em><em>We are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply.<br><br></em><em>Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at 206-318-0660 or via email at applicantaccommodation@starbucks.com<br><br></em></em>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Starbucks\", \"sameAs\": \"https://www.linkedin.com/company/starbucks\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQEQxk9y2rk7Hw/company-logo_200_200/0/1519856020155?e=1635984000&v=beta&t=heTiN08RcWb1E8ZrOBuw_XJnh68kKWnnx5qjDVhCxYs\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Starbucks\", \"value\": \"210025840\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQEQxk9y2rk7Hw/company-logo_100_100/0/1519856020155?e=1635984000&v=beta&t=tGoHn-GrAAFd1X-c1-Np-gmDa56Ui-5ie3yS2lBfBP8\", \"industry\": \"Consumer Goods,Food & Beverages,Retail\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Seattle\", \"addressRegion\": \"WA\", \"postalCode\": \"98133\", \"streetAddress\": null}, \"latitude\": 47.60323, \"longitude\": -122.33028}, \"skills\": \"\", \"title\": \"DevOps Engineer\", \"validThrough\": \"2021-08-28T06:13:35.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 24}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}