{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-18T21:53:56.000Z\", \"description\": \"<strong><u>Who We Are<br><br></u></strong>Collaborative. Respectful. A place to dream and do. These are just a few words that describe what life is like at Toyota. As one of the world\\u2019s most admired brands, Toyota is growing and leading the future of mobility through innovative, high-quality solutions designed to enhance lives and delight those we serve. We\\u2019re looking for diverse, talented team members who want to Dream. Do. Grow. with us.<br><br><strong><u>Who We\\u2019re Looking For<br><br></u></strong>Toyota is looking for a smart, passionate leader to join our Public Cloud team with a keen sense of ownership and a strong engineering mindset. As a Staff Engineer in the Public Cloud Platform team, you will be closely aligned with engineers on the Toyota R&amp;D team and responsible for defining cloud-native infrastructure architecture using Private, Public, and Hybrid Cloud platforms and principles. The ideal candidate will have a strong understanding of large-scale distributed architecture solutions, development and automation forward mindset to problem-solving, and experience leading software and infrastructure discussions to ensure scalability, resiliency, and availability. Success in this role is measured by the overall performance, reliability, security, and scalability of an application and overall cost savings for the business. This position requires deep customer-focused thinking, the ability to be hands-on and to make faster decisions. We are looking for self-motivated individuals who are highly detail-oriented and take pride in their deliverables.<br><br><strong><u>What You\\u2019ll Be Doing<br></u></strong><ul><li> Lead infrastructure delivery to build petabyte-scale distributed infrastructure for servicing Toyota R&amp;D projects with intensive cloud computing requirements.</li><li> Interact with Woven Planet core team and replicate engineering practices at TMNA.</li><li> Collaborate with the Public Cloud Platform team to design and code cloud and application Blueprints for HPC applications.</li><li> Understand the interaction between Public Cloud services and those owned by R&amp;D (Production Engineering and Autonomous Vehicles) teams to effectively design systems which, leverage the strengths and mitigate the challenges posed by such interactions.</li><li> Interact with Sr. Managers and Portfolio leaders to reduce costs and technology debt for cloud applications.</li><li> Responsible for Public Cloud Technical Change management for the TMNA R&amp;D teams.</li><li> Design architectures intended for the long term while acknowledging near-term requirements using Azure and AWS Well-Architected framework.</li><li> Collaborate with cross-functional team members from Cloud, Product, and Engineering to deliver against quarterly and annual cloud migration objectives.</li><li> Lead, mentor, pair with software engineers of diverse backgrounds to write clean and iterative code based on TDD.</li><li> Engage in code and architecture reviews helping maintain our coding standards and provide cost optimization guidance.</li><li> Lead architecture meetings and technical discussions with the focus of reaching consensus and best practice solutions.</li><li> Lead the team in defining technical requirements and solutions and drive projects through to completion.</li><li> Break down tasks for other engineers and offer guidance to other engineers on the team when they are blocked.</li><li> Create engaging technical content, including writing internal company blog posts, white papers, practical guides, and platform demos.</li><li> Stay current with industry trends and recommend relevant technologies and products in the areas of Private, Public, and Hybrid Clouds.</li><li> Nurture a culture of ownership, learning, automation, re-use, and engineering efficiency using software design patterns and industry best practices.</li><li> Be a leader, evangelist within your team and the organization.<br></li></ul><strong><u>What You Bring<br></u></strong><ul><li> A bachelor\\u2019s degree in Computer Science or related discipline, or equivalent work experience.</li><li> Progressive experience in application development and engineering experience; demonstrable technical leadership experience in new platform development, product ownership, and iterative design.</li><li> Extensive experience leveraging AWS/Azure/GCP Platform to deploy highly reliable and scalable cloud applications.</li><li> Demonstrated work experience in Cloud Cost optimization using Architecture changes and efficient coding practices.</li><li> Demonstrated ability in building cloud-native and 12-factor full-stack applications using modern technologies such as Java, Typescript, Golang, etc.</li><li> Expert level knowledge of system design; high-performance computing; file, block, and storage technologies; integration of computing, storage, and network technologies to deliver cohesive infrastructure solutions.</li><li> Thorough understanding of building cloud-native infrastructure using evolutionary architecture practices.</li><li> Demonstrated work experience in writing functional and maintainable code.</li><li> Thorough understanding of DevOps principles and DevOps toolchains (Jenkins, shell scripting, GNU Make, Terraform, Packer, Ansible, Docker).</li><li> Expert at working with service-based application architectures and familiar with various API protocols (e.g., GraphQL, gRPC).</li><li> Motivated and Self-Starting: able to think critically about problems, decipher user preferences versus hard requirements, and effectively use online and onsite resources to find an appropriate solution with little intervention.</li><li> Demonstrated experience in research data collection, analysis, and presentation.<br></li></ul><strong>Added Bonus If You Have <br></strong><ul><li> GitHub presence with contribution and/or collaboration with open-source communities.</li><li> Diverse knowledge of other programming languages and frameworks.</li><li> Experience working in large, multi-faceted, and matrixed organizations.</li><li> Experience in the automotive industry.<br></li></ul><strong><u>What We\\u2019ll Bring<br><br></u></strong>During your interview process, our team can fill you in on all the details of our industry-leading benefits and career development opportunities. A few highlights include:<br><ul><li> A work environment built on teamwork, flexibility, and respect.</li><li> Professional growth and development programs to help advance your career, as well as tuition reimbursement.</li><li> Vehicle purchase &amp; lease programs.</li><li> Comprehensive health care and wellness plans for your entire family.</li><li> Flextime and virtual work options (if applicable).</li><li> Toyota 401(k) Savings Plan featuring a company match, as well as an annual retirement contribution from Toyota regardless of whether you contribute.</li><li> Paid holidays and paid time off.</li><li> Referral services related to prenatal services, adoption, childcare, schools, and more.</li><li> Flexible spending accounts.</li><li> Relocation assistance (if applicable).<br></li></ul><strong>Belonging at Toyota<br><br></strong>Our success begins and ends with our people. We embrace diverse perspectives and value unique human experiences. Respect for all is our North Star. Toyota is proud to have 10+ different Business Partnering Groups across 100 different North American chapter locations that support team members\\u2019 efforts to dream, do and grow without questioning that they belong. As a company that has been one of DiversityInc\\u2019s Top 50 Companies for Diversity and a member of The Billion Dollar Roundtable supporting minority and woman-owned suppliers for over 10 years, we are proud to be an equal opportunity employer that celebrates the diversity of the communities where we live and do business.<br><br>Applicants for our positions are considered without regard to race, ethnicity, national origin, sex, sexual orientation, gender identity or expression, age, disability, religion, military or veteran status, or any other characteristics.<br><br>Have a question or need assistance with your application? Check out the How to Apply section of our careers page on Toyota.com.<br><br>To save time applying, Toyota does not offer sponsorship of job applicants for employment-based visas or any other work authorization for this position at this time.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Toyota North America\", \"sameAs\": \"https://www.linkedin.com/company/toyota-north-america\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQFnFvbjs_Nuag/company-logo_200_200/0/1519856406639?e=1637193600&v=beta&t=U0800HpYk_UtPj9BomC9di1Y2JuIJwgf-8kLpTKoqfM\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Toyota North America\", \"value\": \"TMN002VS\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQFnFvbjs_Nuag/company-logo_100_100/0/1519856406639?e=1637193600&v=beta&t=_pVk-IJZPElbShuM-zTkSb7O5AeoONv-MQjyEPRxWFA\", \"industry\": \"Automotive,Electrical/Electronic Manufacturing,Mechanical or Industrial Engineering\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Dallas\", \"addressRegion\": \"TX\", \"postalCode\": \"75342\", \"streetAddress\": null}, \"latitude\": 32.777977, \"longitude\": -96.79621}, \"skills\": \"\", \"title\": \"Staff Software Engineer\", \"validThrough\": \"2021-09-17T21:53:55.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}