{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-06T16:46:50.000Z\", \"description\": \"<p><strong>**REMOTE OPPORTUNITY - U.S. ONLY**</strong></p><p><br></p><p><strong>About Wellory: Diets don't work, experts do.</strong></p><p>\\ud83d\\udcf2 Wellory delivers 1-1 personalized nutrition coaching to help you build healthier habits and reach your goals for good. Think of us like a therapist for your relationship with food.</p><p><br></p><p>We\\u2019re on a mission to make personalized nutrition accessible for all\\u2014and we won't stop until we make an insane impact (like drastically reducing the number of people who get sick every year from diet-related disease). We're grateful to be on this journey with some of the world's best investors including Story Ventures, Harlem Capital, Co-Founders of Tinder, NBA Player Wayne Ellington, Wellness guru Hannah Bronfman, leaders from Glossier, Google, Amazon, amongst others (learn more here).</p><p><br></p><p>\\ud83c\\udf1f We're a remote team with a concentration in New York and San Francisco. While we may be distant, we're all brand-obsessed and looking for the next go-getter to join our family. If you have what it takes to build the next biggest consumer tech company (think world domination while wearing head-to-toe Wellory gear), we'd love to meet you!</p><p><br></p><p><strong>What We're Looking For</strong></p><p>\\ud83d\\udc4b Wellory is seeking an ambitious, passion-driven, self-motivated Software Engineer to join as the first in-house hire on our growing engineer team. You'll collaborate with engineers, designers, and product to deliver value to Wellory's growing user base of clients and nutrition coaches. You must be comfortable in a fast-paced, agile environment (like, really fast) and able to wear both strategy and execution hats.</p><p><br></p><p><strong>What your responsibilities will be \\u2705</strong></p><ul><li>Full-stack development with a focus on back-end</li><li>Write understandable, testable code with a focus on maintainability and scalability</li><li>Collaborate with a remote development team, review code, test features, and champion bug-free releases</li><li>Have control over infrastructure, core emphasis on CI and data integrity and general sense of ownership on tech</li><li>Promote constant refactoring while developing features or touching existing code to keep the codebase as clean as possible</li><li>Promote iterative development, using best practices such as feature toggles, test automation, and monitoring in order to ensure confidence in our release process</li><li>Active engagement in technical discussions during architecture meetings, code reviews, and product/design meetings to help promote a culture of learning and continuous improvement</li><li>Ability to identify trade-offs, challenge ideas, over-communicate and effectively collaborate with teammates</li><li>Become a domain expert, working closely with our product team and stakeholders</li><li>Help scale and monitor our services (AWS)</li></ul><p><br></p><p><strong>Who we're looking for \\ud83e\\udd84</strong></p><ul><li>3-5 years of software development experience</li><li>Must have experience working with a remote development team</li><li>Experience with Nodejs, MongoDB, and AWS</li><li>Experience with at least 2 of the following languages/frameworks: Typescript, React, Angular, Swift, and/or Kotlin</li><li>Passion for technology, innovation, continued learning, and above all, driving value for our end users</li><li>Strong understanding of agile, lean and DevOps principles</li><li>Strong understanding of testing and ability to bring ideas to improve QA standards</li><li>Comfortable working in high growth, fast-paced environments, and can easily adapt to change</li><li>Strong understanding of industry best practices and standards</li><li>Comfortable working with an offshore team, communicating and collaborating across timezones</li><li>Incredible attention to detail and dedication to quality</li><li><strong><em>Bonus</em></strong>: Experience with python, data pipelines, ML technologies or processing data into a form suitable for analysis and reporting</li><li><strong><em>Pro tip</em></strong>: you've done your research on Wellory before your first interview!</li></ul><p><br></p><p><strong>Why you might be excited about us \\ud83d\\udd7a</strong></p><ul><li>We're <em>really</em> changing people's lives and helping them live healthier, happier, longer. We're doing important work that helps people create behavior change \\u2014 and that excites you daily.</li><li>You're hungry to make REAL impact every single day \\u2014 you're motivated by progress and know that the work you do will move the needle.</li><li>You're excited to be one of the first ten employees of a startup \\u2014 you see the path forward and you're eager to be a part of the journey.</li><li>You are a team-player who is able to thrive in ambiguity. You love tackling new projects and building the playbook from scratch. This is not the kind of job where you show up and we tell you exactly what to do every day (micromanagement makes you cringe).</li></ul><p><br></p><p><strong>Why you might <em>not</em> be excited about us \\ud83d\\udc40</strong></p><ul><li>We're a lean, mean fighting machine (under 10 employees). If you like a more established company setting, this role isn't for you.</li><li>We're a remote-first company, and therefore fantastic communication skills (verbal and written) is vital. If you don't like to over-communicate, you won't be happy here.</li><li>We're an early-stage startup. Projects and priorities are likely to shift. If you're not keen on flexibility and a \\\"learn while we go\\\" mentality, you may get frustrated easily.</li><li>Everyone on the team is extremely mission-driven, and works incredibly hard to push towards our lofty vision. If you prefer a 9-5 job or to rest-and-vest, this job isn't for you.</li><li>As the very first in-house engineer, you'll be an owner and an operator. If that doesn't excite you, then we're not a good match.</li><li>We deeply believe teamwork makes the dream work. If you're not willing to lend a hand wherever it's needed (and sometimes that means it may be outside of your job description), you won't fit in.</li></ul><p><br></p><p><strong>Life as a Weep \\ud83d\\ude00</strong></p><ul><li><em>All Wellory team members are referred to as \\\"Weeps\\\"</em></li><li>WFH Office set up \\u2615 \\u2014 you'll get a new computer + equipment to work comfortably while remote</li><li>Full health insurance coverage, including dental and vision</li><li>Unlimited vaca \\u2014 we mean it \\ud83d\\udc83\\ud83d\\udc83\\ud83d\\udc83</li><li>Monthly team events \\u2014 we're a team that loves to celebrate and spend quality time together. While we may be remote, we plan monthly fun, zoom-style happy hours, team bonding events, virtual comedy shows +more!</li></ul><p><br></p><p><strong>The interview process \\ud83d\\udc4b\\ud83c\\udffd\\ud83d\\udc4b\\ud83d\\udc4b\\ud83c\\udfff</strong></p><p>We'll do our best to respond to all applications as quickly as possible.</p><ol><li><strong>First Call -</strong> If it's a match, we'll invite you to chat with our CEO + Founder, Emily, on a 1-hour call to learn more about the company and so we can learn more about you!</li><li><strong>Second Call</strong> - If we all get along, you'll move to a second call with our CPO + Co-Founder Jeni, to dive into the role and learn more about our products and tech team.</li><li><strong>Take-home Assessment -</strong> Next, you\\u2019ll be given a take-home assignment to help us understand how you think, work, and communicate. We value hard work first and foremost!</li><li><strong>Meet Our Advisor</strong> - Then you'll chat with our technical advisor Jason to dive into technical experience and development at Wellory.</li><li><strong>Final Chat -</strong> You'll have one final interview with Jeni to recap learnings and answer any outstanding questions.</li><li><strong>References</strong> - Last step, we'll reach out to people who you've worked with and hear what it's like working alongside you!</li></ol>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Wellory\", \"sameAs\": \"https://www.linkedin.com/company/wellory\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQFXnx4uwy_sZw/company-logo_200_200/0/1594901169759?e=1636588800&v=beta&t=KnkZUA5reIrAhlcmXbgEqeWLWyCWw_5IDVXMY1idou4\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Wellory\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQFXnx4uwy_sZw/company-logo_100_100/0/1594901169759?e=1636588800&v=beta&t=hksZjiJLXAdhVT-W4U_HgDXkhTWmb3ntFxKqzKAM3JU\", \"industry\": \"\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"New York City Metropolitan Area\", \"addressRegion\": null, \"postalCode\": \"10021\", \"streetAddress\": null}, \"latitude\": 40.748295, \"longitude\": -73.98556}, \"skills\": \"\", \"title\": \"Software Engineer\", \"validThrough\": \"2022-02-02T16:46:50.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 36}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}