{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-25T17:27:41.000Z\", \"description\": \"<p>Securonix provides the Next Generation Security and Information Event Management (SIEM) solution. As a recognized leader in the SIEM industry, Securonix helps&nbsp;some of the largest&nbsp;global organizations detect sophisticated cyberattacks and&nbsp;rapidly respond to these attacks within minutes. With the Securonix SNYPR platform, organizations can collect billions of events each day and analyze them in near real-time to detect advanced persistent threats (APTs), insider threats, privilege account misuses and online fraud.&nbsp;Securonix pioneered the User and Entity Behavior Analytics (UEBA) market and holds patents in the use of behavioral algorithms to detect malicious activities. The Securonix SNYPR platform is built on big data&nbsp;Hadoop technologies and is infinitely scalable.</p><p>Summary:</p><p>Become a Technical Delivery Manager for one of the fastest growing security companies in the world.&nbsp;Join us and collaborate on delivering cutting-edge technology to combat cyber threats. Become part of a truly innovative enterprise that has pioneered the use of machine learning algorithms to detect advanced threats. Work with a talented team that is passionate about creating the latest threat detection and monitoring techniques using leading cloud technologies.</p><p>&nbsp;</p><p>What you can expect:</p><ul><li>Securonix is a fast-paced, highly matrixed organization that requires cross-functional collaboration for success. Work with highly intelligent, passionate resources in the Addison TX, NJ, and CA offices as well as Europe and Asia.</li><li>Help us build a new support &amp; operations team that knows how to have fun while working hard.</li><li>Learning opportunities are available to employees who wish to grow with Securonix and develop their career.</li><li>A culture built around providing a quality customer care experience.</li><li>A no-fault environment focused on continuous improvement.</li></ul><p>&nbsp;</p><p>What you\\u2019ll do:</p><p>Manage a Level 2 / Level 3 Cloud Support Engineer (CSEs) team as a key member of the Securonix technical leadership team. Solve our most complex issues and focus on improving our key product services. Contribute daily in multiple ways: SRE, project manager, people-manager, problem solver, service owner, etc. Serve as a point of escalation for executive leadership, operations shift leads, customers, and Customer Success team members.</p><ul><li>Be a hands-on leader of a team of CSEs working 24/7 to resolve complex customer issues and improve our service &amp; products.</li><li>Collaborate with other Technical Delivery Managers to ensure consistency in processes and methods across the various engineering teams.</li><li>Collaborate with Operational Improvements Manager and other Technical Delivery Managers to assess, improve, and enforce IT Service Management processes aligned with ITSM / ITIL Best Practices. Participate in analyzing, designing, documenting, and implementing new + improved processes to maintain or improve operational efficiency and workflow effectiveness. Train and guide the team on process improvements.</li><li>Accountable for ensuring customer issues are completed within SLAs.</li><li>Manage escalation of critical customer issues.</li><li>Work closely with customers and internal teams to ensure our platforms operate as expected.</li><li>Communicate status and action plans to internal stakeholders, partners, and customers including \\u2018C\\u2019 level executives.</li><li>Help identify and develop talent within your assigned team. Participate in personnel hiring, performance improvement, and termination.</li><li>Provides analysis related to the design, development, and integration of hardware, software, man-machine interfaces and all system level requirements to provide an integrated IT solution.</li><li>Performs analysis, design, and development of services and infrastructure.</li><li>Conducts troubleshooting of mission-critical system issues.</li><li>Monitor change management and analyze global process adoption trends. Responsible for managing and approving Change Requests received from stakeholders.</li><li>Determine critical root cause analysis to drive strategic change to improve the current process environment.&nbsp;Own the Problem Management tasks that are identified by the RCA efforts.</li><li>Conduct Operations Maintenance and configuration management for all services tools.</li><li>Reduce costs and improve customer time to value</li><li>Forecast resource requirements that includes human, infrastructure, essential to successfully deliver a project or service</li><li>Responsible for building the project communication plan, effectively communicate with key stakeholders on the project progress, issues and deliverables.</li><li>Will be responsible for ensuring the quality of the deliverables as per the quality management plan</li><li>Work cross-functionally to resolve issues and implement changes</li></ul><p>&nbsp;</p><p>What you bring:</p><p>Technical skills</p><ul><li>7-10 years of end-to-end Global Project Management experience in delivering large and complex IT software and infrastructure projects.</li><li>5+ years\\u2019 experience providing product support or operations of a SaaS platform.</li><li>5+ years\\u2019 experience in a customer-facing role.</li><li>Experience with one of our competitors: Splunk, Exabeam, Rapid7 or LogRythm.</li><li>Hands-on experience on SIEM design, sizing, implementation, and maintenance.</li><li>Hands-on experience on AWS EC2, elastic load balancers, S3, CloudWatch, Lambda, EBS volumes, Snapshots, Route 53, SNS notifications, SQS queues.</li><li>Experience on Visualizations tools such as Splunk Search, Elastic Search, Grafana.</li><li>Experience on scripting languages such as Perl and python.</li><li>Experience with SaaS, PaaS, IaaS, and cloud infrastructure.</li><li>Experience with Linux, AWS, Hadoop and MySQL.</li><li>High-level knowledge of Gainsight, Salesforce.com, Jira, Confluence or similar software systems</li><li>Bachelor's degree in Computer Science, Information Systems, and/or related experience.</li></ul><p>Leadership Skills</p><ul><li>Experience managing 24*7 operations for customers.</li><li>Must be a self-starter, highly motivated with positive attitude and should be able to work across global time zones.</li><li>A willingness to demonstrate ownership of problems.&nbsp;And mistakes.</li><li>A desire to collaborate with others \\u2013 both on your team as well as other teams.</li><li>The ability to aggressively drive solutions to problems while maintaining a collaborative approach.</li><li>A desire to be responsible for the work effort of others. Experience directing the efforts of others as either a senior resource, team lead or supervisor/manager, or demonstrated readiness to assume this responsibility.</li><li>Experience interviewing and making hiring recommendations; supervising the performance of others; identifying and directing performance improvement efforts.</li></ul><p>Other Skills</p><ul><li>Experience with ITIL or other industry-recognized Service Management discipline.&nbsp;Demonstrated understanding of Problem Management, Change Management, and Incident Management disciplines.</li><li>A strong focus on balancing customer\\u2019s needs with adherence to operational processes.</li><li>A history of developing new processes, recommending improvements to existing processes, and driving yourself and others to follow defined processes to ensure quality outcomes.</li><li>Understanding of the business impact of operations issues and the ability to identify, create and execute a remediation plan.</li><li>Strong verbal and written communication skills in English; demonstrated ability to communicate status and action plans to internal stakeholders, partners, and customers.</li><li>Strong analytical and technical problem-solving skills.</li><li>Ability to grasp technical concepts quickly and explain them to others.</li><li>Self-starter, multitasking, independent, responsible.</li><li>Good interpersonal communication with other team members.</li><li>Strong initiative and teamwork.</li><li>Proven work experience as a Process Engineer, Process Designer, Business Operations or Customer Success Operations leader</li><li>Exceptional verbal, written, and interpersonal skills.</li><li>Analytical thinker and able to manage multiple projects at one time</li></ul><p>Nice to Have:</p><ul><li>ITIL Foundations certification.</li></ul><p>Securonix, Inc. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, genetic information, marital status, amnesty or status as a covered veteran in accordance with applicable federal, state and local laws. Securonix complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</p><p><br></p><p>Securonix expressly prohibits any form of unlawful employee harassment based on race, color, religion, gender, sexual orientation, national origin, age, genetic information, disability or veteran status. Improper interference with the ability of Securonix employees to perform their expected job duties is absolutely not tolerated.</p>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Securonix\", \"sameAs\": \"https://www.linkedin.com/company/securonix\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQFZVTFfpVf8rQ/company-logo_200_200/0/1625150937175?e=1637798400&v=beta&t=LADLUwb3y2PC7_4gAiug-s9zsDsaq8rBtK1Qvxb9lKM\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Securonix\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQFZVTFfpVf8rQ/company-logo_100_100/0/1625150937175?e=1637798400&v=beta&t=DJPV4UQ_fQqjH053xWdJWGtK5-sRgjtZ0ZrKdz2W0fc\", \"industry\": \"Computer Software\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"United States\", \"addressRegion\": null, \"postalCode\": \"99999\", \"streetAddress\": null}, \"latitude\": 39.50355, \"longitude\": -99.0183}, \"skills\": \"\", \"title\": \"Technical Service Delivery Manager\", \"validThrough\": \"2021-09-24T17:27:40.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 84}, \"jobLocationType\": \"TELECOMMUTE\", \"applicantLocationRequirements\": {\"@type\": \"Country\", \"name\": \"United States\"}, \"baseSalary\": {\"@type\": \"MonetaryAmount\", \"currency\": \"USD\", \"value\": {\"@type\": \"QuantitativeValue\", \"minValue\": 130000, \"maxValue\": 143000, \"unitText\": \"YEAR\"}}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}