{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-02T21:48:28.000Z\", \"description\": \"<p>** WARNING: Typical of a Silicon Valley startup, we are not for the faint of heart, who are not in a position to take risk. Think thrice before applying. A walk on the beach may help **</p><p><br></p><p>Robometrics\\u00ae Machines (a Skive it\\u00ae company)&nbsp;in San Francisco and London is building machines that can feel, now looking for engineering and research super stars. Skive it\\u00ae is fortunate to have an exceptional team with professional and academic experience in embedded systems, AI and mission critical software-hardware integrated systems from Oracle, Nike, MIT, Brown, IIT, and CMU.</p><p><br></p><p>Details</p><ul><li>Software and/or hardware engineers and research scientists with focus on AI in aerospace and healthcare verticals. We are also open to exceptional interns. Reach out (jobs@skive.it)</li><li>Full-time.&nbsp;</li><li>You should only apply if you can start in the next few days if selected - a month for us is the same as a year in other companies.&nbsp;</li><li>This is *not* your typical 9-5pm job.&nbsp;</li><li>We value 996 work culture, aim for perfection, chase 10X and not 10%, win as a team and extreme ownership.&nbsp;</li></ul><p><br></p><p>Qualifications</p><ul><li>Minimum bachelor's degree or equivalent experience in Computer Science or related field. MS is strongly preferred for engineering focus roles. PhD is required for the research scientist role.</li><li>Development experience with programming languages.&nbsp;</li><li>Experience in configuring, monitoring and troubleshooting systems.</li><li>Strong scripting and technical skills.</li><li>Passion for AI and related areas.</li><li>Prior professional experience is highly desirable, especially in the area of AI, healthcare or aerospace.&nbsp;</li></ul><p><br></p><p>Details on who we hire and what to expect. https://www.linkedin.com/pulse/we-hiring-aditya-mohan/</p><p><br></p><p>Questions?&nbsp;jobs@skive.it&nbsp;</p><p><br></p><p>The Culture</p><p><br></p><p>\\\"The only way to do great work is to love what you do\\\" \\u2014 Steve Jobs&nbsp;</p><p><br></p><p>Robometrics\\u00ae Machines is getting humanity back into AI, making machines more humans and hoping to make humans less like machines.&nbsp;We like people who are crazy enough to think differently; the round pegs in the square holes... the ones who see things differently. Who consider themselves as being super cool and don't mind being seen as the crazy ones.&nbsp;A passion to create innovative products is an absolute must.&nbsp;</p><p><br></p><p>Work culture include:&nbsp;</p><ul><li>It is OK to be 25% wrong and take risks. Learn by failing 1 out of 4 times [only].&nbsp;</li><li>Aim for perfection - All or Nothing</li><li>Chase 10X and not 10%</li><li>Just do it - As one of our founders who worked at MIT Media Labs says \\u201cDeploy!\\u201d. Write instead of just talk, build, prototype and deploy instead of just write.&nbsp;</li><li>Win as a team&nbsp;</li><li>Extreme ownership&nbsp;</li></ul><p><br></p><p>Robometrics\\u00ae Machines (a Skive it\\u00ae company) expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Skive it\\u00ae is an equal opportunity employer.</p><p><br></p><p>The&nbsp;Benefits&nbsp;</p><ul><li>An early spot at a fast-growing company that is changing the future of AI and autonomous machines.&nbsp;</li><li>Opportunity to work in a product focused environment to create the world\\u2019s first machines that can feel.&nbsp;</li><li>A huge level up in your experience. We\\u2019ll make sure you see a lot of growth in your skill set that helps you to accelerate your career.&nbsp;</li><li>Being part of a small startup team, an opportunity to work across multiple parts of the value chain in an industry starting with Aerospace, autonomous cars and healthcare.&nbsp;</li><li>Opportunity to work with and connect with Skive it\\u00ae founders, executive team and advisory board that are industry visionaries and thought leaders.&nbsp;</li><li>Compensation, benefits, equity, and salary that are above industry average once the current funding round closes. Compensations mentioned on this post are future estimates.</li><li>Currently, 100% remote work that will ensure that you can maintain work-life balance even when working long hours (Yes, we do believe in \\u2018996\\u2019 work culture)</li><li>Participate in the annual team retreat. Once a year the entire Skive it\\u00ae team gets together at an inspiring location to meet, work and play hard.</li><li>Unlimited Vacation.&nbsp;</li></ul><p><br></p><p>We are focused on building a diverse and inclusive workforce. If you\\u2019re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.</p><p><br></p><p>We thank all applicants for their interest!</p>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Robometrics\\u00ae Machines\", \"sameAs\": \"https://uk.linkedin.com/company/robometrics-machines\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQFh8ee5TSUi7g/company-logo_200_200/0/1592521209733?e=1635984000&v=beta&t=P_QxFzNByWCU1Eyv9VnEmbeyjyMa1hc_30XcYkICCPA\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Robometrics\\u00ae Machines\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQFh8ee5TSUi7g/company-logo_100_100/0/1592521209733?e=1635984000&v=beta&t=HLxd-whWdxQbIC8Gd97zVsfrF8v09dH8K7g0RvBFSzM\", \"industry\": \"\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"San Francisco\", \"addressRegion\": \"CA\", \"postalCode\": \"94121\", \"streetAddress\": null}, \"latitude\": 37.78008, \"longitude\": -122.42016}, \"skills\": \"\", \"title\": \"Software Engineer\", \"validThrough\": \"2021-09-01T21:48:28.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"jobLocationType\": \"TELECOMMUTE\", \"applicantLocationRequirements\": {\"@type\": \"Country\", \"name\": \"United States\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}