{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-09-02T06:08:39.000Z\", \"description\": \"Purpose of Job<br><br>We are currently seeking talented Java Software Engineers\\u2013 Jr. Level for our Phoenix, AZ location, for teams inside our Chief Administrative Office group.<br><br>USAA Java Software Engineers create and maintain APIs for our business software applications that our members use. Done well, many may never realize or appreciate how critical these APIs are or how we've made them simpler. Faster. Safer. Yet they help make our members' lives better. It's a great challenge and responsibility.<br><br>Here, you will invent. You'll design and test. You'll take risks. You'll create new technology, but the impact you'll make on our members will be far more significant.<br><br>Job Requirements<br><br>As a Java Engineer, you are expected to be able to function in a fast-paced environment driving innovation through rapid prototyping and iterative development ensuring quality is built into all solutions leveraging TDD. Your responsibilities will require you to be knowledgeable in API development. You will be a part of teams of developers guiding on engineering and architecture best practices as well as demonstrate the ability to partner and engage with other engineers and architects. You will work closely with business clients and UI designers to analyze user requirements, code applications and customize and/or integrate commercial software packages for both internal employees and external member-facing applications across multiple platforms.<br><br>As a Java Engineer, it will be your responsibility to maintain code integrity and quality.<br><br><strong><u>About USAA<br><br></u></strong>USAA knows what it means to serve. We facilitate the financial security of millions of U.S. military members and their families. This singular mission requires a dedication to innovative thinking at every level.<br><br>USAA Careers \\u2013 World Class Benefits (31 seconds)<br><br><strong><u>Primary Responsibilities<br></u></strong><ul><li>With limited guidance performs defect correction (analysis, design, code) on less complex issues and/or codes applications of medium complexity.</li><li>With guidance begins to install, customize and integrate commercial software packages.</li><li>Works with more tenured peers to gain understanding of systems while conducting root cause analysis of issues, reviewing new and existing code and/or performing unit testing.</li><li>Works with experienced team members to conduct root cause analysis of issues, review new and existing code and/or perform unit testing.</li><li>Learns to create system documentation/play books and attends requirements, design and code reviews.</li><li>Receives work packages from manager and/or delegates.</li><li>Understands and assists in gathering and analyzing customer requirements and may respond to outages following the appropriate processes.</li><li>Partners with experienced team members to develop accurate estimates on work packages. May begin to identify issues that impact availability<br></li></ul><strong><u>Minimum Requirements<br></u></strong><ul><li>Bachelor's degree in related field of study OR Certification from an approved technical field of study OR 4 additional years of I/T experience beyond the minimum required in lieu of a degree. </li><li>AND, 2+ years of software engineering/development experience utilizing Java with experience working with RESTful Web Service.<br></li></ul><strong><u>Preferred Experience<br></u></strong><ul><li>2+ years in REST frameworks with focus on API development</li><li>1+ years in AGILE methodology</li><li>1+ years experience working with JavaScript</li><li>1+ years experience integrating with backend services like JMS, J2C, ORM frameworks (Hibernate, JPA, JDO, etc), JDBC.</li><li>Ability to implement container based APIs using a container frameworks OpenShift, Docker, or Kubernetes.</li><li>Relational Database design and optimization with Oracle DB2, MySQL, Postgress</li><li>Familiar with Gradle, GIT, GitHUB, GITLab, etc. around continuous integration and continuous delivery infrastructure</li><li>Experience testing in REST services</li><li>Experience in design and develop automated test framework<br></li></ul>The above description reflects the details considered necessary to describe the principal functions of the job and should not be construed as a detailed description of all the work requirements that may be performed in the job.<br><br><strong>Compensation: </strong>USAA has an effective process for assessing market data and establishing ranges to ensure we remain competitive. You are paid within the salary range based on your experience and market position. The salary range for this position is: $66,300.00 - $119,500.00 *( this does not include geographic differential it may be applied based on your work location)<br><br>Employees may be eligible for pay incentives based on overall corporate and individual performance or at the discretion of the USAA Board of Directors.<br><ul><li>Geographical Differential: Geographic pay differential is additional pay provided to eligible employees working in locations where market pay levels are above the national average.<br></li></ul><strong>Shift premium:</strong> will be addressed on an individual-basis for applicable roles that are consistently scheduled for non-core hours.<br><br><strong>Benefits: </strong>At USAA our employees enjoy best-in-class benefits to support their physical, financial, and emotional wellness. These benefits include comprehensive medical, dental and vision plans, 401(k), pension, life insurance, parental benefits, adoption assistance, paid time off program with paid holidays plus 16 paid volunteer hours, and various wellness programs. Additionally, our career path planning and continuing education assists employees with their professional goals.<br><br>Please click on the link below for more details.<br><br><strong>USAA Total Rewards<br><br></strong><strong>Relocation</strong> assistance is <strong>not</strong> <strong>available</strong> for this position.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"USAA\", \"sameAs\": \"https://www.linkedin.com/company/usaa\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQFI2UB_4CpQnA/company-logo_200_200/0/1585925691495?e=1638403200&v=beta&t=Mx0HY4WY3BywOCLxd5gnuIrFDcMhUX434hEywnExsNM\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"USAA\", \"value\": \"R0066976\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQFI2UB_4CpQnA/company-logo_100_100/0/1585925691495?e=1638403200&v=beta&t=NL3Jn1QHZMddZ2lKTEsz1bMtKrQwJEZftWHO0lNr1DA\", \"industry\": \"Financial Services,Information Technology and Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Phoenix\", \"addressRegion\": \"AZ\", \"postalCode\": \"85009\", \"streetAddress\": null}, \"latitude\": 33.448204, \"longitude\": -112.072586}, \"skills\": \"\", \"title\": \"Java Software Engineer-Web Services-Jr Level\", \"validThrough\": \"2021-10-02T06:08:38.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 24}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}