{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-17T07:41:34.000Z\", \"description\": \"<strong>Peckham Industries<br><br><br></strong><strong>Location:</strong> Brewster, NY<br><strong>Salary Interval:</strong> Full Time<br><strong>Date Posted:</strong> 05/07/21<br><br> <strong>Application Instructions<br><br></strong>Peckham Industries delivers the highest quality materials and custom solutions to thousands of road construction and road maintenance customers throughout New York and New England. We have several Hot Mix Asphalt and Concrete Plants, Quarries and Terminals, as well as, a paving and reclamation division all located throughout the NY and New England area.<br><br>Thank you for your Interest in Peckham Industries. Please complete the application in its entirety and if you have a resume and/or cover letter, please upload a copy before submitting.<br><br><br> <strong>Position Description<br><br><br><br></strong>The position is part of a technology team that is responsible for development of software solutions that support Peckham's strategic objectives. Activities include analysis, design, coding, debugging, testing, and support of software applications. The software application functions cover a wide range of business functions ranging from customer-facing web interfaces to back-office and industrial IoT automation. <br><br>The ideal candidate is technologically versatile, team-oriented, but also able to work independently on moderately complex projects, sometimes with only general guidance. The position will provide challenge and the opportunity for continued career growth. <br><br><br><br><strong>Essential Functions <br></strong><ul><li>Interface with cross-functional teams to document stakeholder requests and system specifications and implement them as software products, including design specifications, source code, test scripts and test results.</li><li>Work with system architects and other engineers to ensure that solutions are consistent with Peckham architectural standards and software development industry best practices.</li><li>Propose suggestions to stakeholders on designing effective and efficient solutions to achieve objectives.</li><li>Interact with other departments and resources to coordinate interdependencies and resolve issues.</li><li>Manage risks by proactively tracking and communicating issues and developing methods to mitigate them.<br><br></li></ul><ul><li>Maintain knowledge of new technologies, standards, practices, and tools.</li><li>Participate in the definition and development of documentation for product standards, guidelines, processes, and templates.</li><li>Occasional off-hours production support as required.</li><li>Perform other duties as required.<br><br><br><br><br></li></ul><strong>Supervisory Responsibility<br><br></strong>This position has no supervisory responsibilities.<br><br><strong>Work Environment<br><br></strong>This job operates in an office and professional environment. This role routinely uses standard office equipment such as computers, phones, photocopiers. On occasion the job will require going out in the field, visiting production facilities.<br><br><strong>Physical Demands<br><br></strong>This is mostly sedentary outside of travel in an office space. This would require the ability to sit at a desk, frequent walking, bend or stand, as necessary. <br><br><strong>Position Type and Expected Hours of Work<br><br></strong>Designated days and schedule will be primarily Monday-Friday though will also be based on the needs of the operation and business, may require weekends, nights and early mornings.<br><br><strong>Travel<br><br></strong>Position requires up to 5% travel by car to offices throughout Hudson Valley, Vermont and Massachusetts based on the needs of the operations and business.<br><br>Please note this job description is not designed to cover or contain a comprehensivelisting of activities, duties or responsibilities that are required of the employee for thisjob. Duties, responsibilities and activities may change at any time with or without notice.<br><br> <strong>Position Requirements<br><br></strong><strong>Education, Abilities, Competencies and Experience Required<br></strong><ul>  <li>Expertise in the theoretical &amp; practical application of      software engineering best practices, methods, and techniques.</li>  <li>Full-stack experience in developing software applications on      multiple technology platforms (.NET, Java, etc.).</li>  <li>Good analytical, problem solving and organizational skills.</li>  <li>Experience with Azure and AWS and/or Google cloud services.</li>  <li>Experience designing and building MVC architecture      applications.</li>  <li>Experience working with 3rd party APIs.</li>  <li>Experience with DevOps tools and patterns, including code      repositories, CI platforms, delivery and deployment platforms,      repositories, test platforms, etc.</li>  <li>Experience with container orchestration tools.</li>  <li>Experience with scripting languages (PowerShell, Bash,      Python, etc.).</li>  <li>Experience developing services or microservices.</li>  <li>Experience using Agile software development principles,      process, and tools.</li>  <li>Proficient interpersonal, and written and oral communication      skills, in addition to customer service skills to provide end      user/business owner systems support.</li>  <li>Experience with IoT and/or industrial automation/PLC control      systems is a plus.</li> <br><br></ul>Required knowledge and skills would typically be obtained through a bachelor's degree in computer science or related field plus 6 to 10 years of full lifecycle software development experience.<br><br> <strong>Equal Opportunity Employer<br><br></strong>Peckham Industries is an Equal Employment Opportunity and Affirmative Action employer. It is our policy to provide equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, pregnancy or pregnancy related condition, or any other characteristic protected by federal, state or local law.<br><br>If you have a disability under the Americans with Disabilities Act or similar law and you wish to discuss potential accommodations related to applying for employment at Peckham, please contact HR@peckham.com.<br>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Peckham Industries, Inc.\", \"sameAs\": \"https://www.linkedin.com/company/peckham-industries-inc\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQE_wzUtIyhybQ/company-logo_200_200/0/1596821647478?e=1637193600&v=beta&t=XRnq7DRzD7FS2hWQ2Onet52mrQyCabYG5sjSFazooD4\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Peckham Industries, Inc.\", \"value\": \"143452070\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQE_wzUtIyhybQ/company-logo_100_100/0/1596821647478?e=1637193600&v=beta&t=Yy1vhF1Gx6XYtNflLirIV8IBxbNjJSoCGwz5LOaeD0E\", \"industry\": \"Construction\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Brewster\", \"addressRegion\": \"NY\", \"postalCode\": \"10509\", \"streetAddress\": null}, \"latitude\": 41.39439, \"longitude\": -73.61961}, \"skills\": \"\", \"title\": \"Software Engineer\", \"validThrough\": \"2021-09-16T07:41:33.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 72}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}