{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-17T16:06:05.000Z\", \"description\": \"<p><strong>Junior Database Site Reliability Engineer (SRE)</strong></p><p><br></p><p><strong>Power the Possibilities</strong></p><p>The CDK Global technology team is looking for collaborative innovators who are passionate about making their mark on emerging enterprise software products. We\\u2019re building and developing cloud technology for the automotive retail industry that will change the landscape for automotive dealers, original equipment manufacturers (OEMs) and the customers they serve.</p><p><br></p><p><strong>Be Part of Something Bigger</strong></p><p>Each year, more than three percent of the U.S. gross domestic product (GDP) is attributed to the auto industry, which flows through our customer, the auto dealer. It\\u2019s time you joined an evolving marketplace where research and development investment is measured in the tens of billions. It\\u2019s time you were a part of something bigger.</p><p><br></p><p>We\\u2019re expanding our workforce \\u2013 engineers, architects, developers and more \\u2013 onboarding early adopters who can optimize, pivot and keep pace with ever-evolving development roadmaps and applications.</p><p><br></p><p><strong>Join Our Team</strong></p><p>Growth potential, flexibility and material impact on the success and quality of a next-gen, enterprise software product make CDK an excellent choice for those who thrive in challenging, fast-paced engineering environments. The possibilities for impact are endless. We have exceptional opportunities to evolve our industry by driving change through new technology.</p><p><br></p><p>If you\\u2019re ready for high-impact, you\\u2019re ready for CDK.</p><p><br></p><p><strong>About the Role:&nbsp;</strong></p><ul><li>This is an Infrastructure Operations Engineer position for SQL Server database technology. Infrastructure Engineer (IE) is responsible for Operations primarily consist of implementation, configuration, maintenance, and performance of critical SQL Server RDBMS systems, to ensure the availability and consistent performance of databases. The environment is dynamic and changes can be driven by technology advancements, Organizational objectives to improve efficiency and service levels via automation, enhancing business agility or effectively managing strategic mergers, acquisitions and spin offs.</li><li>Primary Technology: SQL Server, Secondary Technology: Oracle or Postgres along with some experience and knowledge on cloud technologies.</li></ul><p>&nbsp;</p><p><strong>Description:</strong></p><ul><li>This role is responsible for the implementation, configuration, maintenance, and performance of critical SQL Server RDBMS systems.</li><li>Assist in documenting database strategies, runbooks and processes.</li><li>Monitor the performance of production systems and utilize appropriate tools to identify tuning requirements</li><li>Participate in 24 x 7 page out/call out support on a rotating basis for production database support issues</li><li>Having experience in other RDBMS technology is much useful with this role.</li><li>Install and configure standalone SQL Servers and Always on clusters for Test, Dev, Staging and Production environment.</li><li>Should have practical experience on MS SQL Server 2008/2012/2014/2016/2017 versions.</li><li>Troubleshoot various problems that arise during SQL, service packs installations and fix the issues</li><li>Plan and implement major upgrades, ensuring system integrity and monitoring</li><li>Extensive hands-on experience in Database migrations from lower to higher versions in</li><li>Database Backup &amp; Recovery</li><li>Evaluate and deploy security patches as necessary</li><li>Review and deploy the scripts into the production.</li><li>Own database maintenance plans, including rebuilding/reorganizing indexes, integrity checks, and others</li><li>Experience with Enterprise environment change control procedure.</li><li>Work with developers to improve database performance, slow running queries / processing</li><li>Ensure high levels of performance, availability, sustainability and security</li><li>Environments Setup High Availability as part Disaster Recovery Strategy for the Databases</li><li>Good practical experience on Clustering, Always On, Database Mirroring, Log Shipping and Replication</li><li>Implement and maintain database security</li><li>Define and enforce database security best practices, including both user access and data at rest</li><li>Create and configure a single and multi-node SQL Server failover cluster instance</li><li>Add or Remove Nodes in a SQL Server Failover Cluster</li><li>Analyze, solve, and prepare RCA for production outages.</li><li>Debug and troubleshoot database system failures and provide solutions quickly.</li><li>Troubleshoot SQL Server service outages as they occur, including after-hours and weekends</li></ul><p>&nbsp;</p><p><strong>Skills Required:</strong></p><ul><li>Bachelor degree in Computer Science, Information Systems, Engineering or equivalent education experience.</li><li>6+ years of MS SQL server experience in designing, implementing and administrating database system on multiple MS SQL Server versions from SQL 2005 to SQL 2019.</li><li>Thorough knowledge of SQL Server installation, configurations, troubleshooting and performance tuning skills required.</li><li>Experience implementing and managing Windows clustering and AlwaysOn Failover Cluster Instances (FCI), Always-On Availability Groups, Mirroring, Log shipping.</li><li>Thorough knowledge of Windows, 2012, 2016 and preferable 2019.</li><li>Ability to diagnose problems and triage/resolve issues across various tiers (application, network, database, server, or storage tiers).</li><li>Must have strong experience with TSQL, Powershell scripting.</li><li>Ability to implement automation to reduce manual administrative tasks through use of jobs or other technologies.</li><li>Experience in database upgrade/migrate, patching, backup recovery of large databases.</li></ul><p>&nbsp;</p><p>&nbsp;</p><p>CDK Global knows you have passions outside of work.&nbsp;You have family, friends, sporting events, and lots of things going on.&nbsp;That\\u2019s why we offer a comprehensive benefits package to not only take care of you but your family as well.&nbsp;All of our benefits are effective the first day of employment including 401K matching, paid time off to re-energize, donate your time to volunteer in your community, and tuition reimbursement to name a few.</p><p>At CDK, we pride ourselves on having a diverse workforce. We value and celebrate the uniqueness of individuals and the different perspectives&nbsp;they provide. We offer equal opportunity employment regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, or protected veteran status.&nbsp;&nbsp;</p>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"CDK Global\", \"sameAs\": \"https://www.linkedin.com/company/cdknorthamerica\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQFQO5tUIX4Ezg/company-logo_200_200/0/1519856118180?e=1637193600&v=beta&t=EHcnqwQizDt0_97YxE-xHgFQaUilKcbbhPrpcoTadK8\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"CDK Global\", \"value\": \"88206\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQFQO5tUIX4Ezg/company-logo_100_100/0/1519856118180?e=1637193600&v=beta&t=n0lI1Xqjy7Y6MYsR0CQz6ZqdcYRdU82q6yf5kSp7zz8\", \"industry\": \"Computer Software,Computer Hardware\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Austin\", \"addressRegion\": \"TX\", \"postalCode\": \"78746\", \"streetAddress\": null}, \"latitude\": 30.264978, \"longitude\": -97.7466}, \"skills\": \"\", \"title\": \"Junior Database Site Reliability Engineer (SRE)\", \"validThrough\": \"2021-09-16T16:06:05.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 72}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}