{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-14T17:13:17.000Z\", \"description\": \"<strong><u>Company Description<br><br></u></strong>As the world\\u2019s leader in digital payments technology, Visa\\u2019s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company\\u2019s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.<br><br>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.<br><br>You\\u2019re an Individual. We\\u2019re the team for you. Together, let\\u2019s transform the way the world pays.<br><br><strong><u>Job Description<br><br></u></strong><strong>What&apos;s</strong> <strong>the</strong> <strong>job?</strong> As part of the Network Processing Product Development organization, you will be responsible for system development, implementation, maintenance and support of Visa&apos;s Clearing and Settlement systems, which clear, settle, and deliver transactions to issuer and acquirer financial institutions globally. Through this challenging job, you will gain experience collaborating with various parts of the business in understanding requirements for system enhancements, identifying areas of improvement and implementing changes to the system where it is needed. The product that you oversee will be of the highest quality meeting all requirements within the scheduled timeframe.<br><br><strong>Who</strong> <strong>are</strong> <strong>we</strong> <strong>looking</strong> <strong>for?</strong> You! We are looking for a Senior Lead Engineer with application design and development experience who will take ownership and/or lead the engineering responsibility for multiple components in a project. You are a great teammate, making sure that everyone on your team feels valued and is excited to work with you. Location, time pressure, distractions, none of it matters: no matter the environment, you know you can code and build amazing, high-performing, and bug-free products.<br><br><strong>Experience in Java, Javascript, with SQL and Linux is necessary. You lead and encourage others to take risks, be bold, and innovate in order to create exceptional products that are both seamless for our clients and consumer facing</strong>. No matter the challenge, you know you can find a solution and encourage others to think the same. You recognize when to ask for help and when to collaborate with others, working across departments and influencing in areas beyond immediate control. Above all, you are someone who takes initiative and thinks like an owner - you&apos;ve defined your everywhere and lead others to find theirs all while launching Visa ahead of the game.<br><br><strong>Why</strong> <strong>us?</strong> Working at Visa is challenging. The problems that we face and solve and the decisions that we make affect the world. Visa is all about helping people around the world reach their Everywhere, the place where their personal, professional and financial goals intersect. As the premier payments technology company, we&apos;re proud to boast that our commerce platforms touch the lives of billions, all over the globe. If you have ambition, focus and drive, and are interested in joining a global team focused on changing the way the world pays and is paid, you&apos;ll find your everywhere at Visa.<br><br><strong><u>Qualifications<br><br></u></strong><strong>Basic Qualifications:<br></strong><ul><li>4 years of work experience with a Bachelor\\u2019s Degree or at least 2 years of work experience with an Advanced degree (e.g. Masters, MBA, JD, MD) or 0 years of work experience with a PhD degree.</li><li>4 years of experience on application development on Linux and Windows are required.<br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li>8-10 years of work experience and a Bachelor\\u2019s Degree or 6 years of work experience with an Advanced Degree (e.g. Masters, MBA, JD, MD) or 3 years of experience with a PhD.</li><li>Strong design and coding skills with Java/J2EE, Spring, JavaScript technologies.</li><li>Working experience in Angular, MySQL and REST web services is must.</li><li>Knowledge and working experience with messaging technologies like MQ, Kafka.</li><li>Experience in applying modern Agile Software Development practices is required.</li><li>Experience on application development on Linux is required.</li><li>Experience in Kubernetes to deploy scale, load balance and manage Docker containers is preferred.</li><li>Be passionate about technology and solving large-scale complex business problems.</li><li>Be an established self-starter who possesses a relentless drive to initiate change, raise the technical bar and deliver result</li><li>Knowledge and working experience on Git/Stash, Jenkins and Jira</li><li>Experience in applying modern Agile Software Development practices is required.</li><li>Experience with database technologies like MySQL, SQL Server.</li><li>Experience in MicroServices development is a plus.</li><li>Experience handling vendor product and integration with internal Windows/Linux based applications.</li><li>Must be capable of translating architecture into a delivered solution that realizes the vision and purpose and effectively translate functional and non-functional requirements into an engineered solution.</li><li>Should be able to lead the technical team in comfortably extending an existing solution, or conceiving a new solution and working with delivery to have the target state architecture realized.</li><li>Provides direction for selecting appropriate engineering techniques to solve for non-functional requirements at the project level.</li><li>Strong problem determination skills and ability to resolve critical issues for complex systems under tight timeframes using dumps and other tools.</li><li>Excellent written and verbal communication skills.</li><li>Ability to multi task and handle multiple competing priorities with minimal direction from management. Should possess excellent planning and organizational skills.</li><li>Must be able to write technical design and build documentation for all aspects of a technical infrastructure.</li><li>Good interpersonal and facilitation skills.</li><li>Bachelor&apos;s degree in Computer Science or equivalent career experience is required.<br></li></ul><strong><u>Responsibilities<br></u></strong><ul><li>Take complete end-to-end technical &amp; engineering ownership of one or more applications</li><li>Be at the forefront of translating complex functional and technical requirements into detailed architecture and design</li><li>Have significant influence on our strategy by helping define and build the next wave of product features and system architecture</li><li>Coordinate engineering activities across the delivery of the project and work with engineers to ensure they are delivering quality and efficiently against project requirements.</li><li>Partner with Architecture and Business teams to provide best in class solutions</li><li>Champion Agile to inspire change and continuous improvement throughout the delivery process</li><li>Take a hands on role in influencing and guiding day-to-day development activities by leading architecture decisions, participating in designs, design review, code review, and implementation</li><li>Be the ambassador for engineering best practice across the development lifecycle and champion continuous improvement across the Centre</li><li>Define solutions in terms of components, modules and algorithms</li><li>Development and Implementation of the proposed solution</li><li>Identify or develop software frameworks to be used</li><li>Refactor existing solutions to make it reusable and scalable</li><li>Leads and/or supports both product and technical discussions about how to apply existing and/or new technology in support of the business.</li><li>Create design documents, code, unit/functional test, document and implement new programs and subprograms, as well as enhancements, modifications, and corrections to existing software.</li><li>Must be able to understand the positioning of a solution within the company and to build consensus to effectively gain buy-in from all participants.</li><li>Identify opportunities for further enhancements and refinements to standards, processes and systems.</li><li>Provide rotational on-call support as required.</li></ul><strong>Additional Information<br><br></strong><strong>Work Hours </strong>This position requires the incumbent to be available during core business hours.<br><br><strong>Travel Requirements </strong>This position do not requires the incumbent to travel.<br><br><strong>Mental/Physical Requirements </strong>This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, and reach with hands and arms.<br><br><strong>EEO Statement </strong>Visa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.<br><br>Job Number: REF35079P\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Visa\", \"sameAs\": \"https://www.linkedin.com/company/visa\", \"logo\": \"https://media-exp3.licdn.com/dms/image/C4D0BAQHW9Vyrl6r5ZA/company-logo_200_200/0/1519856212168?e=1634169600&v=beta&t=asEe-Tm-UvCf_kVw8V4QJex9MsqaX_2oL8TeSRktyBE\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Visa\", \"value\": \"REF35079P\"}, \"image\": \"https://media-exp3.licdn.com/dms/image/C4D0BAQHW9Vyrl6r5ZA/company-logo_100_100/0/1519856212168?e=1634169600&v=beta&t=YVNHa9XScd0LneKaN3q_bhSLArmuoX5z7pB93Znl5zA\", \"industry\": \"Consumer Services,Financial Services,Information Technology and Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Atlanta\", \"addressRegion\": \"GA\", \"postalCode\": \"30355\", \"streetAddress\": null}, \"latitude\": 33.748547, \"longitude\": -84.3915}, \"skills\": \"\", \"title\": \"Staff Software Engineer - Java / Full Stack\", \"validThrough\": \"2021-08-13T17:13:17.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 96}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}