{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-20T23:12:54.000Z\", \"description\": \"<p><strong>Status:</strong> Full Time, Employee</p><p><strong>Job Category:</strong> Software Engineering</p><p><strong>Relevant Work Experience:</strong> 2-4 years</p><p><strong>Career Level:</strong> Mid-Level</p><p><strong>Education:</strong> Bachelor\\u2019s Degree in CS, EE or equivalent work experience</p><p><strong>Industry:</strong> Telecommunications/Wireless</p><p><strong>Location:</strong> Kirkland, WA, US </p><p>&nbsp;</p><p><strong>The Opportunity</strong></p><p>Bluetooth technology is the fastest growing wireless technology in the world and the Bluetooth Special Interest Group (Bluetooth SIG), the company at the heart of the Bluetooth industry, is hiring!&nbsp;Backed by industry-leading companies, the Bluetooth SIG oversees the development of new Bluetooth specifications, and provides the processes and tools for members to build, test, qualify, and brand their Bluetooth products.</p><p><br></p><p>Our collaborative, fast-paced company culture and critical role in making the Internet of Things a reality provides you with a unique opportunity to collaborate with the companies that are creating the world\\u2019s most advanced products and for you to be a part of the vanguard of technology innovation.</p><p><br></p><p>At the Bluetooth SIG, our values are at the core of who we are and are displayed on a daily basis as we cultivate relationships with our members, business partners and our organization. When joining the Bluetooth SIG, it means you share and display these values at the highest level: collaboration, commitment, integrity, respect, humility and creativity.</p><p><br></p><p><strong>The Role</strong></p><p>The Bluetooth SIG is seeking a highly motivated individual with both manual and automated testing experience.&nbsp;The specific role involves:</p><ul><li>Verification testing for pre-adoption Bluetooth specifications.</li><li>Validation of Bluetooth toolsets for frequent release to the Bluetooth community.</li><li>Continued development, enhancement and execution of test automation.</li></ul><p><br></p><p>The ability to work independently and creatively in an Agile Scrum environment is of paramount importance. This position involves working in a fast-paced environment with tight deadlines.</p><p>At the present time, this is a hybrid location position with the opportunity to work at home and from the office in Kirkland, WA as warranted.</p><p><br></p><p><strong>Requirements:</strong></p><ul><li>Bachelor\\u2019s Degree in Computer Science or Engineering.</li><li>At least 2-4 years of industry software testing experience, with preferred emphasis in wireless protocols, hardware, or embedded device testing.</li><li>Automation skills in at least one common language (C#, Python, Java).</li><li>Experience in designing, developing, and delivering QA automation testing.</li><li>Experience with Microsoft development tools and Azure DevOps for bug and test case tracking, code-repositories, and CI pipelines.</li><li>Good understanding of the software testing life cycle, QA processes and Agile testing methodology.</li><li>Team Player with a great attitude to execute and deliver testing results to satisfy requirements and release schedules.</li><li>Excellent communications skills, both verbal and written.</li><li>Demonstrated analytical and problem-solving skills with the ability to debug, analyze, and communicate failures.</li><li>Passion for quality in solving complex software development problems</li><li>A driven problem solver with strong organizational and analytical skills with attention to detail.</li><li>Candidate must be located in the Puget Sound region with the ability to be in the office on days when job functions warrant.</li></ul><p><br></p><p><strong>Bonus Points for:</strong></p><ul><li>Experience with or knowledge of Bluetooth tools, protocols, and architecture.</li><li>Experience with one or more test automation tools such as Selenium, JMeter, FlaUI or TestCafe.</li><li>Knowledge of and ability to write PowerShell scripts to automate set-up of test environments and execution of automated tests.</li></ul><p><br></p><p><strong>Job Responsibilities:</strong></p><ul><li>Ability to work and deliver results on an Agile Scrum Engineering team as well as an individually.</li><li>Read and understand Bluetooth specifications and requirements prior to adoption, execute manual verification tests, report and track failures, regression testing of fixes.</li><li>Writing and executing test cases and scenarios to verify tools functionality.</li><li>Use of Bluetooth hardware devices to help validate tools and specifications.</li><li>Frequent release testing of our tools.</li><li>Developing and contributing to our automation footprint.</li><li>Verification of member reported issues and resolutions.</li><li>Develops and uses working knowledge of the products and tools, along with strong customer empathy, to contribute to feature designs.</li><li>Provides feedback on the product design and vision in planning meetings and post-mortems</li><li>Contributes to and maintains automation tools and CI automation pipelines.</li><li>Considers diagnosability, reliability, and maintainability in test automation, and understands when his or her code is ready to be shared and delivered.</li><li>Exposes test coverage issues, and implements functional and non-functional tests that identify gaps in integration and boundaries, and broad problem areas.</li><li>Presents conclusions to Engineering peers that fully describe defects, their impact to feature areas, customer scenarios, and quality targets.</li><li>Has a sense of pride and personal accountability for the end-to-end product/service quality, completeness, and resulting user experience.</li><li>Incorporates software quality best practices into their daily tasks.</li><li>Using agile methodology, the ability to break down and estimate new engineering work that includes ensuring a high quality bar</li><li>Helps define his or her own role in the delivery of the product(s).</li></ul><p><br></p><p>The Bluetooth SIG offers an excellent benefits package including health, prescription drug, short-term and long-term disability, vision and dental coverage, life insurance, and 401(k).</p><p>&nbsp;</p><p><strong>Equal Employment Opportunity</strong></p><p><br></p><p>Bluetooth SIG, Inc. is committed to providing equal opportunity employment to all employees and applicants for employment.&nbsp;No employee or applicant shall be discriminated against on the basis of race, religion, color, sex, age, national origin, veteran status, disability, sexual orientation, National Guard or reserve unit obligation, or any other characteristic protected by law.&nbsp;Consistent with applicable federal and state law, Bluetooth SIG, Inc. will make reasonable accommodations for the known physical or mental limitations of qualified applicants or employees unless doing so would impose an undue hardship on the Company.&nbsp;A reasonable accommodation is any modification or adjustment to a job, employment practice, or the work environment that makes it possible for an individual with a disability to enjoy an equal employment opportunity.&nbsp;This policy applies to all aspects of employment, including but not limited to, selection, job assignment, compensation, discipline, termination, and access to benefits and training.&nbsp;</p><p></p>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Bluetooth SIG\", \"sameAs\": \"https://www.linkedin.com/company/bluetooth-sig\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQHh9NPLD2Nl9Q/company-logo_200_200/0/1581093694570?e=1637798400&v=beta&t=KHVdL24PI01h_bKWitRFhe13bRhDA5SqV9VTdzz0lsw\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Bluetooth SIG\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQHh9NPLD2Nl9Q/company-logo_100_100/0/1581093694570?e=1637798400&v=beta&t=8qn6VO8zv7RFB9VWUULwhXUFnj_TP_nxsqtENr6sd-0\", \"industry\": \"Wireless,Telecommunications\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Kirkland\", \"addressRegion\": \"WA\", \"postalCode\": \"98034\", \"streetAddress\": null}, \"latitude\": 47.675507, \"longitude\": -122.20336}, \"skills\": \"\", \"title\": \"Software Development Engineer in Test II, \", \"validThrough\": \"2021-09-19T23:12:54.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 24}, \"estimatedSalary\": {\"@type\": \"MonetaryAmount\", \"currency\": \"USD\", \"value\": {\"@type\": \"QuantitativeValue\", \"minValue\": 62300, \"maxValue\": 103000, \"unitText\": \"YEAR\"}}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}