{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-09-02T07:22:04.000Z\", \"description\": \"<strong>SiteZeus </strong>is hiring a <strong>Data Scientist</strong> to join our growing product team! Our ideal candidate has a strong background in Data Science and Statistics.<br><br>SiteZeus is a location intelligence SaaS platform based out of Tampa, FL and founded in 2013. We are a remote organization focused on company culture, industry changing technology, and employee value. Our customers use SiteZeus to make better decisions about where to build their next physical locations, and how to optimize their investment in existing locations. We empower brands to pick the very best locations by employing the very best people and giving them the tools to succeed.<br><br><strong>Expected Salary Range</strong> - $50,000 - $85,000<br><br>SiteZeus may consider candidates it deems as overqualified or underqualified. Such candidates may be considered at salary numbers higher or lower than the listed range.<br><br><strong><u>Responsibilities And Duties<br></u></strong><ul><li>Implement statistical methods for predictive models.</li><li>Analyze multiple data sources and make appropriate forecasts (i.e. estimated sales).</li><li>Enhance data collection procedures to build analytic systems Perform ad-hoc analysis and present results in a clear manner.</li><li>Regularly participate in Agile ceremonies including daily scrum, refinement, sprint planning and retrospectives.</li><li>Make suggestions for process improvements consistent with our theme of continual process improvement.<br><br></li></ul><strong><u>Qualifications And Skills<br></u></strong><ul><li>Experience with common data science and numerical libraries in Python (i.e. NumPy, SciPy, SciKit-Learn).</li><li>Must understand different statistical methodologies and good applied statistics skills, such as distributions, statistical testing, regression, etc.</li><li>Understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.</li><li>Proficiency in using query languages such as SQL is a plus.</li><li>Proficiency with predictive analytics on big data projects is a plus.</li><li>Experience building models with geospatial data, mobile data, or street view/satellite imagery preferred.</li><li>A Bachelor's degree in Computer Science, Mathematics, Statistics, or another STEM field. Masters preferred.<br></li></ul>This is a Remote (work from home) position.<br><br><strong>Why work at SiteZeus?<br></strong><ul><li>Work from home, from our Tampa office, or hybrid! We operate fully remote.</li><li>Unlimited PTO that we WANT you to use.</li><li>401k, Health, Dental, Legal and loads of awesome traditional benefits.</li><li>Paid parental leave for Mother, Father, or Partner + dedicated nursing room in Tampa HQ.</li><li>Paid monthly community service time.</li><li>Paid company summits (Technology, Sales, Etc).</li><li>Flexible work hours.</li><li>Serious wellness programs to make your work-life balance better than ever.</li><li>Equity gaining opportunities after one year of employment (based on performance).</li><li>Monthly incentive for meeting sales goals (This is in addition to listed compensation).<br><br></li></ul><strong>Hiring Process<br><br></strong>Below is our hiring process for this position. We will reach out or send a rejection notice to most candidates within 1-5 business days of applying. SiteZeus promises to value your time and professionalism in every step of the process.<br><ul><li>Quick Screening.</li><li>Interview with the Hiring Manager.</li><li>Group interview with multiple members of the department.</li><li>Final Interview with Executive Leadership<br><br></li></ul><strong>Everything Else<br><br></strong>SiteZeus is proud to be an equal opportunity employer that celebrates diversity, culture, and the human experience. We go above and beyond to ensure that all team members feel comfortable about who they are and the contributions they make to our mission. Our team is highly encouraged to find a balance that allows for optimal fulfillment at work and home.<br><br>All applicants must be legally authorized to work within the United States. All roles may require prolonged periods of sitting at a desk, working on a computer, and corporate communication skills. Further, SiteZeus takes physical health seriously and has processes in place to minimize the spread of Covid-19 at its Tampa HQ. Degree requirements and preferences may be substituted for bonified work history or relevant experience.<br><br>Powered by JazzHR<br><br>PIDG5909os\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"SiteZeus\", \"sameAs\": \"https://www.linkedin.com/company/sitezeus\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQEow6BChUY1aw/company-logo_200_200/0/1594772003146?e=1639008000&v=beta&t=JnCDEFtYKQJD_j-8OsV7WO5EIELMC4Bjak7BUvcetP0\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"SiteZeus\", \"value\": \"3189699\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQEow6BChUY1aw/company-logo_100_100/0/1594772003146?e=1639008000&v=beta&t=rESe933jRv1mcBSHFb-XirKn2hQpqMHR6gZaftYDtqY\", \"industry\": \"Computer Software\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Tampa\", \"addressRegion\": \"FL\", \"postalCode\": \"33675\", \"streetAddress\": null}, \"latitude\": 27.947424, \"longitude\": -82.45878}, \"skills\": \"\", \"title\": \"Junior Data Scientist\", \"validThrough\": \"2021-10-02T07:22:04.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"jobLocationType\": \"TELECOMMUTE\", \"applicantLocationRequirements\": {\"@type\": \"Country\", \"name\": \"United States\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}