{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-05T05:18:08.000Z\", \"description\": \"<strong>Our Purpose<br><br></strong>We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team \\u2013 one that makes better decisions, drives innovation and delivers better business results.<br><br><strong>Job Title<br><br></strong>Site Reliability Engineer, BizOps<br><br><strong><u>Job Description<br><br></u></strong>The SRC BizOps team is looking for a Site Reliability Engineer who can help us solve problems, build our CI/CD pipeline and lead Mastercard in DevOps automation and best practices.<br><ul><li> Are you a born problem solver who loves to figure out how something works?</li><li> Are you a CI/CD geek who loves all things automation?</li><li> Do you have a low tolerance for manual work and look to automate everything you can?<br></li></ul>Business Operations is leading the DevOps transformation at Mastercard through our tooling and by being an advocate for change &amp; standards throughout the development, quality, release, and product organizations. We need team members with an appetite for change and pushing the boundaries of what can be done with automation. Experience in working across development, operations, and product teams to prioritize needs and to build relationships is a must.<br><br>Mission<br><br>The role of business operations is to be the production readiness steward for the platform. This is accomplished by closely partnering with developers to design, build, implement, and support technology services. A business operations engineer will ensure operational criteria like system availability, capacity, performance, monitoring, self-healing, and deployment automation are implemented throughout the delivery process. Business Operations plays a key role in leading the DevOps transformation at Mastercard through our tooling and by being an advocate for change and standards throughout the development, quality, release, and product organizations.<br><br>We accomplish this transformation through supporting daily operations with a hyper focus on triage and then root cause by understanding the business impact of our products. The goal of every biz ops team is to shift left to be more proactive and upfront in the development process, and to proactively manage production and change activities to maximize customer experience, and increase the overall value of supported applications. Biz Ops teams also focus on risk management by tying all our activities together with an overarching responsibility for compliance and risk mitigation across all our environments. A biz ops focus is also on streamlining and standardizing traditional application specific support activities and centralizing points of interaction for both internal and external partners by communicating effectively with all key stakeholders.<br><br>Ultimately, the role of biz ops is to align Product and Customer Focused priorities with Operational needs. We regularly review our run state not only from an internal perspective, but also understanding and providing the feedback loop to our development partners on how we can improve the customer experience of our applications.<br><br><strong><u>Responsibilities<br><br></u></strong>For all team members:<br><ul><li> Engage in and improve the whole lifecycle of services\\u2014from inception and design, through deployment, operation and refinement.</li><li> Analyze ITSM activities of the platform and provide feedback loop to development teams on operational gaps or resiliency concerns</li><li> Support services before they go live through activities such as system design consulting, capacity planning and launch reviews.</li><li> Maintain services once they are live by measuring and monitoring availability, latency and overall system health.</li><li> Scale systems sustainably through mechanisms like automation, and evolve systems by pushing for changes that improve reliability and velocity.</li><li> Support the application CI/CD pipeline for promoting software into higher environments through validation and operational gating, and lead Mastercard in DevOps automation and best practices.</li><li> Practice sustainable incident response and blameless postmortems.</li><li> Take a holistic approach to problem solving, by connecting the dots during a production event thru the various technology stack that makes up the platform, to optimize mean time to recover</li><li> Work with a global team spread across tech hubs in multiple geographies and time zones</li><li> Share knowledge and mentor junior resources<br></li></ul><strong><u>For Team Members Supporting The Dev Ops Pipeline<br></u></strong><ul><li> Design, implement, and enhance our deployment automation based on Chef. We need proven experience writing chef recipes/cookbooks as well as designing and implementing an overall Chef based release and deployment process.</li><li> Use Jenkins to orchestrate builds as well as link to Sonar, Chef, Maven, Artifactory, etc. to build out the CI/CD pipeline.</li><li> Support deployments of code into multiple lower environments. Supporting current processes needed with an emphasis on automating everything as soon as possible.</li><li> Design and implement a Git based code management strategy that will support multiple environment deployments in parallel. Experience with automation for branch management, code promotions, and version management is a plus.<br></li></ul><strong><u>Qualifications<br></u></strong><ul><li> BS degree in Computer Science or related technical field involving coding (e.g., physics or mathematics), or equivalent practical experience.</li><li> Experience with algorithms, data structures, scripting, pipeline management, and software design.</li><li> Systematic problem-solving approach, coupled with strong communication skills and a sense of ownership and drive.</li><li> Ability to help debug and optimize code and automate routine tasks.</li><li> We support many different stakeholders. Experience in dealing with difficult situations and making decisions with a sense of urgency is needed.</li><li> Experience in one or more of the following is preferred: C, C++, Java, Python, Go, Perl or Ruby.</li><li> Interest in designing, analyzing and troubleshooting large-scale distributed systems.</li><li> We need team members with an appetite for change and pushing the boundaries of what can be done with automation. Experience in working across development, operations, and product teams to prioritize needs and to build relationships is a must.</li><li> For work on our dev ops team, engineer with experience in industry standard CI/CD tools like Git/BitBucket, Jenkins, Maven, Artifactory, and Chef. Experience designing and implementing an effective and efficient CI/CD flow that gets code from dev to prod with high quality and minimal manual effort is required.<br></li></ul>Due to COVID-19, most of our employees are working from home. We\\u2019ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we\\u2019re all in this together.<br><br><em>Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. <br><br></em><em>If you require accommodations or assistance to complete the online application process, please contact </em><em>reasonable.accommodation@mastercard.com</em><em> and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.</em>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Mastercard\", \"sameAs\": \"https://www.linkedin.com/company/mastercard\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQGOW4NIyYRRqQ/company-logo_200_200/0/1519856263087?e=1635984000&v=beta&t=h5YautUGqi9os2sOBYIuRZNQ78Dn4tSrXs6i5dzLmag\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Mastercard\", \"value\": \"R\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQGOW4NIyYRRqQ/company-logo_100_100/0/1519856263087?e=1635984000&v=beta&t=trLYbJ4quyQ2Opj3XKJPPz4qaxPzp7ga9oldBKIJvO4\", \"industry\": \"Financial Services,Information Technology and Services,Internet\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"New York\", \"addressRegion\": \"NY\", \"postalCode\": \"10132\", \"streetAddress\": null}, \"latitude\": 40.713047, \"longitude\": -74.00723}, \"skills\": \"\", \"title\": \"Site Reliability Engineer, BizOps\", \"validThrough\": \"2021-09-04T05:18:12.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"estimatedSalary\": {\"@type\": \"MonetaryAmount\", \"currency\": \"USD\", \"value\": {\"@type\": \"QuantitativeValue\", \"minValue\": 109000, \"maxValue\": 174000, \"unitText\": \"YEAR\"}}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}