{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-20T22:42:28.000Z\", \"description\": \"<strong><u>Overview<br><br></u></strong>At Perficient you\\u2019ll deliver mission-critical technology and business solutions to Fortune 500 companies and some of the most recognized brands on the planet. And you\\u2019ll do it with cutting-edge technologies, thanks to our close partnerships with the world\\u2019s biggest vendors. Our network of offices across North America, as well as locations in India and China, will give you the opportunity to spread your wings, too.<br><br>We\\u2019re proud to be publicly recognized as a \\u201cTop Workplace\\u201d year after year. This is due, in no small part, to our entrepreneurial attitude and collaborative spirit that sets us apart and keeps our colleagues impassioned, driven, and fulfilled.<br><br>Perficient currently has a career opportunity for a <strong>Technical Architect</strong> to support ingesting data into enterprise data lakes.<br><br><strong><u>Job Overview<br><br></u></strong>A Technical Architect provides technology direction, ensures project implementation compliance, and utilizes technology research to innovate, integrate, and manage technology solutions. As a Technology Architect, you will significantly contribute to identifying best-fit architectural solutions for one or more projects; you will collaborate with some of the best talent in the industry to create and implement innovative high quality solutions, participate in Sales and various pursuits focused on our clients' business needs. This role is considered part of the Business Unit Leadership team and may mentor Junior Architects and /or development team members.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Lead a strong technical team to ingest and acquire data into our Enterprise Data Lake </li><li> Help build the strategic vison and platform migration to the cloud. </li><li> Design and develop applications using the latest technologies for both on premises and cloud platforms </li><li> Utilize Agile methodology to help quickly deliver robust applications </li><li> Guide design discussions </li><li> Develop and maintain data management systems for the Team according to best practices and architectural guidance. </li><li> Provide architectural solutions/designs to project execution teams for implementation. </li><li> Provide technology architectural assessments, strategies, and roadmaps for one or more technology domains. </li><li> Work with application developers, users, operational leadership, and subject matter experts to understand current and future operational data analysis goals. Recommend modern technology stacks to meet those goals and help engineering teams migrate towards their use. </li><li> Collaborate with the customer's operations and technology leadership on the future analytic goals of the organization, and design a technical architecture to meet those goals. Participate in configuring the architecture, and advise engineering teams on its efficient use. </li><li> Lead a work stream or act as a team lead and manage non-complex components of the work plan/project. </li><li> Utilize analytical, process, and/or technical skills to meet project objectives and deliverables that are self-directed and within project scope. <br></li></ul><strong><u>Qualifications<br></u></strong><ul><li> Minimum 10 years of programming experience with enterprise data management </li><li> At least 5 years of experience in technology consulting, enterprise and solutions architecture and architectural frameworks. </li><li> At least 1 year of experience with AWS </li><li> Experience in defining new architectures and ability to drive an independent project from an architectural stand point. </li><li> Experience in complete project life cycle activities on development and maintenance projects. </li><li> Knowledge and experience in developing software using agile methodologies. </li><li> Proven track record of technical leadership roles delivering solutions within defined timeframes. </li><li> Skilled in building relationships with clients and in practice development activities. </li><li> Demonstrated success in performing work and managing complex and/or large consulting projects. </li><li> Excellent written and oral communication skills; Ability to communicate effectively with technical and non-technical staff. </li><li> Bachelor\\u2019s degree in Computer Science or related field. </li><li> Must be open to travel. <br></li></ul><strong><u>Preferred Skills And Education<br></u></strong><ul><li> Experience working with a globally distributed team and managing off-shore teams. </li><li> Master\\u2019s degree in Computer Science or related field. </li><li> Certification in AWS </li><li> Certification with a Big Data technology </li><li> Experience with authoring, editing and presenting technical documents. <br></li></ul>Perficient full-time employees receive complete and competitive benefits. We offer a collaborative work environment, competitive compensation, generous work/life opportunities and an outstanding benefits package that includes paid time off plus holidays. In addition, all colleagues are eligible for a number of rewards and recognition programs including billable bonus opportunities. Encouraging a healthy work/life balance and providing our colleagues great benefits are just part of what makes Perficient a great place to work.<br><br><strong><u>More About Perficient<br><br></u></strong>Perficient is the leading digital transformation consulting firm serving Global 2000 and enterprise customers throughout North America. With unparalleled information technology, management consulting and creative capabilities, Perficient and its Perficient Digital agency deliver vision, execution and value with outstanding digital experience, business optimization and industry solutions.<br><br>Our work enables clients to improve productivity and competitiveness; grow and strengthen relationships with customers, suppliers and partners; and reduce costs. Perficient's professionals serve clients from a network of offices across North America and offshore locations in India and China. Traded on the Nasdaq Global Select Market, Perficient is a member of the Russell 2000 index and the S&amp;P SmallCap 600 index.<br><br>Perficient is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national, origin, disability status, protected veteran status, or any other characteristic protected by law.<br><br><strong> Disclaimer: </strong> The above statements are not intended to be a complete statement of job content, rather to act as a guide to the essential functions performed by the employee assigned to this classification. Management retains the discretion to add or change the duties of the position at any time.<br><br>Select work authorization questions to ask when applicants apply<br><ul><li> Are you legally authorized to work in the United States?</li><li> Will you now, or in the future, require sponsorship for employment visa status (e.g. H-1B visa status)?</li></ul>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Perficient\", \"sameAs\": \"https://www.linkedin.com/company/perficient\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQEBRPamQkG6Iw/company-logo_200_200/0/1519879485629?e=1637798400&v=beta&t=Ixet6wdhJtJ9wMhl1ErTTbECtdOAW8JzM4KwTFn9QHc\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Perficient\", \"value\": \"2021-13139\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQEBRPamQkG6Iw/company-logo_100_100/0/1519879485629?e=1637798400&v=beta&t=iCkx_DQwQl4gnQjeNAwBDR4IOaEv1X2oX5RHdV8iLk4\", \"industry\": \"Information Technology and Services,Computer Software,Financial Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Cheyenne\", \"addressRegion\": \"WY\", \"postalCode\": \"82003\", \"streetAddress\": null}, \"latitude\": 41.14024, \"longitude\": -104.8188}, \"skills\": \"\", \"title\": \"Data Lake Technical Lead (AWS/Big Data)\", \"validThrough\": \"2021-09-19T22:42:28.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"associate degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 120}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}