{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-21T02:00:27.000Z\", \"description\": \"<em>Job Title:</em> Director of Analytics for Student Success &amp; Equity (MPP II)<br><br><em>Regular/Temporary:</em> Regular<br><br><em>Full/Part Time:</em> Full-Time<br><br><em>Job ID:</em> 63121<br><br>Director of Analytics for Student Success and Equity<br><br>Type of Appointment: Full-time, Management Personnel Plan II (MPP II)<br><br>Salary Range: Commensurate with Qualifications and Experience<br><br>Recruitment Closing Date: Open Until Filled<br><br>First Review: June 18, 2021<br><br><strong><u>REQUIRED (All Candidates Must Submit The Following)<br></u></strong><ul><li>An on-line application</li><li>A letter of interest which explains in detail and, where possible, provides examples of how the candidate meets the qualifications specified in this announcement</li><li>A current r\\u00e9sum\\u00e9 or curriculum vitae</li><li>Three references who can provide assessments of the applicant's professional experience, accomplishments and prospect for success in this position.<br></li></ul><strong><u>About The Department<br><br></u></strong>The office of Institutional Research, Planning, and Analytics (IRPA) supports data-informed decision making to help Cal Poly Pomona fulfill its commitment to student access and achievement. We support continuous improvement by seeking innovative ways to make data accessible, intelligible, and actionable.<br><br>The Division for Information Technology and Institutional Planning (IT&amp;IP) provides innovative, strategic and cost-appropriate technology services in collaboration with the campus community to advance the mission of the University. Information and Digital technology services are recognized as an essential resource in furthering the University's mission. The IT&amp;IP Division will provide technology solutions, expert consultation, and leadership resulting in numerous enhancements to the advancement of learning and knowledge and to the effectiveness of campus support services and business processes for the entire University.<br><br><strong><u>Duties And Responsibilities<br><br></u></strong>Assessment, Evaluation &amp; Analytics<br><ul><li> Lead efforts on predictive analytics for student success and retention across the university for all students across demographic identities, academic colleges, and co-curricular programming activities.</li><li> Conduct research, build models, interpret results and make recommendations related to the assessment and evaluation of student success with an emphasis on equity gap data.</li><li> Work closely with the campus EAB Navigate team to understand, utilize, and make recommendations for enhancements to the predictive models within the EAB platform.</li><li> Leverage relevant institutional student performance data, statistics, trend analysis, and other data analysis techniques, to develop, test, refine, and validate independent predictive models and inform the work of campus support resources for student success leading to actionable insights.</li><li> Drive the execution of creative data analytic approaches leading to actionable outcomes across functional areas by defining and calculating complex metrics to be analyzed.</li><li> Work on all aspects of creating predictive intelligence including collecting requirements, establishing an analytics work plan, collecting data for exploration, cleansing data, identifying key data features, selecting algorithms, building and testing models, and iteratively improving solutions.</li><li> Develop data driven, insightful analyses to answer questions, with a focus on cause and effect relationships, address challenges and identify opportunities, and provide actionable recommendations.<br></li></ul>Communication &amp; Reporting<br><ul><li> Synthesize qualitative and quantitative solutions into actionable recommendations and frequently communicate those findings to student success partners.</li><li> Leverage story-telling skills to deliver insights that are clear, concise and actionable.</li><li> Present research findings and analytics framework to campus leadership, student support and advisors, an analytics partners at CPP and the CSU Chancellor's Office. Prepare presentations for various audiences and media.</li><li> Interpret complex data analyses by applying findings to contextual settings . Develop insights, reports, and presentations telling a compelling story to enable and influence decision making; participate in peer reviews; and provide context related to data interpretations and/or limitations as appropriate.<br></li></ul>Managing &amp; Supervision<br><ul><li> Manage predictive analytics team including the oversight of projects and the review and validation of findings.</li><li> Align project assignments with staff expertise .</li><li> Serve as a mentor to help build IRPA's analytics team's technical and contextual proficiencies and promote professional development.</li><li> Ensure documentation of all projects are developed and maintained through each cycle.<br></li></ul>Campus Partnerships<br><ul><li> Provide campus partners with contextual understanding of student success data and equity gap data and assist in creating a culture of data-informed decision making.</li><li> Partner with campus units to identify and compile relevant data for equity gap and student success analysis and analytics related to the priorities set by leadership.</li><li> Serve on campus committees related to student success and equity gaps to assess campus data needs and promote usage and understanding.<br></li></ul><strong><u>Minimum Qualifications<br></u></strong><ul><li> Four years of experience as an institutional researcher, economist, quantitative researcher, business operations analyst, data scientist, or another closely related profession.</li><li> The following experiences in a professional or higher education environment:</li><li> Two years applying statistical or mathematical concepts.</li><li> Two years using advanced statistical or data science methods such as logistic regression, machine learning, gradient boosting, Markov chain models, or ensemble methods.</li><li> Two years analyzing large datasets.</li><li>Two years building models from start to finish, including gathering and cleaning data, feature selection, algorithm selection, algorithm tuning, output generation and results interpretation.</li><li> Two years interpreting complex data analyses by applying findings to contextual settings; and developing insights, reports, and presentations telling a compelling story to enable and influence decision making; participating in peer reviews, and providing context related to data interpretations and/or limitations as appropriate.</li><li> Two years constructing comprehensive reports.</li><li> Superior oral presentation skills in support of decision-making processes, and excellent writing skills.</li><li> Demonstrated experience with the full implementation of large-scale projects.</li><li> Ability to function with a high degree of autonomy and creativity.</li><li> Exceptional interpersonal skills coupled with the ability to develop an environment that promotes partnership and transparency with other divisions.</li><li> Ability to manage and motivate technical staff members and managers.</li><li> Excellent oral and written skills required to communicate effectively with diverse academic and administrative constituencies both on and off campus.</li><li> Ability to manage highly complex projects.</li><li> Strong analytical and technical skills.</li><li> Comprehensive knowledge of statistics and research methodologies</li><li> Ability to apply and utilize various statistical and research methods including modern machine learning tools</li><li> Ability to collect and analyze data and information; solve problems and to draw conclusions from visual exploration and analysis of the data collected</li><li> Ability to organize and present data and information in a concise and logical manner</li><li> Ability to prepare and present oral and written reports which are clear, concise and comprehensive</li><li> Ability to conduct and supervise analytic research</li><li> Professional ability to relate well with all University contingencies, students, faculty, staff and public<br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li> A Master's degree from an accredited university in education, analytics, business, public administration, computer science, social science, or other relevant discipline with a quantitative concentration.</li><li> More than five years of demonstrated experience in the field of institutional<br></li></ul>planning/research/information management or analytics and reporting.<br><ul><li> Experience in a large, complex and diverse public higher education institution.</li><li> Experience with student success programs including assessment and data analysis</li><li> Experience with educational data and student information data specifically<br></li></ul>APPOINTMENT AND SALARY<br><br>Salary is competitive and includes a comprehensive benefits package. Salary is competitive and commensurate with qualifications and experience. This is a Management Personnel Plan Level II position with an attractive benefits package, which includes a vacation accrual rate of 16 hours per month, an excellent choice of medical, dental, and vision insurance, long term disability coverage, life insurance and retirement benefits.<br><br><strong><u>Closing Date And How To Apply<br><br></u></strong>Review of complete applications will begin June 18, 2022 and will continue until the position is filled. For application information and materials, visit our website at www.cpp.edu/hr and refer to Job number (63121). All candidates must submit: (1) a formal University application (2) a letter of interest which explains in detail and, where possible, provides examples of how the candidate meets the qualifications specified in this announcement; (3) a current r\\u00e9sum\\u00e9 or curriculum vitae; and (4) the names, titles, addresses and telephone numbers of three references who can provide assessments of the applicant's professional experience, accomplishments and prospect for success in this position.<br><br>BACKGROUND CHECK<br><br>A background check must satisfactorily be completed before a candidate can be offered this position. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current CSU employees who apply for this position. The background check consists of the following: Employment verification, education verification, reference checks, and checks of the following systems and databases: National Social Security Number/Address Locator, Felony/Misdemeanor, National Criminal Database, Federal Criminal, Department of Motor Vehicles, and National Sex Offender Registry.<br><br><strong><u>Additional Information<br><br></u></strong>Cal Poly Pomona hires only individuals lawfully authorized to work in the United States. In compliance with state and federal crime awareness and campus security legislation, including The Jeanne Clery Disclosure of Campus Security Policy and Crime Statistics Act, California Education Code section 67380, and the Higher Education Opportunity Act (HEOA), the Cal Poly Pomona Annual Security and Fire Safety Report is available at: https://www.cpp.edu/campus-safety-plan.shtml<br><br>Cal Poly Pomona is a smoke and tobacco-free campus. Please refer to the link below for policy information. http://www.calstate.edu/EO/EO-1108.html<br><br>CONDITION OF EMPLOYMENT<br><br>The person holding this position is considered a 'limited reporter' under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 as a condition of employment. http://www.calstate.edu/eo/EO-1083.html<br><br>AFFIRMATIVE ACTION/EQUAL OPPORTUNITY EMPLOYER<br><br>Cal Poly Pomona is an Equal Opportunity, Affirmative Action Employer. The university subscribes to all state and federal regulations and prohibits discrimination based on race, color, religion, national origin, sex, gender identity/gender expression, sexual orientation, marital status, pregnancy, age, disability, genetic information, medical condition, and covered veteran status.\", \"employmentType\": \"PART_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"California State Polytechnic University-Pomona\", \"sameAs\": \"https://www.linkedin.com/company/cal-poly-pomona\", \"logo\": \"https://media-exp3.licdn.com/dms/image/C560BAQH8mLo7H_WXuQ/company-logo_200_200/0/1534963476618?e=1634774400&v=beta&t=3X8VgUruorEmEegp-srCiNFObGxVwwKApZRLlFX0LKo\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"California State Polytechnic University-Pomona\", \"value\": \"2192307\"}, \"image\": \"https://media-exp3.licdn.com/dms/image/C560BAQH8mLo7H_WXuQ/company-logo_100_100/0/1534963476618?e=1634774400&v=beta&t=EElJG0vcv8tcUPUbJRtqwASK4_jyLymGGkbi65tHtbw\", \"industry\": \"Higher Education,Government Administration,Financial Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Pomona\", \"addressRegion\": \"CA\", \"postalCode\": \"91799\", \"streetAddress\": null}, \"latitude\": 34.05512, \"longitude\": -117.750046}, \"skills\": \"\", \"title\": \"Director of Analytics for Student Success & Equity (MPP II)\", \"validThrough\": \"2021-08-20T02:00:27.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 60}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}