{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-22T01:35:41.000Z\", \"description\": \"<strong><u>Job Description<br><br></u></strong>The <em>Path Forward Return to Work </em>program at VMware is an 18-week paid returnship for experienced professionals returning to the workforce after taking time off for caregiving. The program is open to individuals who have at least 5 years of professional experience and have been out of the paid workforce for at least 2 years to focus on caring for a child or other dependent. If you meet these criteria, we welcome you to apply. Applicants are not limited to the locations listed. Candidates may apply from anywhere within the US.<br><br><strong>Why would you find this new opportunity exciting?<br><br></strong>Uhana by VMware empowers mobile operators with subscriber-level, radio access network (RAN) analytics, giving them better control of their 4G &amp; 5G networks and maximizing the quality of service they can offer their customers. Uhana correlates and enriches high volumes of streaming data from mobile network elements, in real-time, to provide unprecedented visibility. Using artificial intelligence, Uhana automatically determines the root cause of network issues and recommends remediation.<br><br>We are looking for talented software engineers to join the Uhana Platform team now part of the Service Provider &amp; Edge business unit at VMware. In this role, you will be collaborating with excellent engineers responsible on the overall architecture and scalability of the software system, in addition to hands-on implementation work.<br><br><strong>What will be your responsibilities?<br><br></strong>In this role you will have the ability to contribute to the design and development of the Uhana platform.<br><ul><li>Work with large volumes of data - design scalable software solutions for data ingestion, parsing and processing.</li><li>Develop cloud-based distributed software solutions.</li><li>Help develop efficient solutions for storing and consuming large volumes of data.</li><li>Collaborate with data scientists to understand requirements and build an efficient stream processing system that enables advanced AI based analytics.<br></li></ul>The team is composed of dedicated, bright, talented technologists who manage our global compute infrastructure, architect the real-time data-processing software, and build the distributed software platform to power the next-generation of mobile technology.<br><br><strong>What are we looking for?<br><br></strong>We are looking for a highly-motivated individual who is willing to take up technical challenges, work collaboratively in a team and can learn-and-grow fast.<br><ul><li>2+ years of experience in software architecture, design and development </li><li>Interest in all things distributed in Cloud: Distributed Systems, Big Data, Real-Time Streaming/Processing experience. </li><li>Experience with either Java or Golang</li><li>Strong problem solving and debugging skills </li><li>Highly motivated team player </li><li>Good communication and presentation skills <br></li></ul><strong>Nice to Have<br></strong><ul><li>Experience writing Java applications in a stream processing framework such as Kafka, Flink</li><li>Experience working with cloud-native software frameworks like Kubernetes.</li><li>Exposure to data/ML engineering.<br></li></ul><strong>What are the performance goals during the 18 week returnship you will work towards completing?<br><br></strong>Success in the role is defined by the ability to consistently create high quality code that addresses the business requirement, and is well tested, performant and maintainable.<br><ul><li>You will develop a solid understanding of the platform and functionality it supports in the context of the larger platform. This would be demonstrated by your ability to deliver features and fix bugs, proficiency handling production escalations and being the established service owner for one or two key services.</li><li>You are actively participating in engineering design and development efforts, ensuring that the solution can be scaled horizontally and meets the product requirements and expectations.<br></li></ul><strong>VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: </strong>VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. VMware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.<br><br>This job requisition is not eligible for employment-based immigration sponsored by VMware.<br><br><strong>Category : </strong>University and Recent Grads<br><br><strong>Subcategory: </strong>Internships<br><br><strong><u>Experience<br><br></u></strong><strong>Full Time/ Part Time: </strong>Full Time<br><br><strong>Posted Date:</strong> 2021-05-17<br><br>VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what\\u2019s possible today at http://careers.vmware.com.<br><br>Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"VMware\", \"sameAs\": \"https://www.linkedin.com/company/vmware\", \"logo\": \"https://media-exp3.licdn.com/dms/image/C560BAQGRwuYZeI6aaA/company-logo_200_200/0/1588094413060?e=1634774400&v=beta&t=RHtbVJuSysS3aYM0v9MU3LtNxcDDb-wx3LNnryr9HSs\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"VMware\", \"value\": \"R2109929-en-us\"}, \"image\": \"https://media-exp3.licdn.com/dms/image/C560BAQGRwuYZeI6aaA/company-logo_100_100/0/1588094413060?e=1634774400&v=beta&t=sPJNlJNkPfGZtvSW4qPYDclWNq9zH6G9fm1gC2QjaRs\", \"industry\": \"Information Technology and Services,Computer Software,Financial Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Los Angeles\", \"addressRegion\": \"CA\", \"postalCode\": \"90101\", \"streetAddress\": null}, \"latitude\": 34.05224, \"longitude\": -118.24335}, \"skills\": \"\", \"title\": \"Software Engineer (Returnship) - Opportunity for Working Remotely\", \"validThrough\": \"2021-08-21T01:35:41.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 60}, \"jobLocationType\": \"TELECOMMUTE\", \"applicantLocationRequirements\": {\"@type\": \"Country\", \"name\": \"United States\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}