{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-20T00:00:00.000Z\", \"description\": \"<strong>Introduction<br><br></strong>As a Data Scientist at IBM, you will help transform our clients\\u2019 data into tangible business value by analyzing information, communicating outcomes and collaborating on product development. Work with Best in Class open source and visual tools, along with the most flexible and scalable deployment options. Whether it\\u2019s investigating patient trends or weather patterns, you will work to solve real world problems for the industries transforming how we live.<br><br><strong>Your Role and Responsibilities<br><br></strong>Location: East Coast, US<br><br>The machine learning engineers and data scientist role on our teams is responsible for delivering enabling cognitive solutions to enhance the YourLearning SaaS platform. For more information about IBM's Your Learning platform go to https://yourlearning.ibm.com/about/<br><br><strong>Our Portfolio Currently Includes<br><br></strong><ul><li> Cognitive Activity Recommendations</li><li> Cognitive Badge Recommendations</li><li> Cognitive Channel Recommendations</li><li> Tag Advisor</li><li> Channel Curator Advisor</li><li> Cognitive Data Quality Advisor</li><li> Cognitive Search Expansion<br><br></li></ul>Your Learning AI utilizes a variety of models, including unsupervised and supervised learning techniques, to achieve its accuracy levels. After client training data is collected and assembled, the data is used to train machine learning (ML) models including recurrent neural networks (RNN), Bayesian Classifiers, word2vec, Latent Semantic Analysis (LSA) and DBSCAN clustering. Additionally we use IBM Watson Services such as Natural Language Understanding and Natural Language Classifier and Language Translator.<br><br>In addition to the skills and technologies below, the successful candidate will exhibit curiosity, creative thinking, resiliency, passion and tenacity in pursuit of long-term goals and short term successes.<br><br><strong>Required Technical and Professional Expertise<br><br></strong>Critical Skills<br><br><ul><li>Communications including storytelling through data visualization</li><li>Data Manipulation and Analysis</li><li>Modeling and tuning of Machine Learning Systems</li><li>Deep Learning Systems (CNN, RNN)</li><li>Measurement and communication of ML system accuracy and quality</li><li>Implementation and Maintenance of production systems</li><li>devOps processes<br><br></li></ul>Critical Technologies<br><br><ul><li>Python including: pandas, numpy, tensorflow, scikit_learn, scipy, Flask, nltk</li><li>swagger</li><li>RestAPI development</li><li>SQL</li><li>DB2</li><li>Natural Language Processing (nlp)</li><li>Machine Learning (ML)<br><br></li></ul><strong>Preferred Technical And Professional Expertise<br><br></strong><ul><li>Watson Studio</li><li>Watson Cloud APIs</li><li>github</li><li>jira</li><li>cloudant</li><li>markdown</li><li>knowledge and understanding of Data Privacy and Ethics in AI principles<br><br></li></ul><strong>About Business Unit<br><br></strong>IBM Corporate Headquarters (CHQ) team represents a variety of functions such as marketing, finance, legal, operations, HR, and more, all working together to solve some of the world's most complex problems, help our clients achieve success and build collaborative work environments for IBMers.<br><br><strong>Your Life @ IBM<br><br></strong>Are you craving to learn more? Prepared to solve some of the world's most unique challenges? And ready to shape the future for millions of people? If so, then it's time to join us, express your individuality, unleash your curiosity and discover new possibilities.<br><br>Every IBMer, and potential ones like yourself, has a voice, carves their own path, and uses their expertise to help co-create and add to our story. Together, we have the power to make meaningful change \\u2013 to alter the fabric of our clients, of society and IBM itself, to create a truly positive impact and make the world work better for everyone.<br><br>It's time to define your career.<br><br><strong>About IBM<br><br></strong>IBM's greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries. IBM's greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.<br><br>Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we're also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business.<br><br>At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it's time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.<br><br><strong>Location Statement<br><br></strong><strong>Benefits<br><br></strong>In addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access to<br><br>IBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work.<br><br><ul><li>12 weeks of paid parental bonding leave. Family care options are also available to support eligible employees during COVID-19.</li><li>World-class training and educational resources on our personalized, AI-driven learning platform. IBM's learning culture supports your restless attitude to grow your skills and build the depth and scale of knowledge needed to achieve your career goals.</li><li>Well-being programs to support mental and physical health.</li><li>Financial programs that empower you to plan, save, and manage your money (including expert financial counseling, 401(k), IBM stock discount, etc.).</li><li>Select educational reimbursement opportunities.</li><li>Diverse and inclusive employee resource groups where you can network and connect with IBMers across the globe.</li><li>Giving and volunteer programs to benefit charitable organizations and local communities.</li><li>Discounts on retail products, services, and experiences.<br><br></li></ul>We consider qualified applicants with criminal histories, consistent with applicable law.<br><br><strong>Being You @ IBM<br><br></strong>IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.<br><br>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"IBM\", \"sameAs\": \"https://www.linkedin.com/company/ibm\", \"logo\": \"https://media-exp3.licdn.com/dms/image/C4D0BAQGjwPKNaVZ7jQ/company-logo_200_200/0/1625578658814?e=1634774400&v=beta&t=8wrQXuBKRk3TF6B1GzJzyXhAnCAAUChLs4nfQa66rGI\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"IBM\", \"value\": \"6f705b6eed34a1d7afff008b4373e114\"}, \"image\": \"https://media-exp3.licdn.com/dms/image/C4D0BAQGjwPKNaVZ7jQ/company-logo_100_100/0/1625578658814?e=1634774400&v=beta&t=vtbZ_pBXBxypJC9cqfvRz9YGSpBqRi6wdA5AjZ_vAjU\", \"industry\": \"Computer Hardware\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Austin\", \"addressRegion\": \"TX\", \"postalCode\": \"78746\", \"streetAddress\": null}, \"latitude\": 30.264978, \"longitude\": -97.7466}, \"skills\": \"\", \"title\": \"Machine Learning Engineer / Data Scientist - YourLearning\", \"validThrough\": \"2021-08-20T16:28:05.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}