{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-09-02T05:30:06.000Z\", \"description\": \"<strong>BE PART OF BUILDING THE FUTURE.<br><br></strong>Since our founding in 2009, Pure Storage has empowered innovators to build a better world with data. In less than eight years, Pure reached $1B in sales, faster than nearly every enterprise company in history, and our incredible growth continues to outpace the competition.<br><br>Our mission? Give technologists their time back by delivering a modern data experience that empowers organizations to run their operations as a true, automated, storage as-a-service model seamlessly across multiple clouds.<br><br>The secret sauce? More than 3,000 team members (and growing!) around the world who join forces to invent the next big thing. And then the next one.<br><br><strong><u>We\\u2019ve Only Scratched The Surface Of Our Ambitions , And As We Continue To Gobble Up Market Share, We\\u2019re Blazing Trails And Setting Records<br></u></strong><ul><li> For seven straight years, Pure has been named a leader in the Gartner Magic Quadrant (five years in the MQ for Solid-State Arrays, and two in the newly created MQ for Primary Storage). </li><li> Our customer-first culture and unwavering commitment to innovation have earned us a 2020 Medallia Net Promoter Score , certified by Owen CX, in the top 1% of B2B companies . <br></li></ul>If you, like us, say \\u201cbring it on\\u201d to exciting challenges that change the world, we have endless opportunities where you can make your mark.<br><br><strong>BE PART OF BUILDING THE FUTURE.<br><br></strong>Since our founding in 2009, Pure Storage has empowered innovators to build a better world with data. In less than eight years, Pure reached $1B in sales, faster than nearly every enterprise company in history, and our incredible growth continues to outpace the competition.<br><br>Our mission? Deliver a simple, evergreen data platform that enables everyone to turn data into intelligence and advantage. The secret sauce? More than 3,000 team members (and growing!) around the world who join forces to invent the next big thing. And then the next one.<br><br>The world is experiencing a revolution driven by next-generation technology like AI, machine learning, virtual reality, quantum computing, and self-driving cars\\u2014all of which require unprecedented amounts of data. This sets the stage for Pure\\u2019s technology to grow exponentially in the coming years.<br><br><strong><u>We\\u2019ve Only Scratched The Surface Of Our Ambitions , And As We Continue To Gobble Up Market Share, We\\u2019re Blazing Trails And Setting Records<br></u></strong><ul><li> For five straight years, Gartner has named Pure a leader in the Magic Quadrant for Solid-State Arrays and in 2019, Gartner named Pure a leader in the Magic Quadrant for Primary Storage. </li><li> Our customer-first culture and unwavering commitment to innovation have earned us a 2019 Medallia Net Promoter Score , certified by Owen CX, in the top 1% of B2B companies . <br></li></ul>If you, like us, say \\u201cbring it on\\u201d to exciting challenges that change the world, we have endless opportunities where you can make your mark.<br><br><strong>SHOULD YOU ACCEPT THIS CHALLENGE\\u2026<br><br></strong>With the FlashBlade product, we are building a scale-out all-flash file and object store, designed for the modern world. To really understand how our customers work with data, we are deeply immersed in AI, modern backup, log analytics with Splunk and Elastic, data pipeline with Kafka, cluster computing with Spark, and many more use cases. With the ObjectEngine product we are looking to modernize data protection by driving to a new architecture of F2F2C (Flash to Flash to Cloud).<br><br><strong><u>What You\\u2019ll Be Doing<br></u></strong><ul><li> Design and implement creative new algorithms and technologies for high-performance, highly reliable systems (think six 9\\u2019s) </li><li> Own and deliver innovation end-to-end, from concept to shipped product </li><li> Analyze and solve challenging problems through persistence and insight </li><li> Work as a team with smart peers who inspire you and who are inspired by you </li><li> Make customers really happy, because that\\u2019s why we do what we do </li><li> Learn a ton, whether you know a lot, or nothing about system software <br></li></ul>If this describes you, let's talk! You can take a part in changing how the world works with data.<br><br><strong><u>What You\\u2019ll Need To Bring To This Role...<br></u></strong><ul><li> 5+ years experience using C, C++, Python, Go, Java or related programming languages (&lt; 1 year experience? We have special opportunities for you! Please apply directly to our University roles on our careers page) </li><li> Experience in any number of related systems software projects e.g: Distributed systems, Operating systems, Linux Kernel, Database internals, Hypervisors, Containers, Compiler Optimization, etc. </li><li> Proven design sensibility and the willingness to work in a collaborative, team oriented environment </li><li> A BS degree in Computer Science; Advanced degrees are a bonus! </li><li> Must be willing and able to work in an open office environment. <br></li></ul><strong>BE YOU\\u2014CORPORATE CLONES NEED NOT APPLY.<br><br></strong>Pure is where you ask big questions, think differently, and make an impact. This is not just a job, but a place where you have a voice and can accelerate your career. We value unique thoughts and celebrate individuality, and with ample opportunity to learn, develop yourself, and expand into different roles, joining Pure is an investment in your career journey.<br><br>Through our Pure Equality program, which supports a flourishing field of employee resource groups, we nourish the personal and professional lives of our team members. And our Pure Good Foundation gives back to local and global communities through volunteering and grants.<br><br>And because we understand the value of bringing your full and best self to work, we offer a variety of perks to manage a healthy balance, including flexible time off, wellness resources, and company-sponsored team events.<br><br><strong>PURE IS COMMITTED TO EQUALITY.<br><br></strong>Pure is proud to be an equal opportunity and affirmative action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or any other characteristic legally protected by the laws of the jurisdiction in which you are being considered for hire. If you need assistance or an accommodation due to a disability, you may contact us at <strong>TA-Ops@purestorage.com</strong> .<br><br><strong>APPLICANT &amp; CANDIDATE PERSONAL INFORMATION PRIVACY NOTICE.<br><br></strong>If you're wondering how or why Pure collects or uses information you provide, we invite you to check out our <strong>Applicant &amp; Candidate Personal Information Protection Notice</strong> .<br><br><strong>DEEMED EXPORT LICENSE NOTICE.<br><br></strong>Some positions may require a deemed export license for compliance with applicable laws and regulations. Please note: Pure does not currently sponsor deemed export license applications so we are unable to proceed with applicants requiring stated sponsorship.<br><br><strong>BE YOU\\u2014CORPORATE CLONES NEED NOT APPLY.<br><br></strong>Pure is where you ask big questions, think differently, and make an impact. This is not just a job, but a place where you have a voice and can accelerate your career. We value unique thoughts and celebrate individuality, and with ample opportunity to learn, develop yourself, and expand into different roles, joining Pure is an investment in your career journey.<br><br>Through our Pure Equality program, which supports a flourishing field of employee resource groups, we nourish the personal and professional lives of our team members. And our Pure Good Foundation gives back to local and global communities through volunteering and grants.<br><br>And because we understand the value of bringing your full and best self to work, we offer a variety of perks to manage a healthy balance, including flexible time off, wellness resources, and company-sponsored team events.<br><br><strong>PURE IS COMMITTED TO EQUALITY.<br><br></strong>Research shows that in order to apply for a job women feel they need to meet 100% of the criteria while men usually apply after meeting about 60%. You don't have to meet all the job requirements. If you believe you can do the job and are a good match, we encourage you to apply.<br><br>Pure is proud to be an equal opportunity and affirmative action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or any other characteristic legally protected by the laws of the jurisdiction in which you are being considered for hire.<br><br>If you need assistance or an accommodation due to a disability, you may contact us at <strong>TA-Ops@purestorage.com</strong> .<br><br><strong>APPLICANT &amp; CANDIDATE PERSONAL INFORMATION PRIVACY NOTICE.<br><br></strong>If you're wondering how or why Pure collects or uses information you provide, we invite you to check out our <strong>Applicant &amp; Candidate Personal Information Protection Notice</strong> .<br><br><strong>DEEMED EXPORT LICENSE NOTICE.<br><br></strong>Some positions may require a deemed export license for compliance with applicable laws and regulations. Please note: Pure does not currently sponsor deemed export license applications so we are unable to proceed with applicants requiring stated sponsorship.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Pure Storage\", \"sameAs\": \"https://www.linkedin.com/company/pure-storage\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQF4nPPomOfkiQ/company-logo_200_200/0/1625768518710?e=1638403200&v=beta&t=eT-pVUhcLbr2_b_SDwSxZSdkeHyiP_EdnvhwNgfVOCw\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Pure Storage\", \"value\": \"1606180\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQF4nPPomOfkiQ/company-logo_100_100/0/1625768518710?e=1638403200&v=beta&t=a692vQyhbvGWpjmWylDQMoH7xI1erWJe1hbQse_cgFk\", \"industry\": \"Computer Hardware,Computer Software\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Mountain View\", \"addressRegion\": \"CA\", \"postalCode\": \"94040\", \"streetAddress\": null}, \"latitude\": 37.39008, \"longitude\": -122.08139}, \"skills\": \"\", \"title\": \"Senior Software Engineer, FlashBlade\", \"validThrough\": \"2021-10-02T05:30:06.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 60}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}