{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-14T07:46:37.000Z\", \"description\": \"About the Role:<br><br>Finicity is recognized as a pioneer and leader in Financial Data Access, FinTech, Data Science and Decisioning. Consumers should have full transparency and control of their Financial Data. Finicity expands financial inclusion and increases financial and data literacy.<br><br>Finicity\\u2019s Intelligent Machine Services teams focus on Intelligent Decisioning; Financial Certainty; Attribute, Feature, and Entity Resolution; Payment Intelligence and much more. Join our team to make an impact across all sectors of the economy. Check out Experian Boost, UltraFICO and other Open Banking initiatives for more!<br><br>As a Machine Learning Engineer, you will bring expertise to advance our team\\u2019s Production Data Science Models for internal and external client-facing edge-services. This team is changing industries with advanced Data Science and AI enabled financial interactions.<br><br>Finicity\\u2019s solutions provide Intelligence and real-time access to Financial data. Mastercard has recently acquired Finicity.<br><br>What you will do:<br><br>As a Machine Learning Engineer, you will empower consumers and create business value. You will deploy solutions and design models for Financial Institutions, FinTechs, Small and Medium Sized Businesses, Large Enterprises, Consumers and even Government Agencies and related Ecosystems. In this role, you will focus on Payment Intelligence, building the next generation of tools to make financial transactions simpler and safer for Consumers, Banks, and Businesses. You may also contribute to other solutions including lending, decisioning, financial management, and payment services. The underlying services are Settlement Confidence, Verification Services, Entity Resolution, Attribute and Temporal Analysis and more.<br><br><strong><u>Key Qualifications<br><br></u></strong>Ideally, the Machine Learning Engineers will have deep technical and domain expertise across multiple domains. Examples of our domains include Positive Attribution for Credit/Risk Scores, Decision Science in Lending, Optimization of Payment Streams, and a suite of services for Financial Institutions and FinTechs that enable consumers to transact in refined and innovative ways.<br><ul><li>Master\\u2019s Degree or higher in Data Science, Physics, Econometrics, Computer Science, Mathematics, Statistics or similar field of study required. PhD is preferred.</li><li>8+ years commercial machine/deep learning and modeling experience. Combinations of Software/Data Engineering may be considered with sufficient ML experience.</li><li>A strong understanding of Natural Language Understanding, Computer Vision, Statistical Modeling, Visualization and advanced Data Science techniques/methods.</li><li>Solve problems that are new to the company, the financial industry and to data science.</li><li>Focus on the techniques that will lead to solutions; ability to create models is a plus.</li><li>Gain insights from text, including non-language tokens.</li><li>Ability to perform error analysis of a given model and explain the analysis to others.</li><li>Use the thought process of image annotations in text analysis.</li><li>Ability to reduce dimensions and explain impact, following the logic of PCA or similar.</li><li>Understand which aspects of a model make it work well.</li><li>Familiarity with cutting edge data science concepts, algorithms, and products.</li><li>Mid- to Senior-level Python coding experience required.</li><li>Experience with Kubernetes, Containers, Docker, REST APIs, GraphQL, Event Streams or other delivery mechanisms required.</li><li>Excellent written and oral communication skills on technical and non-technical topics.<br></li></ul>Preferred qualifications include:<br><ul><li>Senior Level Software Development, Data Engineering or Data Science Programming is highly desired.</li><li>Experience with real world applications of discrete, differential, deterministic and probabilistic mathematical structures with applicability to Finance, FinTech, scoring.</li><li>Advanced Interpretation and Validation skills including Statistical methods Classical ML, Deep Learning and Transformer Models and/or Attention Mechanisms.</li><li>Advanced Data Modeling, Querying, Structuring, Architecture and Design skills.</li><li>Exposure to risk evaluation, credit risk modeling.</li><li>Additional Finance and FinTech Experience.<br></li></ul>About Finicity:<br><br><em>Finicity, a Mastercard company, helps individuals, families, and organizations make smarter financial decisions through safe and secure access to fast, high-quality data. Our trusted and proven open banking platform empowers consumers to easily connect their financial data to the apps they choose, transforming the way we experience money for everything from budgeting and payments to investing and lending.<br><br></em><em>Through market-leading data connections, Finicity partners with influential financial institutions and disruptive fintech providers alike to give consumers a leg up in a complicated financial world, helping to improve financial literacy, expand financial inclusion, and ultimately lead to better outcomes. Finicity is headquartered in Salt Lake City, Utah.<br><br></em><strong>Finicity provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected.<br><br></strong>Powered by JazzHR<br><br>qkqy2Uabtg\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Finicity, a Mastercard Company\", \"sameAs\": \"https://www.linkedin.com/company/finicity\", \"logo\": \"https://media-exp3.licdn.com/dms/image/C4E0BAQEWR1zJ52wQEg/company-logo_200_200/0/1569539286171?e=1634169600&v=beta&t=BPeu_WiUX8RbHxZkZKWlOR79qytifPCo9nrwV7x2PXc\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Finicity, a Mastercard Company\", \"value\": \"2855742\"}, \"image\": \"https://media-exp3.licdn.com/dms/image/C4E0BAQEWR1zJ52wQEg/company-logo_100_100/0/1569539286171?e=1634169600&v=beta&t=vMUJUNRPDjjhIgLPrJKiP_Ko1O4_zqSq6Wwx7DG_qEM\", \"industry\": \"Information Technology and Services,Computer Software,Financial Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Salt Lake City\", \"addressRegion\": \"UT\", \"postalCode\": \"84101\", \"streetAddress\": null}, \"latitude\": 40.758476, \"longitude\": -111.888145}, \"skills\": \"\", \"title\": \"Machine Learning Engineer\", \"validThrough\": \"2021-08-13T07:46:37.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 96}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}