{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-17T23:21:38.000Z\", \"description\": \"<em>To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.<br><br></em><strong> Job Category </strong>Products and Technology<strong> Job Details <br><br></strong><strong>Some of the things you\\u2019ll be doing include \\u2026<br></strong><ul><li>Design, build and optimize features and services to enable Service Protection scenarios for Tableau Online.</li><li>Automate infrastructure and application deployments on private and public clouds (preferred: AWS).</li><li>Deploy and maintain server-side applications and services on AWS development and production environments.</li><li>Develop, document, and maintain provisioning, security, configuration, and deployment procedures.</li><li>Deploy and maintain services on AWS development and production environments.</li><li>Resolve product deployment issues.</li><li>Evaluate existing processes &amp; tools and implement changes for better efficiency.</li><li>Provide technical leadership at a component or service scope.</li><li>Participate in the evolution of the system architecture.</li><li>Review and provide detailed feedback on code, documentation, and test plans for features.</li><li>Participate in the design and improvement of our development practices.</li><li>Recruitment: Tableau hires company builders; employees are expected to be on the constant lookout for the best talent to bring on board, helping Tableau continue to build one of the best companies in the world.<br></li></ul><strong><u>Who You Are\\u2026<br></u></strong><ul><li>Experienced. You have 4 or more years of industry (non-intern) experience coding commercial software and a passion for solving complex problems, and 2 + years of experience of using Java/Python to build highly reliable software and services. Experience developing scalable services using open source or contributions toward open source projects is a plus. Experienced in leading projects across development teams, particularly using Agile methodologies. At least a year with hands-on AWS experience<br></li></ul><strong>Technical</strong>. You're fluent in commonly used design patterns and can constructively review the work of others to ensure high quality. You're familiar with services and different service-oriented architectures. You can quickly see and understand architecture and where your team fits in. You have a keen eye for quality and are a strong advocate for engineering excellence.<br><br><strong>DevOps Mindset.</strong>You are familiar with Site Reliability Engineering (SRE) concepts. You treat operational issues as if they are software problems. You view software as a primary tool to manage, maintain, fix, and extend systems required to support large development environments. You promote operational excellence!<br><br><strong>A True Team Player</strong>. You enjoy leading, collaborating, learning from or teaching others so we can all become better developers.<br><br><strong>Customer Advocate</strong>. You understand customer requirements and prioritize for maximum customer/user experience.<br><br><strong>Passionate.</strong> You are passionate about technology and the work you do, you always want to do your best to delight the customers, help your team, and strive for excellence.<br><br><strong>You are a Recruiter!</strong> Tableau hires company builders and, in this role, you will be asked to be on the constant lookout for the best talent to bring on board to help us continue to build one of the best companies in the world.<strong> Accommodations <br><br></strong>If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.<br><br><strong> Posting Statement <br><br></strong>At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.<br><br><u>Salesforce.com</u> and <u>Salesforce.org</u> are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. <u>Salesforce.com</u> and <u>Salesforce.org</u> do not accept unsolicited headhunter and agency resumes. <u>Salesforce.com</u> and <u>Salesforce.org</u> will not pay any third-party agency or company that does not have a signed agreement with <u>Salesforce.com</u> or <u>Salesforce.org</u> .<br><br>Salesforce welcomes all.\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Salesforce\", \"sameAs\": \"https://www.linkedin.com/company/salesforce\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQHZ9xYomLW7zg/company-logo_200_200/0/1591198956689?e=1637193600&v=beta&t=AaT0p0k1O3x41W1ocKdM_VdDT0cpo1qi6aqQN-9lT_8\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Salesforce\", \"value\": \"JR98041-1\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQHZ9xYomLW7zg/company-logo_100_100/0/1591198956689?e=1637193600&v=beta&t=Fx5-q6PYJa1HO51c11G8C_bGAGQEXPLK0QZDEvcXeYQ\", \"industry\": \"Computer Software,Information Technology and Services,Internet\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Bellevue\", \"addressRegion\": \"WA\", \"postalCode\": \"98007\", \"streetAddress\": null}, \"latitude\": 47.6137, \"longitude\": -122.19093}, \"skills\": \"\", \"title\": \"Senior Software Engineer\", \"validThrough\": \"2021-09-16T23:21:37.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 48}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}