{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-07-21T02:06:11.000Z\", \"description\": \"<strong><u>Job Description<br><br></u></strong>Gallagher is a global leader in insurance, risk management and consulting services. We help businesses grow, communities thrive and people prosper. We live a culture defined by The Gallagher Way, our set of shared values and guiding tenets. A culture driven by our people, over 30,000 strong, serving our clients with customized solutions that will protect them and fuel their futures.<br><br>Gallagher Technology Services (GTS) provides and maintains quality, value-added core and common applications and information management solutions to enable the business strategies of Gallagher and its operating divisions.<br><br><strong><u>Position Summary<br><br></u></strong>The Web Developer role will ride the hybrid line between back-end/front-end development, user experience, information architecture, development workflows while being a strong advocate for security and data privacy. The developer will have a passion for web development and an insatiable curiosity that keeps them learning new techniques, patterns and processes to elevate their skills and the product delivered. The Web Developer Role will be responsible for crafting and maintaining solutions within Content Management System frameworks (primarily Sitecore) that allow content editors to intuitively create, manage and publish content, while also delivering a product to our front end users that adheres to modern day best practices for usability, accessibility and performance. The successful candidate will take pride in writing clean, readable, reusable and semantic code.<br><br><strong><u>Essential Duties And Responsibility<br></u></strong><ul> <li> Performs full application life cycle development within a CMS Framework through planning, designing, testing, documenting and deploying adhering to established enterprise architecture vison, design, policies, and procedures. Uses established coding patterns and paradigms. Works within the development team building web functionality, services and other back-end application functionality, including but not limited to the following technologies: Sitecore, C#, .NET, MVC, Web API, HTML, SCSS and JavaScript </li> <li> Part of an agile software development team responsible for designing and developing internet-facing websites </li> <li> Investigates and resolves errors and bugs within platform as well as troubleshoot and liaise with vendors on issues within CMS platforms. Troubleshoot server and network level issues with our respective discipline team partners. </li> <li> Perform code reviews of other developers to ensure conformance with coding and security standards. </li> <li> Provide evaluation of business requirements and feature requests to determine technical requirements and goals to arrive at proposed technical solutions - all within an agile methodology working pattern. </li> <li> Create and maintain documentation of features and custom code development. </li> <li> Work closely and cohesively with user experience and more core front-end development team members to execute projects within development release cycle process. </li> <li> Maintain legacy code and existing web properties. </li> <li> Work hand-in-hand with other Web Developers and train and mentor their growth. Review code generated by other developers and provide suggestions and insights into optimization and scalability for enterprise deployment. </li> <br><br></ul><strong><u>Required<br></u></strong><ul> <li> Minimum Bachelor\\u2019s Degree or related experience, Advanced degree preferred in Computer Science or related discipline </li> <li> 5+ years of practical, relevant working experience in web technology development, within a Continuous Integration multi-staged environment flow. </li> <li> 5+ years programming experience, demonstrated ability using .NET technologies - specifically.NET MVC 4 or above, C#. (Exposure to .NET Core is a plus) </li> <li> Experience developing within Sitecore CMS. Broad knowledge and understanding of the features and parts that piece together to deliver a web experience on a Sitecore Platform: Powershell, Sitecore Forms, Unicorn, SOLR Indexes, Pipelines. </li> <li> Strong command of Front-End Development Technologies: HTML, CSS, JavaScript, JavaScript Libraries. Responsive Web Development is the front end language you speak. </li> <li> Experience in both creating and consuming Web Services </li> <li> Solid experience in working in team settings leveraging Source Control systems for versioning and branching. (preferably GIT) </li> <li> Strong experience in the Microsoft stack of technologies (TFS, IIS, SQL Server) + Octopus Deploy. </li> <li> Well-versed in web security and sensitive data protection. </li> <li> Experience with SQL Server development (stored procedures, functions, in memory objects, query optimization) is a plus </li> <br><br></ul><strong><u>Work Traits<br></u></strong><ul> <li> Motivated self-starter, continual learner, voracious curiosity, process-oriented with high attention to detail. </li> <li> Ability to work in fast-paced environment and flexibility to accommodate demanding projects schedules. </li> <li> Strong interpersonal and communication skills (written and oral). </li> <li> Ability to foster a cooperative work environment. </li> <li> Strong attention to detail. </li> <li> Demonstrated ability to prioritize and manage multiple tasks simultaneously </li> <li> Proven ability to deliver excellent customer service </li> <li> Good analytical and problem solving skills </li> <br><br></ul><strong><u>U.S. Eligibility Requirements<br></u></strong><ul> <li> Interested candidates must submit an application and resume/CV online to be considered </li> <li> Must be 18 years of age or older </li> <li> Must be willing to submit to a background investigation; any offer of employment is conditioned upon the successful completion of a background investigation </li> <li> Must have unrestricted work authorization to work in the United States. For U.S. employment opportunities, Gallagher hires U.S. citizens, permanent residents, asylees, refugees, and temporary residents. Temporary residence does not include those with non-immigrant work authorization (F, J, H or L visas), such as students in practical training status. Exceptions to these requirements will be determined based on shortage of qualified candidates with a particular skill. Gallagher will require proof of work authorization </li> <li> Must be willing to execute Gallagher's Employee Agreement, or the Non-Disclosure and Confidentiality Agreement, which requires, among other things, post-employment obligations relating to non-solicitation, confidentiality and non-disclosure </li> <br></ul><em>Gallagher believes that all persons are entitled to equal employment opportunity and does not discriminate against nor favor any applicant because of race, color, religion, sex, age, veteran status, disability, national origin, or any other legally protected status. Equal employment opportunity will be extended in all aspects of the employer-employee relationship, including, but not limited to, recruitment, hiring, training, promotion, transfer, demotion, compensation, benefits, layoff, and termination. In addition, Gallagher will make reasonable accommodations to known physical or mental limitations of an otherwise qualified applicant with a disability, unless the accommodation would impose an undue hardship on the operation of our business.<br><br></em><strong>Job<br><br></strong>Information Technology<br><br><strong>Primary Location<br><br></strong>United States-Illinois-Rolling Meadows<br><br><strong>Organization<br><br></strong>Corp - Home Office<br><br><strong>Schedule<br><br></strong>Full-time<br><br><strong><u>Qualifications<br><br></u></strong><strong>Job Qualifications<br><br></strong>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Gallagher\", \"sameAs\": \"https://www.linkedin.com/company/gallagher-global\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQHrx2oGCj_8-Q/company-logo_200_200/0/1606921795809?e=1634774400&v=beta&t=-UP_mI7a4AMa0dHHj2f1B32K0YLEweOZc-B5Wd40Fjk\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Gallagher\", \"value\": \"75466\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4D0BAQHrx2oGCj_8-Q/company-logo_100_100/0/1606921795809?e=1634774400&v=beta&t=wqeaf3JE0PK6OzlTJido9vV5btmP0ru4g-oxMR1c0jM\", \"industry\": \"Insurance\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Rolling Meadows\", \"addressRegion\": \"IL\", \"postalCode\": \"60008\", \"streetAddress\": null}, \"latitude\": 42.080162, \"longitude\": -88.02519}, \"skills\": \"\", \"title\": \"Web Developer\", \"validThrough\": \"2021-08-20T02:06:10.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 60}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}