{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-09-08T03:11:48.000Z\", \"description\": \"Organization: Accenture Federal Services<br><br>Location: Springfield, VA and Washington, DC<br><br>We are:<br><br>People who use technology to solve hard problems. Including ones that did not exist a few years ago. We are a U.S. Federal subsidiary, drawing from the power of Accenture\\u2014one of only five Global Strategic Partners with ServiceNow. We deliver the integrated, mobile and interactive experience that the people in our country demand. We strengthen the nation\\u2019s security with workflow automation, intelligent operations and machine learning. We\\u2019re passionate and honest. And we thrive in a world of constant change.<br><br>You are:<br><br>\\u202f\\u202f\\u202f<br><br>A proactive thinker who is willing to take a chance. Curious and self-motivated, you\\u2019re willing to explore new technologies. You\\u2019re ready to push boundaries\\u2014and yourself. You\\u2019re here to improve the way our country works because you care. And you\\u2019re ready to share your ideas with our team, knowing we\\u2019ll listen.<br><br>T he work:\\u202f\\u202f<br><br><li> Providing software configuration across various technical areas<br><br></li><li> Analyze business requirements and develop technical requirements<br><br></li><li> Develop and design and applications modules workflows and catalog requests<br><br></li><li> Developing and delivering ServiceNow-based solutions for clients<br><br></li>Here\\u2019s what you need:- Experience with JavaScript development in ServiceNow components<br><br><li> US Citizenship; dual citizens not eligible<br><br></li>Bonus points if you have:<br><br><li> Working knowledge of Linux operating system<br><br></li><li> Understanding of JavaScript<br><br></li><li> Web Services Integration (SOAP, REST, and JSON)<br><br></li><li> System/Process Automation (Orchestration) experience<br><br></li><li> Experienced in the System Development Life Cycle (SDLC) processes including client requirement analysis and system design<br><br></li><li> You\\u2019ve managed a new SNOW implementation and/or SNOW upgrades<br><br></li><li> You\\u2019ve got DevOps experience<br><br></li><li> You got experience with governance/service management/operations<br><br></li><li> You have experience managing remote teams<br><br></li><li> You've got an ITIL certification<br><br></li>An active security clearance or the ability to obtain one may be required for this role.<br><br>Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.<br><br>Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status).<br><br>Accenture is a Federal Contractor and an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.<br><br>Equal Employment Opportunity<br><br>All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.<br><br>Job candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.<br><br>Accenture is committed to providing veteran employment opportunities to our service men and women.<br><br><em><strong>What We Believe<br><br></strong></em><em>We have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment.<br><br></em><em>Inclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here<br><br></em><em><strong>Equal Employment Opportunity Statement<br><br></strong></em><em>Accenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation.<br><br></em><em>All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.<br><br></em><em>Accenture is committed to providing veteran employment opportunities to our service men and women.<br><br></em><em>For details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement.<br><br></em><em><strong>Requesting An Accommodation<br><br></strong></em><em>Accenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.<br><br></em><em>If you would like to be considered for employment opportunities with Accenture and have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter.<br><br></em><em><strong>Other Employment Statements<br><br></strong></em><em>Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.<br><br></em><em>Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.<br><br></em><em>Job candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.<br><br></em><em>The Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.<br><br></em>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Accenture Federal Services\", \"sameAs\": \"https://www.linkedin.com/company/accenturefederalservices\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQESB7tVT0r63g/company-logo_200_200/0/1628182923654?e=1639008000&v=beta&t=8lsmSE_wTSvUywUA1PEku9fedUE52UNaNVYpoz2tEX0\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Accenture Federal Services\", \"value\": \"00875704\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C4E0BAQESB7tVT0r63g/company-logo_100_100/0/1628182923654?e=1639008000&v=beta&t=Dg60LIX4hcl1wZdmRvHdaPn40GHSdaWXVvdMAJ93zG4\", \"industry\": \"Information Technology and Services,Computer Software,Financial Services\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Arlington\", \"addressRegion\": \"VA\", \"postalCode\": \"22210\", \"streetAddress\": null}, \"latitude\": 38.890762, \"longitude\": -77.084755}, \"skills\": \"\", \"title\": \"Federal - ServiceNow Senior Developer\", \"validThrough\": \"2021-10-08T03:11:47.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}