{
  "job": {
    "title": "je",
    "industry": "job_industry",
    "description": "{\"@context\": \"http://schema.org\", \"@type\": \"JobPosting\", \"datePosted\": \"2021-08-25T17:24:47.000Z\", \"description\": \"<p><strong>WHO WE ARE:</strong></p><p>Par Pacific is a growth-oriented company that owns and operates market-leading energy and infrastructure businesses in logistically-complex markets. Par Pacific combines experience in the oil and gas industry with corporate financing know-how. We bring this unique strength to complex markets where we seek out diamonds in the rough. As a nimble, entrepreneurial organization, we actively pursue new opportunities in response to local market demands and changing external environments.</p><p>&nbsp;</p><p><strong>The Role</strong>&nbsp;</p><p>Reporting to the Engineering Manager,&nbsp;<em>you will be proving exemplary customer service to our clients.&nbsp;</em> As part of your specific responsibilities, in the following areas, you will:&nbsp;</p><ul><li>Performing process design associated with refinery improvements, including safety, environmental compliance, profitability, efficiency, and control systems/technology.</li><li>Providing technical support to refinery operating and maintenance personnel.</li><li>Perform and/or manage all phases of engineering projects from conceptual studies, process design, cost estimating, detailed engineering, procurement, construction, through startup.</li><li>Identify and develop refinery improvement projects.</li><li>Develop economic justification for refinery improvements.</li><li>Make recommendations for modifications to improve refinery operations.</li><li>Prepare engineering specifications for equipment and instrument bid packages.</li><li>Assist with design and implementation of new distributed control systems (DCSs).</li><li>Perform process optimization studies.</li><li>Participate in process hazard analyses (PHA) and management of change (MOC).</li><li>Administer and/or manage assigned refinery engineering/inspection programs.</li><li>Perform equipment process inspections during shutdowns/turnarounds.</li><li>Solicit and evaluate bids for equipment and construction.</li><li>Provide technical support to other refinery departments (Operations, Maintenance, Environmental, Safety).</li><li>Monitor and evaluate process unit performance.</li><li>Utilize simulation software to identify and debottleneck unit constraints.</li></ul><p><br></p><p><strong>The Opportunity</strong>&nbsp;</p><ul><li>Process Engineer<em>&nbsp;</em>at a Growth-Oriented Energy Company</li><li>Work on full life cycle projects</li><li>Exposure to maintenance and operations</li><li>Enjoy exposure to Senior Management while providing analysis of the Company's forecasting and business planning initiatives<em>.</em></li></ul><p>&nbsp;</p><p><strong>The Requirements</strong>&nbsp;</p><p>To meet the basic qualification for this role, you will have legal authorization to work permanently in the United States for any employer without requiring a visa transfer or visa sponsorship. To be a good fit for the&nbsp;Process Engineer<em>&nbsp;</em>opportunity, you will have:&nbsp;</p><p><br></p><ul><li>A bachelor's degree in Chemical Engineering.&nbsp;</li><li>3-5 years of experience working as a process engineer&nbsp;in a refinery is highly preferred;&nbsp;petrochemical&nbsp;industry experience will also be considered. We also will consider more experienced, senior-level candidates.</li><li>Solid understanding of heat transfer, fluid mechanics, distillation, and control systems.</li><li>The ability to independently evaluate, select and apply standard engineering techniques and procedures.</li><li>Self-motivation and a strong sense of ownership and follow-through.</li><li>The ability to achieve goals independently and contribute as a team player.</li><li>Demonstrated problem-solving skills.</li><li>Project management skills, including strong organizational and prioritization abilities.</li><li>Confident verbal&nbsp;and written communication skills.</li></ul><p>&nbsp;&nbsp;</p><p>Note: This description is intended to give you a general overview of the position and is not an exhaustive listing of duties and responsibilities.&nbsp;</p><p>&nbsp;</p><p><strong><u>More Good Reasons to work for Par:&nbsp;</u><em>&nbsp;</em></strong></p><p>&nbsp;</p><p><strong>Unique culture</strong>&nbsp;</p><p>There is nothing ordinary about Par Pacific -- a niche player in the energy space that operates in logistically complex markets. And&nbsp;there's&nbsp;certainly nothing ordinary about Par Pacific people. We are driven, hardworking, entrepreneur-minded professionals that love to win. If that describes you,&nbsp;you'll&nbsp;fit right in.&nbsp;</p><p>&nbsp;</p><p><strong>Location, location, location</strong>&nbsp;</p><p>Because Par Pacific&nbsp;is located in&nbsp;some of the most beautiful places throughout the country, our employees get to make these places their home and enrich their lives. The office where&nbsp;you'll&nbsp;work is in the&nbsp;Tacoma, WA area in a&nbsp;vibrant&nbsp;area of the city with plenty of places for lunch and opportunities to wind down after work with plenty of beautiful scenery to explore.</p><p>&nbsp;</p><p><strong>Opportunistic growth strategy</strong>&nbsp;</p><p>At Par Pacific, we look for operations with strong fundamentals and great employees who can move a business forward. Our management team has deep experience in the energy industry, as well as in leading mergers, acquisitions, and integrations of newly acquired companies.&nbsp;</p><p>&nbsp;</p><p><strong>Excellent compensation</strong>&nbsp;</p><p>In addition to a competitive salary, we offer a strong comprehensive benefits package that includes medical, dental and vision insurance; a robust allotment of paid time off; a 401(k) with company match; retirement savings plans; educational reimbursement; and more.&nbsp;</p><p>&nbsp;</p><p><strong>Keys to Success</strong>&nbsp;</p><p>We are looking for a highly motivated, self-starter with a positive attitude. Candidates should have a natural thirst for knowledge and curiosity to drive personal and professional development.&nbsp;</p><p>In addition,&nbsp;in order to&nbsp;be a successful&nbsp;Process Engineer<em>&nbsp;</em>you will:&nbsp;</p><ul><li>Be proactive&nbsp;</li><li>Achieve goals independently and contribute as a team player&nbsp;</li><li>Identify ways to improve processes and controls&nbsp;</li><li>Combine analytical skills and creativity in solving problems&nbsp;</li><li>Strong work ethic and accountability&nbsp;</li><li>Effectively communicate with the team and ask questions&nbsp;</li></ul><p>&nbsp;</p><p><strong>The Company</strong>&nbsp;</p><p>&nbsp;</p><p>Par Pacific Holdings, Inc., based in Houston, Texas, owns,&nbsp;manages,&nbsp;and maintains interests in energy and infrastructure businesses. Par Pacific's strategy is to identify, acquire and operate energy and infrastructure businesses with attractive competitive positions. We own and operate refineries in Hawaii,&nbsp;Washington&nbsp;and Wyoming, with total operating throughput capacity of over 150&nbsp;Mbpd. We own and operate one of the largest energy infrastructure networks in Hawaii with a logistics network supplying the major islands of the state. In Wyoming, Par Pacific owns a refinery and associated logistics&nbsp;network in a niche market. We operate 123 fuel retail outlets in Hawaii, Washington, and Idaho. Par Pacific has an active, opportunistic growth strategy. Our common stock is publicly traded on the NYSE under the trading symbol \\\"PARR\\\".&nbsp;</p><p>&nbsp;</p><p>Note: Par Pacific will not accept calls from third-party recruiters. All candidates are required to apply through this web posting.&nbsp;</p><p>&nbsp;</p><ul><li>Par Pacific is an equal opportunity employer. Par Pacific prohibits discrimination and harassment of any type and affords equal employment opportunities to employees and applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status,<strong>\\u202f</strong>genetic information or any other status protected by applicable law.&nbsp;</li></ul>\", \"employmentType\": \"FULL_TIME\", \"hiringOrganization\": {\"@type\": \"Organization\", \"name\": \"Par Pacific Holdings, Inc.\", \"sameAs\": \"https://www.linkedin.com/company/par-pacific\", \"logo\": \"https://media-exp1.licdn.com/dms/image/C560BAQEdvODIC1y31g/company-logo_200_200/0/1602004972966?e=1637798400&v=beta&t=fLsLOLqWKKk7sU8j_jDZzLm2p6IXjCD8QUSszFVkE44\"}, \"identifier\": {\"@type\": \"PropertyValue\", \"name\": \"Par Pacific Holdings, Inc.\"}, \"image\": \"https://media-exp1.licdn.com/dms/image/C560BAQEdvODIC1y31g/company-logo_100_100/0/1602004972966?e=1637798400&v=beta&t=3tTGDVeCuZrDqyhaFgg_Gu1eO284F1Jl6EU-ZgZuhPc\", \"industry\": \"Oil & Energy\", \"jobLocation\": {\"@type\": \"Place\", \"address\": {\"@type\": \"PostalAddress\", \"addressCountry\": \"US\", \"addressLocality\": \"Tacoma\", \"addressRegion\": \"WA\", \"postalCode\": \"98406\", \"streetAddress\": null}, \"latitude\": 47.25308, \"longitude\": -122.44153}, \"skills\": \"\", \"title\": \"Process Engineer\", \"validThrough\": \"2021-09-24T17:24:46.000Z\", \"educationRequirements\": {\"@type\": \"EducationalOccupationalCredential\", \"credentialCategory\": \"bachelor degree\"}, \"experienceRequirements\": {\"@type\": \"OccupationalExperienceRequirements\", \"monthsOfExperience\": 36}}",
    "employment_type": "job_employment_type",
    "date_posted": "job_date_posted"
  },
  "company": {
    "name": "company_name",
    "link": "company_linkedin_link"
  },
  "education": {
    "required_credential": "job_required_credential"
  },
  "experience": {
    "months_of_experience": "job_months_of_experience",
    "seniority_level": "seniority_level"
  },
  "salary": {
    "currency": "salary_currency",
    "min_value": "salary_min_value",
    "max_value": "salary_max_value",
    "unit": "salary_unit"
  },
  "location": {
    "country": "country",
    "locality": "locality",
    "region": "region",
    "postal_code": "postal_code",
    "street_address": "street_address",
    "latitude": "latitude",
    "longitude": "longitude"
  }
}